{
  "_A_TEXTAREA_COMPONENT_DESCRIPTION_": "Компонент <strong lang=\"en\">ATextarea</strong> предоставляет функциональность текстового поля с поддержкой различных настроек, таких как масштабируемость, наличие кнопки очистки и возможность изменения размера. Компонент также поддерживает работу с метками, текстом подсказки и отображением ошибок.",
  "_A_TEXTAREA_COMPONENT_NAME_": "Текстовое поле в несколько строк",
  "_A_TEXTAREA_GROUP_IS_SCALABLE_DESCRIPTION_": "Этот пример демонстрирует текстовое поле, у которого высота автоматически подстраивается под содержимое. При добавлении новых строк текстовое поле расширяется, обеспечивая оптимальный размер для отображения всего введенного текста.",
  "_A_TEXTAREA_GROUP_IS_SCALABLE_HEADER_": "Масштабируемое текстовое поле",
  "_A_TEXTAREA_GROUP_RESIZE_DESCRIPTION_": "В этом примере показаны различные варианты настройки возможности изменения размера текстового поля. Вы можете задать вертикальное изменение размера <strong lang=\"en\">(resize='v')</strong>, горизонтальное изменение размера <strong lang=\"en\">(resize='h')</strong>, полностью отключить возможность изменения размера <strong lang=\"en\">(resize='none')</strong> или разрешить автоматическое изменение размера <strong lang=\"en\">(resize='auto')</strong>. Каждый вариант демонстрируется с помощью соответствующего текстового поля.",
  "_A_TEXTAREA_GROUP_RESIZE_HEADER_": "Изменение размера текстового поля",
  "_A_TEXTAREA_PROPS_IS_SCALABLE_DESCRIPTION_": "Определяет, должна ли высота текстового поля изменяться в зависимости от количества содержимого. Если этот параметр установлен в <strong lang=\"en\">true</strong>, высота текстового поля автоматически изменяется при добавлении или удалении символов.",
  "_A_TEXTAREA_PROPS_RESIZE_DESCRIPTION_": "Определяет, как пользователь может изменять размеры текстового поля. Доступные варианты: <strong lang=\"en\">'v'</strong> — изменение высоты, <strong lang=\"en\">'h'</strong> — изменение ширины, <strong lang=\"en\">'none'</strong> — изменение размеров запрещено, <strong lang=\"en\">'auto'</strong> — изменение размеров автоматически.",
  "_A_TEXTAREA_PROPS_ROWS_DESCRIPTION_": "Устанавливает количество строк текстового поля."
}