{
  "_A_ELEMENT_COMPONENT_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> es un elemento universal con configuración avanzada a través de props, permitiendo personalizar la accesibilidad, clases, IDs, estado de carga y otros parámetros. Soporta la personalización de apariencia, texto, iconos y manejo de eventos como clics, convirtiéndolo en una herramienta poderosa para crear interfaces.",
  "_A_ELEMENT_COMPONENT_NAME_": "Elemento",
  "_A_ELEMENT_EVENTS_CLICK_DESCRIPTION_": "Se activa cuando se hace clic en el componente.",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_": "<div>ESTO ES UN <strong>TOOLTIP HTML MÁGICO!!!!</strong></div><div>Segunda línea</div>",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_{{number}}_": "<div>ESTO ES UN <strong>TOOLTIP HTML MÁGICO!!!!</strong></div><div>Segunda línea</div><div>Número: {{ number }}</div>",
  "_A_ELEMENT_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar un elemento en estado inactivo y establecer los atributos de accesibilidad correspondientes. Para esto, puede usar la propiedad \"<strong lang=\"en\">aria-disabled</strong>\" para indicar el estado inactivo. Esto permite usar eventos como el enfoque o el desplazamiento, mientras que el elemento permanece inactivo para clics.",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_HEADER_": "Elemento inactivo usando <strong lang=\"en\">aria-disabled</strong>",
  "_A_ELEMENT_GROUP_BASIC_CLASS_DESCRIPTION_": "Hay muchas clases <strong lang=\"en\">CSS</strong> que se pueden usar con el elemento.",
  "_A_ELEMENT_GROUP_BASIC_CLASS_HEADER_": "Clases básicas",
  "_A_ELEMENT_GROUP_BASIC_DESCRIPTION_": "Hay varios tipos que se pueden usar con el elemento: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> y <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_GROUP_COMPLEX_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite usar varias propiedades y eventos complejos para configurar y gestionar el elemento con funciones avanzadas. En el siguiente ejemplo, se utilizan varias propiedades y eventos para configurar el elemento y gestionar su estado de carga.",
  "_A_ELEMENT_GROUP_COMPLEX_HEADER_": "Uso de propiedades y eventos complejos",
  "_A_ELEMENT_GROUP_DISABLED_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite desactivar el elemento mediante la propiedad \"<strong lang=\"en\">disabled</strong>\". Esto hace que el elemento no sea interactivo tanto visual como funcionalmente.",
  "_A_ELEMENT_GROUP_DISABLED_HEADER_": "Desactivación del elemento",
  "_A_ELEMENT_GROUP_GROUP_DESCRIPTION_": "Agrupe una serie de elementos en una fila.",
  "_A_ELEMENT_GROUP_GROUP_HEADER_": "Agrupación horizontal de elementos",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Puede agrupar elementos en una tabla.",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Agrupación tabular de elementos",
  "_A_ELEMENT_GROUP_GROUP_SIZES_DESCRIPTION_": "En lugar de aplicar clases de tamaño a cada elemento del grupo, simplemente agregue <strong lang=\"en\">.a_btn_group_large</strong> o <strong lang=\"en\">.a_btn_group_small</strong> a cada <strong lang=\"en\">.a_btn_group</strong>, incluyendo cada grupo anidado si tiene varios niveles.",
  "_A_ELEMENT_GROUP_GROUP_SIZES_HEADER_": "Tamaño del grupo de elementos",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Coloque elementos en una columna vertical.",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_HEADER_": "Agrupación vertical de elementos",
  "_A_ELEMENT_GROUP_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar contenido <strong lang=\"en\">HTML</strong> de forma segura sin confiar completamente en él. Usando la propiedad \"<strong lang=\"en\">html</strong>\" y la biblioteca <strong lang=\"en\">DomPurify</strong>, el contenido <strong lang=\"en\">HTML</strong> proporcionado se limpia y se muestra de forma segura en el elemento.",
  "_A_ELEMENT_GROUP_HTML_HEADER_": "Visualización segura de contenido <strong lang=\"en\">HTML</strong> usando <strong lang=\"en\">DomPurify</strong>",
  "_A_ELEMENT_GROUP_ICONS_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar iconos a la izquierda y derecha del elemento usando las propiedades \"<strong lang=\"en\">:icon-left</strong>\" y \"<strong lang=\"en\">:icon-right</strong>\". Puede establecer diferentes iconos para diferentes dispositivos para lograr una apariencia personalizada.",
  "_A_ELEMENT_GROUP_ICONS_HEADER_": "Uso de propiedades de iconos",
  "_A_ELEMENT_GROUP_LOADING_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar el elemento en estado de carga con un indicador de carga. También puede especificar la alineación del indicador de carga. Esto puede ser útil para representar un proceso en segundo plano que requiere que el usuario espere a que se complete.",
  "_A_ELEMENT_GROUP_LOADING_HEADER_": "Elemento en estado de carga y alineación del indicador de carga",
  "_A_ELEMENT_GROUP_OUTLINE_DESCRIPTION_": "¿Necesita un elemento pero sin colores de fondo brillantes? Reemplace las clases de modificadores estándar con clases <strong lang=\"en\">.a_btn_outline_*</strong> para eliminar todas las imágenes y colores de fondo en cualquier elemento.",
  "_A_ELEMENT_GROUP_OUTLINE_HEADER_": "Elementos con contorno",
  "_A_ELEMENT_GROUP_SAFE_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite usar contenido <strong lang=\"en\">HTML</strong> seguro como una cadena dentro del elemento. Cuando se habilita la propiedad \"<strong lang=\"en\">safe-html</strong>\" y se pasa una cadena de contenido <strong lang=\"en\">HTML</strong>, el contenido <strong lang=\"en\">HTML</strong> proporcionado se trata con confianza y se inserta directamente a través del atributo <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_ELEMENT_GROUP_SAFE_HTML_HEADER_": "Uso de contenido <strong lang=\"en\">HTML</strong> seguro como cadena dentro del elemento",
  "_A_ELEMENT_GROUP_SIZES_DESCRIPTION_": "¿Quiere elementos más grandes o más pequeños? Agregue <strong lang=\"en\">.a_btn_large</strong> o <strong lang=\"en\">.a_btn_small</strong> para tamaños adicionales.",
  "_A_ELEMENT_GROUP_SIZES_HEADER_": "Tamaños de elementos",
  "_A_ELEMENT_GROUP_SLOT_APPEND_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar contenido adicional después del texto del elemento usando el slot \"<strong lang=\"en\">buttonAppend</strong>\". El contenido colocado en este slot aparecerá después del texto del elemento.",
  "_A_ELEMENT_GROUP_SLOT_APPEND_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite colocar contenido personalizado dentro del elemento usando el slot predeterminado \"<strong lang=\"en\">:slots='default'</strong>\". El contenido colocado en este slot se mostrará dentro del elemento.",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_HEADER_": "Uso del slot predeterminado",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar contenido adicional antes del texto del elemento usando el slot \"<strong lang=\"en\">buttonPrepend</strong>\". El contenido colocado en este slot aparecerá antes del texto del elemento.",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_TITLE_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite definir contenido <strong lang=\"en\">HTML</strong> personalizado para el título del elemento usando el slot \"<strong lang=\"en\">buttonTitle</strong>\" en combinación con el atributo \"<strong lang=\"en\">:is-title-html</strong>\". El contenido colocado en este slot se utilizará como título <strong lang=\"en\">HTML</strong> para el elemento.",
  "_A_ELEMENT_GROUP_SLOT_TITLE_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonTitle</strong>\" para el título <strong lang=\"en\">HTML</strong>",
  "_A_ELEMENT_GROUP_STOP_DESCRIPTION_": "Establecer la <strong lang=\"en\">props</strong> \"stop\" en un valor booleano se puede usar para controlar si el evento debe propagarse o no. El ejemplo muestra dos escenarios diferentes: uno con \"stop\" establecido en \"<strong lang=\"en\">true</strong>\" y otro establecido en \"<strong lang=\"en\">false</strong>\".",
  "_A_ELEMENT_GROUP_STOP_HEADER_": "Uso de la <strong lang=\"en\">props</strong> \"stop\" para detener la propagación de eventos",
  "_A_ELEMENT_GROUP_SWITCH_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite usar el elemento como un interruptor con dos estados (encendido/apagado). Usando los atributos \"<strong lang=\"en\">:is-switch</strong>\" y \"<strong lang=\"en\">:model-switch</strong>\", puede habilitar el modo de interruptor y controlar el estado del elemento. El elemento se renderiza como una etiqueta \"<strong lang=\"en\">button</strong>\" con el atributo \"<strong lang=\"en\">aria-pressed</strong>\" indicando su estado.",
  "_A_ELEMENT_GROUP_SWITCH_HEADER_": "Uso del modo de elemento interruptor",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar texto adicional dentro del elemento. Esto puede ser útil para agregar texto predefinido antes o después del texto principal del elemento.",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texto adicional dentro del elemento",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite configurar el texto del elemento para diferentes dispositivos. Usando el atributo \"<strong lang=\"en\">:text</strong>\" como un objeto, puede especificar diferentes textos para dispositivos móviles y de escritorio.",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_HEADER_": "Configuración de texto para diferentes dispositivos",
  "_A_ELEMENT_GROUP_TEXT_TAG_DESCRIPTION_": "Este ejemplo muestra cómo configurar la etiqueta para el texto en el componente \"<strong lang=\"en\">AElement</strong>\" en <strong lang=\"en\">Vue.js</strong>. Por defecto, el texto se muestra en una etiqueta <strong lang=\"en\">span</strong>. Sin embargo, usando la propiedad <strong lang=\"en\">text-tag</strong>, la etiqueta se puede configurar de manera flexible para usar varias etiquetas <strong lang=\"en\">HTML</strong> como \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" u otras.",
  "_A_ELEMENT_GROUP_TEXT_TAG_HEADER_": "Cambio de la etiqueta de texto en el componente \"<strong lang=\"en\">AElement</strong>\"",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite combinar varios títulos en un atributo. Usando el atributo \"<strong lang=\"en\">:title</strong>\" como un array, puede especificar varios elementos que se combinarán en un solo título para el elemento.",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_HEADER_": "Combinación de títulos en un atributo",
  "_A_ELEMENT_GROUP_TITLE_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AElement</strong> permite mostrar el título como <strong lang=\"en\">HTML</strong> y controlar su ubicación. Usando los atributos \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" y \"<strong lang=\"en\">:title-placement</strong>\", puede usar un título <strong lang=\"en\">HTML</strong> y establecer su ubicación.",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualización de título <strong lang=\"en\">HTML</strong> con traducción y parámetros",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_HEADER_": "En el ejemplo siguiente, el título se muestra como texto traducido con un parámetro. El parámetro <strong lang=\"en\">number</strong> se pasa a través del atributo <strong lang=\"en\">extra</strong>.",
  "_A_ELEMENT_GROUP_TITLE_HTML_HEADER_": "Visualización del título <strong lang=\"en\">HTML</strong> y su ubicación",
  "_A_ELEMENT_GROUP_TRANSPARENT_DESCRIPTION_": "Si necesita un elemento que armonice con el fondo en lugar de superponerlo, reemplace las clases estándar con clases <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_ELEMENT_GROUP_TRANSPARENT_HEADER_": "Elementos transparentes",
  "_A_ELEMENT_PROPS_ARIA_DISABLED_DESCRIPTION_": "Determina si el elemento debe estar inactivo. Si se establece en <strong lang=\"en\">true</strong>, el elemento se mostrará como inactivo y se agregará el atributo de accesibilidad \"<strong lang=\"en\">aria-disabled</strong>\".",
  "_A_ELEMENT_PROPS_ARIA_LABEL_DESCRIPTION_": "Define la etiqueta <strong lang=\"en\">ARIA</strong> para el elemento. Puede usar una cadena, número u objeto como valor para establecer la etiqueta deseada.",
  "_A_ELEMENT_PROPS_ATTRIBUTES_DESCRIPTION_": "Define atributos adicionales para el elemento. Puede usar un objeto para establecer los atributos necesarios y sus valores.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Define la clase de estilo base para el elemento, estableciendo el estilo visual general predeterminado.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Define la clase de estilo para ocultar el elemento, se usa para controlar la visibilidad del elemento en diferentes contextos.",
  "_A_ELEMENT_PROPS_CLASS_DESCRIPTION_": "Clase <strong lang=\"en\">CSS</strong>",
  "_A_ELEMENT_PROPS_CLASS_DISABLED_DESCRIPTION_": "Especifica la clase <strong lang=\"en\">CSS</strong> que se aplica al elemento cuando está desactivado.",
  "_A_ELEMENT_PROPS_DISABLED_DESCRIPTION_": "Determina si el elemento debe estar desactivado. Si se establece en <strong lang=\"en\">true</strong>, el elemento estará desactivado.",
  "_A_ELEMENT_PROPS_EXTRA_DATA_DESCRIPTION_": "Proporciona datos adicionales para todos los slots del componente, permitiendo pasar datos e información personalizados que se pueden usar dentro de los slots para una personalización más flexible y detallada del contenido.",
  "_A_ELEMENT_PROPS_EXTRA_DESCRIPTION_": "Objeto adicional para traducción",
  "_A_ELEMENT_PROPS_HTML_DESCRIPTION_": "Contenido <strong lang=\"en\">HTML</strong> que debe mostrarse dentro del elemento.",
  "_A_ELEMENT_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Define el contenido <strong lang=\"en\">HTML</strong> para la lectura de pantalla del elemento. Puede usar una cadena, número u objeto como valor para establecer el contenido <strong lang=\"en\">HTML</strong> deseado.",
  "_A_ELEMENT_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Define atributos adicionales para iconos. Puede usar un objeto para establecer los atributos necesarios y sus valores para iconos.",
  "_A_ELEMENT_PROPS_ICON_CLASS_DESCRIPTION_": "Define una clase <strong lang=\"en\">CSS</strong> adicional para los iconos.",
  "_A_ELEMENT_PROPS_ICON_LEFT_DESCRIPTION_": "Define el icono a la izquierda del elemento. Puede especificar el nombre del icono como una cadena o definir diferentes iconos para diferentes dispositivos como un objeto.",
  "_A_ELEMENT_PROPS_ICON_RIGHT_DESCRIPTION_": "Define el icono a la derecha del elemento. Puede especificar el nombre del icono como una cadena o definir diferentes iconos para diferentes dispositivos como un objeto.",
  "_A_ELEMENT_PROPS_ICON_TAG_DESCRIPTION_": "Define una etiqueta <strong lang=\"en\">HTML</strong> personalizada para los iconos.",
  "_A_ELEMENT_PROPS_ID_DESCRIPTION_": "Define un identificador único para el elemento. Si no se especifica el identificador, se generará automáticamente un identificador único.",
  "_A_ELEMENT_PROPS_IS_SWITCH_DESCRIPTION_": "Determina si el elemento debe usarse en modo interruptor. Si se establece en <strong lang=\"en\">true</strong>, el elemento se mostrará como un elemento interruptor.",
  "_A_ELEMENT_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Determina si el título debe interpretarse como <strong lang=\"en\">HTML</strong>. Si se establece en <strong lang=\"en\">true</strong>, el título se mostrará como <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_LOADING_ALIGN_DESCRIPTION_": "Define la alineación del indicador de carga. Puede especificar el valor \"<strong lang=\"en\">left</strong>\" o \"<strong lang=\"en\">right</strong>\".",
  "_A_ELEMENT_PROPS_LOADING_CLASS_DESCRIPTION_": "Define la clase <strong lang=\"en\">CSS</strong> para el estado de carga del elemento. Puede especificar una cadena con una clase <strong lang=\"en\">CSS</strong> o usar un objeto para especificar diferentes clases <strong lang=\"en\">CSS</strong> para diferentes estados.",
  "_A_ELEMENT_PROPS_LOADING_DESCRIPTION_": "Determina si el elemento está en estado de carga. Si se establece en <strong lang=\"en\">true</strong>, el elemento se mostrará como \"<strong lang=\"en\">loading</strong>\".",
  "_A_ELEMENT_PROPS_MODEL_SWITCH_DESCRIPTION_": "El valor del modelo que controla el estado del interruptor del elemento. Si se establece en <strong lang=\"en\">true</strong>, el elemento estará activo (<strong lang=\"en\">pressed=true</strong>), de lo contrario, el elemento estará inactivo (<strong lang=\"en\">pressed=false</strong>).",
  "_A_ELEMENT_PROPS_PREVENT_DESCRIPTION_": "Determina si se debe prevenir el comportamiento estándar de los manejadores de eventos para el elemento (<strong lang=\"en\">preventDefault</strong>).",
  "_A_ELEMENT_PROPS_SAFE_HTML_DESCRIPTION_": "Habilita la confianza en la cadena <strong lang=\"en\">HTML</strong> proporcionada y permite mostrarla dentro del elemento.",
  "_A_ELEMENT_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Define contenido <strong lang=\"en\">HTML</strong> seguro para el área de lectura de pantalla. Puede especificar una cadena, número u objeto para establecer diferentes contenidos para diferentes estados.",
  "_A_ELEMENT_PROPS_STOP_DESCRIPTION_": "Determina si se debe detener la propagación adicional del evento (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_ELEMENT_PROPS_TABINDEX_DESCRIPTION_": "Define el valor del índice de tabulación (<strong lang=\"en\">tabindex</strong>) para el elemento. El índice de tabulación se puede establecer como un número o una cadena.",
  "_A_ELEMENT_PROPS_TAG_DESCRIPTION_": "Define la etiqueta <strong lang=\"en\">HTML</strong> que se utilizará para mostrar el elemento.",
  "_A_ELEMENT_PROPS_TEXT_AFTER_DESCRIPTION_": "Define el texto que debe mostrarse después del texto del elemento.",
  "_A_ELEMENT_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Determina si el texto del elemento debe marcarse como <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_ELEMENT_PROPS_TEXT_BEFORE_DESCRIPTION_": "Define el texto que debe mostrarse antes del texto del elemento.",
  "_A_ELEMENT_PROPS_TEXT_CLASS_DESCRIPTION_": "Define la clase <strong lang=\"en\">CSS</strong> que se aplicará al texto del elemento.",
  "_A_ELEMENT_PROPS_TEXT_DESCRIPTION_": "Cadena u objeto que contiene texto para diferentes dispositivos. Use las claves \"<strong lang=\"en\">mobile</strong>\" y \"<strong lang=\"en\">desktop</strong>\" para especificar el texto correspondiente para cada dispositivo.",
  "_A_ELEMENT_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Define el texto que se utilizará para la lectura de pantalla (<strong lang=\"en\">screen reader</strong>).",
  "_A_ELEMENT_PROPS_TEXT_TAG_DESCRIPTION_": "Esta propiedad permite personalizar la etiqueta <strong lang=\"en\">HTML</strong> en la que se muestra el texto dentro del elemento.",
  "_A_ELEMENT_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Proporciona un objeto para configurar atributos <strong lang=\"en\">HTML</strong> adicionales para el título del elemento, permitiendo detallar su comportamiento y estilo.",
  "_A_ELEMENT_PROPS_TITLE_DESCRIPTION_": "Cadena o array de elementos que se combinarán en un solo título.",
  "_A_ELEMENT_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Posicionamiento del título <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Establece el <strong lang=\"en\">z-index</strong> para el título del elemento, definiendo su orden de apilamiento en el contexto de otros elementos superpuestos.",
  "_A_ELEMENT_PROPS_TYPE_DESCRIPTION_": "Define el tipo de elemento. Valores permitidos: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> y <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot que contiene contenido que se mostrará después del texto del elemento.",
  "_A_ELEMENT_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot que contiene contenido que se mostrará antes del texto del elemento.",
  "_A_ELEMENT_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot que contiene contenido <strong lang=\"en\">HTML</strong> que se utilizará como título para el elemento.",
  "_A_ELEMENT_SLOT_DEFAULT_DESCRIPTION_": "Slot predeterminado que contiene contenido para el elemento."
}
