{
  "_A_ELEMENT_COMPONENT_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> est un élément universel avec une configuration avancée via des props, permettant de personnaliser l'accessibilité, les classes, les identifiants, l'état de chargement et d'autres paramètres. Il prend en charge la personnalisation de l'apparence, du texte, des icônes et la gestion des événements tels que les clics, ce qui en fait un outil puissant pour créer des interfaces.",
  "_A_ELEMENT_COMPONENT_NAME_": "Élément",
  "_A_ELEMENT_EVENTS_CLICK_DESCRIPTION_": "Se déclenche lorsque l'on clique sur le composant.",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_": "<div>C'EST UNE <strong>INFO-BULLE HTML MAGIQUE!!!!</strong></div><div>Deuxième ligne</div>",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_{{number}}_": "<div>C'EST UNE <strong>INFO-BULLE HTML MAGIQUE!!!!</strong></div><div>Deuxième ligne</div><div>Numéro: {{ number }}</div>",
  "_A_ELEMENT_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher un élément dans un état inactif et de définir les attributs d'accessibilité appropriés. Pour cela, vous pouvez utiliser la propriété \"<strong lang=\"en\">aria-disabled</strong>\" pour indiquer l'état inactif. Cela permet d'utiliser des événements tels que le focus ou le survol, tout en gardant l'élément inactif pour les clics.",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_HEADER_": "Élément inactif utilisant <strong lang=\"en\">aria-disabled</strong>",
  "_A_ELEMENT_GROUP_BASIC_CLASS_DESCRIPTION_": "Il existe de nombreuses classes <strong lang=\"en\">CSS</strong> que vous pouvez utiliser avec l'élément.",
  "_A_ELEMENT_GROUP_BASIC_CLASS_HEADER_": "Classes de base",
  "_A_ELEMENT_GROUP_BASIC_DESCRIPTION_": "Il existe plusieurs types que vous pouvez utiliser avec l'élément: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> et <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_GROUP_COMPLEX_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'utiliser diverses propriétés et événements complexes pour configurer et gérer l'élément avec des fonctionnalités avancées. Dans l'exemple suivant, plusieurs propriétés et événements sont utilisés pour configurer l'élément et gérer son état de chargement.",
  "_A_ELEMENT_GROUP_COMPLEX_HEADER_": "Utilisation de propriétés et d'événements complexes",
  "_A_ELEMENT_GROUP_DISABLED_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet de désactiver l'élément à l'aide de la propriété \"<strong lang=\"en\">disabled</strong>\". Cela rend l'élément non interactif tant visuellement que fonctionnellement.",
  "_A_ELEMENT_GROUP_DISABLED_HEADER_": "Désactivation de l'élément",
  "_A_ELEMENT_GROUP_GROUP_DESCRIPTION_": "Regroupez une série d'éléments en une seule ligne.",
  "_A_ELEMENT_GROUP_GROUP_HEADER_": "Regroupement horizontal d'éléments",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Vous pouvez regrouper des éléments dans un tableau.",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Regroupement tabulaire d'éléments",
  "_A_ELEMENT_GROUP_GROUP_SIZES_DESCRIPTION_": "Au lieu d'appliquer des classes de taille à chaque élément du groupe, ajoutez simplement <strong lang=\"en\">.a_btn_group_large</strong> ou <strong lang=\"en\">.a_btn_group_small</strong> à chaque <strong lang=\"en\">.a_btn_group</strong>, y compris chaque groupe imbriqué si vous avez plusieurs niveaux.",
  "_A_ELEMENT_GROUP_GROUP_SIZES_HEADER_": "Taille du groupe d'éléments",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Placez les éléments dans une colonne verticale.",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_HEADER_": "Regroupement vertical d'éléments",
  "_A_ELEMENT_GROUP_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher en toute sécurité du contenu <strong lang=\"en\">HTML</strong> sans lui faire entièrement confiance. En utilisant la propriété \"<strong lang=\"en\">html</strong>\" et la bibliothèque <strong lang=\"en\">DomPurify</strong>, le contenu <strong lang=\"en\">HTML</strong> fourni est nettoyé et affiché en toute sécurité dans l'élément.",
  "_A_ELEMENT_GROUP_HTML_HEADER_": "Affichage sécurisé du contenu <strong lang=\"en\">HTML</strong> à l'aide de <strong lang=\"en\">DomPurify</strong>",
  "_A_ELEMENT_GROUP_ICONS_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher des icônes à gauche et à droite de l'élément à l'aide des propriétés \"<strong lang=\"en\">:icon-left</strong>\" et \"<strong lang=\"en\">:icon-right</strong>\". Vous pouvez définir différentes icônes pour différents appareils afin d'obtenir un aspect personnalisé.",
  "_A_ELEMENT_GROUP_ICONS_HEADER_": "Utilisation des propriétés d'icônes",
  "_A_ELEMENT_GROUP_LOADING_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher l'élément dans un état de chargement avec un indicateur de chargement. Vous pouvez également spécifier l'alignement de l'indicateur de chargement. Cela peut être utile pour représenter un processus en arrière-plan qui nécessite que l'utilisateur attende la fin.",
  "_A_ELEMENT_GROUP_LOADING_HEADER_": "Élément en état de chargement et alignement de l'indicateur de chargement",
  "_A_ELEMENT_GROUP_OUTLINE_DESCRIPTION_": "Besoin d'un élément mais sans couleurs de fond vives? Remplacez les classes de modificateurs standard par des classes <strong lang=\"en\">.a_btn_outline_*</strong> pour supprimer toutes les images et couleurs de fond sur n'importe quel élément.",
  "_A_ELEMENT_GROUP_OUTLINE_HEADER_": "Éléments avec contour",
  "_A_ELEMENT_GROUP_SAFE_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'utiliser du contenu <strong lang=\"en\">HTML</strong> sécurisé sous forme de chaîne à l'intérieur de l'élément. Lorsque la propriété \"<strong lang=\"en\">safe-html</strong>\" est activée et qu'une chaîne de contenu <strong lang=\"en\">HTML</strong> est transmise, le contenu <strong lang=\"en\">HTML</strong> fourni est traité avec confiance et inséré directement via l'attribut <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_ELEMENT_GROUP_SAFE_HTML_HEADER_": "Utilisation de contenu <strong lang=\"en\">HTML</strong> sécurisé sous forme de chaîne à l'intérieur de l'élément",
  "_A_ELEMENT_GROUP_SIZES_DESCRIPTION_": "Vous voulez des éléments plus grands ou plus petits? Ajoutez <strong lang=\"en\">.a_btn_large</strong> ou <strong lang=\"en\">.a_btn_small</strong> pour des tailles supplémentaires.",
  "_A_ELEMENT_GROUP_SIZES_HEADER_": "Tailles des éléments",
  "_A_ELEMENT_GROUP_SLOT_APPEND_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher du contenu supplémentaire après le texte de l'élément à l'aide du slot \"<strong lang=\"en\">buttonAppend</strong>\". Le contenu placé dans ce slot apparaîtra après le texte de l'élément.",
  "_A_ELEMENT_GROUP_SLOT_APPEND_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet de placer du contenu personnalisé à l'intérieur de l'élément à l'aide du slot par défaut \"<strong lang=\"en\">:slots='default'</strong>\". Le contenu placé dans ce slot sera affiché à l'intérieur de l'élément.",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_HEADER_": "Utilisation du slot par défaut",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher du contenu supplémentaire avant le texte de l'élément à l'aide du slot \"<strong lang=\"en\">buttonPrepend</strong>\". Le contenu placé dans ce slot apparaîtra avant le texte de l'élément.",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_TITLE_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet de définir un contenu <strong lang=\"en\">HTML</strong> personnalisé pour le titre de l'élément à l'aide du slot \"<strong lang=\"en\">buttonTitle</strong>\" en combinaison avec l'attribut \"<strong lang=\"en\">:is-title-html</strong>\". Le contenu placé dans ce slot sera utilisé comme titre <strong lang=\"en\">HTML</strong> pour l'élément.",
  "_A_ELEMENT_GROUP_SLOT_TITLE_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonTitle</strong>\" pour le titre <strong lang=\"en\">HTML</strong>",
  "_A_ELEMENT_GROUP_STOP_DESCRIPTION_": "Définir la <strong lang=\"en\">props</strong> \"stop\" sur une valeur booléenne peut être utilisé pour contrôler si l'événement doit se propager ou non. L'exemple montre deux scénarios différents: l'un avec \"stop\" défini sur \"<strong lang=\"en\">true</strong>\" et l'autre défini sur \"<strong lang=\"en\">false</strong>\".",
  "_A_ELEMENT_GROUP_STOP_HEADER_": "Utilisation de la <strong lang=\"en\">props</strong> \"stop\" pour arrêter la propagation de l'événement",
  "_A_ELEMENT_GROUP_SWITCH_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'utiliser l'élément comme un interrupteur avec deux états (activé/désactivé). En utilisant les attributs \"<strong lang=\"en\">:is-switch</strong>\" et \"<strong lang=\"en\">:model-switch</strong>\", vous pouvez activer le mode interrupteur et contrôler l'état de l'élément. L'élément est rendu comme une balise \"<strong lang=\"en\">button</strong>\" avec l'attribut \"<strong lang=\"en\">aria-pressed</strong>\" indiquant son état.",
  "_A_ELEMENT_GROUP_SWITCH_HEADER_": "Utilisation du mode élément interrupteur",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher du texte supplémentaire à l'intérieur de l'élément. Cela peut être utile pour ajouter du texte prédéfini avant ou après le texte principal de l'élément.",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texte supplémentaire à l'intérieur de l'élément",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet de configurer le texte de l'élément pour différents appareils. En utilisant l'attribut \"<strong lang=\"en\">:text</strong>\" sous forme d'objet, vous pouvez spécifier différents textes pour les appareils mobiles et de bureau.",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_HEADER_": "Configuration du texte pour différents appareils",
  "_A_ELEMENT_GROUP_TEXT_TAG_DESCRIPTION_": "Cet exemple montre comment configurer la balise pour le texte dans le composant \"<strong lang=\"en\">AElement</strong>\" dans <strong lang=\"en\">Vue.js</strong>. Par défaut, le texte est affiché dans une balise <strong lang=\"en\">span</strong>. Cependant, en utilisant la propriété <strong lang=\"en\">text-tag</strong>, la balise peut être configurée de manière flexible pour utiliser différentes balises <strong lang=\"en\">HTML</strong> telles que \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" ou autres.",
  "_A_ELEMENT_GROUP_TEXT_TAG_HEADER_": "Modification de la balise de texte dans le composant \"<strong lang=\"en\">AElement</strong>\"",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet de combiner plusieurs titres en un seul attribut. En utilisant l'attribut \"<strong lang=\"en\">:title</strong>\" sous forme de tableau, vous pouvez spécifier plusieurs éléments qui seront fusionnés en un seul titre pour l'élément.",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_HEADER_": "Combinaison de titres en un seul attribut",
  "_A_ELEMENT_GROUP_TITLE_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AElement</strong> permet d'afficher le titre sous forme de <strong lang=\"en\">HTML</strong> et de contrôler son placement. En utilisant les attributs \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" et \"<strong lang=\"en\">:title-placement</strong>\", vous pouvez utiliser un titre <strong lang=\"en\">HTML</strong> et définir son emplacement.",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Affichage d'un titre <strong lang=\"en\">HTML</strong> avec traduction et paramètres",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_HEADER_": "Dans l'exemple ci-dessous, le titre est affiché sous forme de texte traduit avec un paramètre. Le paramètre <strong lang=\"en\">number</strong> est transmis via l'attribut <strong lang=\"en\">extra</strong>.",
  "_A_ELEMENT_GROUP_TITLE_HTML_HEADER_": "Affichage du titre <strong lang=\"en\">HTML</strong> et de son placement",
  "_A_ELEMENT_GROUP_TRANSPARENT_DESCRIPTION_": "Si vous avez besoin d'un élément qui s'harmonise avec l'arrière-plan au lieu de le superposer, remplacez les classes standard par des classes <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_ELEMENT_GROUP_TRANSPARENT_HEADER_": "Éléments transparents",
  "_A_ELEMENT_PROPS_ARIA_DISABLED_DESCRIPTION_": "Détermine si l'élément doit être inactif. Si défini sur <strong lang=\"en\">true</strong>, l'élément sera affiché comme inactif et l'attribut d'accessibilité \"<strong lang=\"en\">aria-disabled</strong>\" sera ajouté.",
  "_A_ELEMENT_PROPS_ARIA_LABEL_DESCRIPTION_": "Définit l'étiquette <strong lang=\"en\">ARIA</strong> pour l'élément. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir l'étiquette souhaitée.",
  "_A_ELEMENT_PROPS_ATTRIBUTES_DESCRIPTION_": "Définit des attributs supplémentaires pour l'élément. Vous pouvez utiliser un objet pour définir les attributs nécessaires et leurs valeurs.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Définit la classe de style de base pour l'élément, établissant le style visuel général par défaut.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Définit la classe de style pour masquer l'élément, utilisée pour gérer la visibilité de l'élément dans différents contextes.",
  "_A_ELEMENT_PROPS_CLASS_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong>",
  "_A_ELEMENT_PROPS_CLASS_DISABLED_DESCRIPTION_": "Spécifie la classe <strong lang=\"en\">CSS</strong> qui est appliquée à l'élément lorsqu'il est désactivé.",
  "_A_ELEMENT_PROPS_DISABLED_DESCRIPTION_": "Détermine si l'élément doit être désactivé. Si défini sur <strong lang=\"en\">true</strong>, l'élément sera désactivé.",
  "_A_ELEMENT_PROPS_EXTRA_DATA_DESCRIPTION_": "Fournit des données supplémentaires pour tous les slots du composant, permettant de transmettre des données et des informations personnalisées qui peuvent être utilisées à l'intérieur des slots pour une personnalisation plus flexible et détaillée du contenu.",
  "_A_ELEMENT_PROPS_EXTRA_DESCRIPTION_": "Objet supplémentaire pour la traduction",
  "_A_ELEMENT_PROPS_HTML_DESCRIPTION_": "Contenu <strong lang=\"en\">HTML</strong> qui doit être affiché à l'intérieur de l'élément.",
  "_A_ELEMENT_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Définit le contenu <strong lang=\"en\">HTML</strong> pour la lecture d'écran de l'élément. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir le contenu <strong lang=\"en\">HTML</strong> souhaité.",
  "_A_ELEMENT_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Définit des attributs supplémentaires pour les icônes. Vous pouvez utiliser un objet pour définir les attributs nécessaires et leurs valeurs pour les icônes.",
  "_A_ELEMENT_PROPS_ICON_CLASS_DESCRIPTION_": "Définit une classe <strong lang=\"en\">CSS</strong> supplémentaire pour les icônes.",
  "_A_ELEMENT_PROPS_ICON_LEFT_DESCRIPTION_": "Définit l'icône à gauche de l'élément. Vous pouvez spécifier le nom de l'icône sous forme de chaîne ou définir différentes icônes pour différents appareils sous forme d'objet.",
  "_A_ELEMENT_PROPS_ICON_RIGHT_DESCRIPTION_": "Définit l'icône à droite de l'élément. Vous pouvez spécifier le nom de l'icône sous forme de chaîne ou définir différentes icônes pour différents appareils sous forme d'objet.",
  "_A_ELEMENT_PROPS_ICON_TAG_DESCRIPTION_": "Définit une balise <strong lang=\"en\">HTML</strong> personnalisée pour les icônes.",
  "_A_ELEMENT_PROPS_ID_DESCRIPTION_": "Définit un identifiant unique pour l'élément. Si l'identifiant n'est pas spécifié, un identifiant unique sera automatiquement généré.",
  "_A_ELEMENT_PROPS_IS_SWITCH_DESCRIPTION_": "Détermine si l'élément doit être utilisé en mode interrupteur. Si défini sur <strong lang=\"en\">true</strong>, l'élément sera affiché comme un élément interrupteur.",
  "_A_ELEMENT_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Détermine si le titre doit être interprété comme du <strong lang=\"en\">HTML</strong>. Si défini sur <strong lang=\"en\">true</strong>, le titre sera affiché comme du <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_LOADING_ALIGN_DESCRIPTION_": "Définit l'alignement de l'indicateur de chargement. Vous pouvez spécifier la valeur \"<strong lang=\"en\">left</strong>\" ou \"<strong lang=\"en\">right</strong>\".",
  "_A_ELEMENT_PROPS_LOADING_CLASS_DESCRIPTION_": "Définit la classe <strong lang=\"en\">CSS</strong> pour l'état de chargement de l'élément. Vous pouvez spécifier une chaîne avec une classe <strong lang=\"en\">CSS</strong> ou utiliser un objet pour spécifier différentes classes <strong lang=\"en\">CSS</strong> pour différents états.",
  "_A_ELEMENT_PROPS_LOADING_DESCRIPTION_": "Détermine si l'élément est en état de chargement. Si défini sur <strong lang=\"en\">true</strong>, l'élément sera affiché comme \"<strong lang=\"en\">loading</strong>\".",
  "_A_ELEMENT_PROPS_MODEL_SWITCH_DESCRIPTION_": "La valeur du modèle qui contrôle l'état de l'interrupteur de l'élément. Si défini sur <strong lang=\"en\">true</strong>, l'élément sera actif (<strong lang=\"en\">pressed=true</strong>), sinon l'élément sera inactif (<strong lang=\"en\">pressed=false</strong>).",
  "_A_ELEMENT_PROPS_PREVENT_DESCRIPTION_": "Détermine s'il faut empêcher le comportement standard des gestionnaires d'événements pour l'élément (<strong lang=\"en\">preventDefault</strong>).",
  "_A_ELEMENT_PROPS_SAFE_HTML_DESCRIPTION_": "Active la confiance dans la chaîne <strong lang=\"en\">HTML</strong> fournie et permet de l'afficher à l'intérieur de l'élément.",
  "_A_ELEMENT_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Définit un contenu <strong lang=\"en\">HTML</strong> sécurisé pour la zone de lecture d'écran. Vous pouvez spécifier une chaîne, un nombre ou un objet pour définir différents contenus pour différents états.",
  "_A_ELEMENT_PROPS_STOP_DESCRIPTION_": "Détermine s'il faut arrêter la propagation supplémentaire de l'événement (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_ELEMENT_PROPS_TABINDEX_DESCRIPTION_": "Définit la valeur de l'index de tabulation (<strong lang=\"en\">tabindex</strong>) pour l'élément. L'index de tabulation peut être défini comme un nombre ou une chaîne.",
  "_A_ELEMENT_PROPS_TAG_DESCRIPTION_": "Définit la balise <strong lang=\"en\">HTML</strong> qui sera utilisée pour afficher l'élément.",
  "_A_ELEMENT_PROPS_TEXT_AFTER_DESCRIPTION_": "Définit le texte qui doit être affiché après le texte de l'élément.",
  "_A_ELEMENT_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Détermine si le texte de l'élément doit être marqué comme <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_ELEMENT_PROPS_TEXT_BEFORE_DESCRIPTION_": "Définit le texte qui doit être affiché avant le texte de l'élément.",
  "_A_ELEMENT_PROPS_TEXT_CLASS_DESCRIPTION_": "Définit la classe <strong lang=\"en\">CSS</strong> qui sera appliquée au texte de l'élément.",
  "_A_ELEMENT_PROPS_TEXT_DESCRIPTION_": "Chaîne ou objet contenant du texte pour différents appareils. Utilisez les clés \"<strong lang=\"en\">mobile</strong>\" et \"<strong lang=\"en\">desktop</strong>\" pour spécifier le texte correspondant pour chaque appareil.",
  "_A_ELEMENT_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Définit le texte qui sera utilisé pour la lecture d'écran (<strong lang=\"en\">screen reader</strong>).",
  "_A_ELEMENT_PROPS_TEXT_TAG_DESCRIPTION_": "Cette propriété permet de personnaliser la balise <strong lang=\"en\">HTML</strong> dans laquelle le texte est affiché à l'intérieur de l'élément.",
  "_A_ELEMENT_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fournit un objet pour configurer des attributs <strong lang=\"en\">HTML</strong> supplémentaires pour le titre de l'élément, permettant de détailler son comportement et son style.",
  "_A_ELEMENT_PROPS_TITLE_DESCRIPTION_": "Chaîne ou tableau d'éléments qui seront fusionnés en un seul titre.",
  "_A_ELEMENT_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Positionnement du titre <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Définit le <strong lang=\"en\">z-index</strong> pour le titre de l'élément, définissant son ordre d'empilement dans le contexte d'autres éléments qui se chevauchent.",
  "_A_ELEMENT_PROPS_TYPE_DESCRIPTION_": "Définit le type d'élément. Valeurs autorisées: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> et <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot contenant du contenu qui sera affiché après le texte de l'élément.",
  "_A_ELEMENT_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot contenant du contenu qui sera affiché avant le texte de l'élément.",
  "_A_ELEMENT_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot contenant du contenu <strong lang=\"en\">HTML</strong> qui sera utilisé comme titre pour l'élément.",
  "_A_ELEMENT_SLOT_DEFAULT_DESCRIPTION_": "Slot par défaut contenant du contenu pour l'élément."
}
