{
  "_A_ELEMENT_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> è un elemento universale con configurazione avanzata tramite props, che consente di personalizzare l'accessibilità, le classi, gli ID, lo stato di caricamento e altri parametri. Supporta la personalizzazione dell'aspetto, del testo, delle icone e la gestione degli eventi come i clic, rendendolo uno strumento potente per la creazione di interfacce.",
  "_A_ELEMENT_COMPONENT_NAME_": "Elemento",
  "_A_ELEMENT_EVENTS_CLICK_DESCRIPTION_": "Si attiva quando si fa clic sul componente.",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_": "<div>QUESTO È UN <strong>TOOLTIP HTML MAGICO!!!!</strong></div><div>Seconda riga</div>",
  "_A_ELEMENT_EXAMPLE_BIG_TITLE_{{number}}_": "<div>QUESTO È UN <strong>TOOLTIP HTML MAGICO!!!!</strong></div><div>Seconda riga</div><div>Numero: {{ number }}</div>",
  "_A_ELEMENT_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare un elemento in stato inattivo e impostare gli attributi di accessibilità appropriati. Per fare ciò, è possibile utilizzare la proprietà \"<strong lang=\"en\">aria-disabled</strong>\" per indicare lo stato inattivo. Ciò consente di utilizzare eventi come il focus o l'hover, mantenendo l'elemento inattivo per i clic.",
  "_A_ELEMENT_GROUP_ARIA_DISABLED_HEADER_": "Elemento inattivo utilizzando <strong lang=\"en\">aria-disabled</strong>",
  "_A_ELEMENT_GROUP_BASIC_CLASS_DESCRIPTION_": "Ci sono molte classi <strong lang=\"en\">CSS</strong> che puoi utilizzare con l'elemento.",
  "_A_ELEMENT_GROUP_BASIC_CLASS_HEADER_": "Classi di base",
  "_A_ELEMENT_GROUP_BASIC_DESCRIPTION_": "Ci sono diversi tipi che puoi utilizzare con l'elemento: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> e <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_GROUP_COMPLEX_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di utilizzare varie proprietà ed eventi complessi per configurare e gestire l'elemento con funzionalità avanzate. Nel seguente esempio, vengono utilizzate diverse proprietà ed eventi per configurare l'elemento e gestire il suo stato di caricamento.",
  "_A_ELEMENT_GROUP_COMPLEX_HEADER_": "Utilizzo di proprietà ed eventi complessi",
  "_A_ELEMENT_GROUP_DISABLED_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di disabilitare l'elemento utilizzando la proprietà \"<strong lang=\"en\">disabled</strong>\". Ciò rende l'elemento non interattivo sia visivamente che funzionalmente.",
  "_A_ELEMENT_GROUP_DISABLED_HEADER_": "Disabilitazione dell'elemento",
  "_A_ELEMENT_GROUP_GROUP_DESCRIPTION_": "Raggruppa una serie di elementi in una riga.",
  "_A_ELEMENT_GROUP_GROUP_HEADER_": "Raggruppamento orizzontale degli elementi",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Puoi raggruppare gli elementi in una tabella.",
  "_A_ELEMENT_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Raggruppamento tabellare degli elementi",
  "_A_ELEMENT_GROUP_GROUP_SIZES_DESCRIPTION_": "Invece di applicare classi di dimensione a ogni elemento nel gruppo, aggiungi semplicemente <strong lang=\"en\">.a_btn_group_large</strong> o <strong lang=\"en\">.a_btn_group_small</strong> a ogni <strong lang=\"en\">.a_btn_group</strong>, inclusi i gruppi annidati se hai più livelli.",
  "_A_ELEMENT_GROUP_GROUP_SIZES_HEADER_": "Dimensione del gruppo di elementi",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Disponi gli elementi in una colonna verticale.",
  "_A_ELEMENT_GROUP_GROUP_VERTICAL_HEADER_": "Raggruppamento verticale degli elementi",
  "_A_ELEMENT_GROUP_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare in modo sicuro contenuti <strong lang=\"en\">HTML</strong> senza fidarsi completamente di essi. Utilizzando la proprietà \"<strong lang=\"en\">html</strong>\" e la libreria <strong lang=\"en\">DomPurify</strong>, il contenuto <strong lang=\"en\">HTML</strong> fornito viene pulito e visualizzato in modo sicuro nell'elemento.",
  "_A_ELEMENT_GROUP_HTML_HEADER_": "Visualizzazione sicura di contenuti <strong lang=\"en\">HTML</strong> utilizzando <strong lang=\"en\">DomPurify</strong>",
  "_A_ELEMENT_GROUP_ICONS_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare icone a sinistra e a destra dell'elemento utilizzando le proprietà \"<strong lang=\"en\">:icon-left</strong>\" e \"<strong lang=\"en\">:icon-right</strong>\". È possibile definire diverse icone per diversi dispositivi per ottenere un aspetto personalizzato.",
  "_A_ELEMENT_GROUP_ICONS_HEADER_": "Utilizzo delle proprietà delle icone",
  "_A_ELEMENT_GROUP_LOADING_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare l'elemento in stato di caricamento con un indicatore di caricamento. È anche possibile specificare l'allineamento dell'indicatore di caricamento. Questo può essere utile per rappresentare un processo in background che richiede all'utente di attendere il completamento.",
  "_A_ELEMENT_GROUP_LOADING_HEADER_": "Elemento in stato di caricamento e allineamento dell'indicatore di caricamento",
  "_A_ELEMENT_GROUP_OUTLINE_DESCRIPTION_": "Hai bisogno di un elemento ma senza colori di sfondo vivaci? Sostituisci le classi di modificatori standard con classi <strong lang=\"en\">.a_btn_outline_*</strong> per rimuovere tutte le immagini e i colori di sfondo su qualsiasi elemento.",
  "_A_ELEMENT_GROUP_OUTLINE_HEADER_": "Elementi con contorno",
  "_A_ELEMENT_GROUP_SAFE_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di utilizzare contenuti <strong lang=\"en\">HTML</strong> sicuri come stringa all'interno dell'elemento. Quando la proprietà \"<strong lang=\"en\">safe-html</strong>\" è abilitata e viene passata una stringa di contenuto <strong lang=\"en\">HTML</strong>, il contenuto <strong lang=\"en\">HTML</strong> fornito viene trattato con fiducia e inserito direttamente tramite l'attributo <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_ELEMENT_GROUP_SAFE_HTML_HEADER_": "Utilizzo di contenuti <strong lang=\"en\">HTML</strong> sicuri come stringa all'interno dell'elemento",
  "_A_ELEMENT_GROUP_SIZES_DESCRIPTION_": "Vuoi elementi più grandi o più piccoli? Aggiungi <strong lang=\"en\">.a_btn_large</strong> o <strong lang=\"en\">.a_btn_small</strong> per dimensioni aggiuntive.",
  "_A_ELEMENT_GROUP_SIZES_HEADER_": "Dimensioni degli elementi",
  "_A_ELEMENT_GROUP_SLOT_APPEND_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare contenuti aggiuntivi dopo il testo dell'elemento utilizzando lo slot \"<strong lang=\"en\">buttonAppend</strong>\". I contenuti inseriti in questo slot appariranno dopo il testo dell'elemento.",
  "_A_ELEMENT_GROUP_SLOT_APPEND_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di posizionare contenuti personalizzati all'interno dell'elemento utilizzando lo slot predefinito \"<strong lang=\"en\">:slots='default'</strong>\". I contenuti inseriti in questo slot verranno visualizzati all'interno dell'elemento.",
  "_A_ELEMENT_GROUP_SLOT_DEFAULT_HEADER_": "Utilizzo dello slot predefinito",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare contenuti aggiuntivi prima del testo dell'elemento utilizzando lo slot \"<strong lang=\"en\">buttonPrepend</strong>\". I contenuti inseriti in questo slot appariranno prima del testo dell'elemento.",
  "_A_ELEMENT_GROUP_SLOT_PREPEND_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_ELEMENT_GROUP_SLOT_TITLE_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di definire contenuti <strong lang=\"en\">HTML</strong> personalizzati per il titolo dell'elemento utilizzando lo slot \"<strong lang=\"en\">buttonTitle</strong>\" in combinazione con l'attributo \"<strong lang=\"en\">:is-title-html</strong>\". I contenuti inseriti in questo slot verranno utilizzati come titolo <strong lang=\"en\">HTML</strong> per l'elemento.",
  "_A_ELEMENT_GROUP_SLOT_TITLE_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonTitle</strong>\" per il titolo <strong lang=\"en\">HTML</strong>",
  "_A_ELEMENT_GROUP_STOP_DESCRIPTION_": "Impostare la <strong lang=\"en\">props</strong> \"stop\" su un valore booleano può essere utilizzato per controllare se l'evento deve propagarsi o meno. L'esempio mostra due scenari diversi: uno con \"stop\" impostato su \"<strong lang=\"en\">true</strong>\" e l'altro impostato su \"<strong lang=\"en\">false</strong>\".",
  "_A_ELEMENT_GROUP_STOP_HEADER_": "Utilizzo della <strong lang=\"en\">props</strong> \"stop\" per fermare la propagazione dell'evento",
  "_A_ELEMENT_GROUP_SWITCH_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di utilizzare l'elemento come un interruttore con due stati (on/off). Utilizzando gli attributi \"<strong lang=\"en\">:is-switch</strong>\" e \"<strong lang=\"en\">:model-switch</strong>\", è possibile abilitare la modalità interruttore e controllare lo stato dell'elemento. L'elemento viene renderizzato come un tag \"<strong lang=\"en\">button</strong>\" con l'attributo \"<strong lang=\"en\">aria-pressed</strong>\" che indica il suo stato.",
  "_A_ELEMENT_GROUP_SWITCH_HEADER_": "Utilizzo dell'elemento in modalità interruttore",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare testo aggiuntivo all'interno dell'elemento. Questo può essere utile per aggiungere testo predefinito prima o dopo il testo principale dell'elemento.",
  "_A_ELEMENT_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Testo aggiuntivo all'interno dell'elemento",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di configurare il testo dell'elemento per diversi dispositivi. Utilizzando l'attributo \"<strong lang=\"en\">:text</strong>\" come oggetto, è possibile specificare testi diversi per dispositivi mobili e desktop.",
  "_A_ELEMENT_GROUP_TEXT_OBJECT_HEADER_": "Configurazione del testo per diversi dispositivi",
  "_A_ELEMENT_GROUP_TEXT_TAG_DESCRIPTION_": "Questo esempio mostra come configurare il tag per il testo nel componente \"<strong lang=\"en\">AElement</strong>\" in <strong lang=\"en\">Vue.js</strong>. Per impostazione predefinita, il testo viene visualizzato in un tag <strong lang=\"en\">span</strong>. Tuttavia, utilizzando la proprietà <strong lang=\"en\">text-tag</strong>, il tag può essere configurato in modo flessibile per utilizzare vari tag <strong lang=\"en\">HTML</strong> come \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" o altri.",
  "_A_ELEMENT_GROUP_TEXT_TAG_HEADER_": "Modifica del tag di testo nel componente \"<strong lang=\"en\">AElement</strong>\"",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di combinare più titoli in un unico attributo. Utilizzando l'attributo \"<strong lang=\"en\">:title</strong>\" come array, è possibile specificare più elementi che verranno uniti in un unico titolo per l'elemento.",
  "_A_ELEMENT_GROUP_TITLE_ARRAY_HEADER_": "Combinazione di titoli in un unico attributo",
  "_A_ELEMENT_GROUP_TITLE_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AElement</strong> consente di visualizzare il titolo come <strong lang=\"en\">HTML</strong> e controllarne il posizionamento. Utilizzando gli attributi \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" e \"<strong lang=\"en\">:title-placement</strong>\", è possibile utilizzare un titolo <strong lang=\"en\">HTML</strong> e definirne la posizione.",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualizzazione di un titolo <strong lang=\"en\">HTML</strong> con traduzione e parametri",
  "_A_ELEMENT_GROUP_TITLE_HTML_EXTRA_HEADER_": "Nell'esempio seguente, il titolo viene visualizzato come testo tradotto con un parametro. Il parametro <strong lang=\"en\">number</strong> viene passato tramite l'attributo <strong lang=\"en\">extra</strong>.",
  "_A_ELEMENT_GROUP_TITLE_HTML_HEADER_": "Visualizzazione del titolo <strong lang=\"en\">HTML</strong> e del suo posizionamento",
  "_A_ELEMENT_GROUP_TRANSPARENT_DESCRIPTION_": "Se hai bisogno di un elemento che si armonizzi con lo sfondo invece di sovrapporsi ad esso, sostituisci le classi standard con classi <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_ELEMENT_GROUP_TRANSPARENT_HEADER_": "Elementi trasparenti",
  "_A_ELEMENT_PROPS_ARIA_DISABLED_DESCRIPTION_": "Determina se l'elemento deve essere inattivo. Se impostato su <strong lang=\"en\">true</strong>, l'elemento verrà visualizzato come inattivo e verrà aggiunto l'attributo di accessibilità \"<strong lang=\"en\">aria-disabled</strong>\".",
  "_A_ELEMENT_PROPS_ARIA_LABEL_DESCRIPTION_": "Definisce l'etichetta <strong lang=\"en\">ARIA</strong> per l'elemento. È possibile utilizzare una stringa, un numero o un oggetto come valore per impostare l'etichetta desiderata.",
  "_A_ELEMENT_PROPS_ATTRIBUTES_DESCRIPTION_": "Definisce attributi aggiuntivi per l'elemento. È possibile utilizzare un oggetto per definire gli attributi necessari e i loro valori.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Imposta la classe di stile predefinita per l'elemento, stabilendo il suo stile visivo generale.",
  "_A_ELEMENT_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Definisce la classe utilizzata per nascondere l'elemento, utilizzata per gestire la sua visibilità in diversi contesti.",
  "_A_ELEMENT_PROPS_CLASS_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong>",
  "_A_ELEMENT_PROPS_CLASS_DISABLED_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> applicata quando l'elemento è disabilitato.",
  "_A_ELEMENT_PROPS_DISABLED_DESCRIPTION_": "Determina se l'elemento deve essere disabilitato. Se impostato su <strong lang=\"en\">true</strong>, l'elemento sarà disabilitato.",
  "_A_ELEMENT_PROPS_EXTRA_DATA_DESCRIPTION_": "Fornisce dati aggiuntivi per tutti gli slot del componente, consentendo di passare dati e informazioni personalizzati che possono essere utilizzati all'interno degli slot per una personalizzazione più flessibile e dettagliata del contenuto.",
  "_A_ELEMENT_PROPS_EXTRA_DESCRIPTION_": "Oggetto aggiuntivo per la traduzione",
  "_A_ELEMENT_PROPS_HTML_DESCRIPTION_": "Contenuto <strong lang=\"en\">HTML</strong> da renderizzare all'interno dell'elemento.",
  "_A_ELEMENT_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Definisce il contenuto <strong lang=\"en\">HTML</strong> per l'accessibilità dello screen reader. È possibile utilizzare una stringa, un numero o un oggetto per specificare il contenuto <strong lang=\"en\">HTML</strong> desiderato.",
  "_A_ELEMENT_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Definisce attributi aggiuntivi per le icone. È possibile utilizzare un oggetto per specificare gli attributi necessari e i loro valori per le icone.",
  "_A_ELEMENT_PROPS_ICON_CLASS_DESCRIPTION_": "Specifica una classe <strong lang=\"en\">CSS</strong> aggiuntiva per le icone.",
  "_A_ELEMENT_PROPS_ICON_LEFT_DESCRIPTION_": "Definisce l'icona visualizzata a sinistra dell'elemento. È possibile specificare il nome dell'icona come stringa o fornire diverse icone per diversi dispositivi come oggetto.",
  "_A_ELEMENT_PROPS_ICON_RIGHT_DESCRIPTION_": "Definisce l'icona visualizzata a destra dell'elemento. È possibile specificare il nome dell'icona come stringa o fornire diverse icone per diversi dispositivi come oggetto.",
  "_A_ELEMENT_PROPS_ICON_TAG_DESCRIPTION_": "Definisce un tag <strong lang=\"en\">HTML</strong> personalizzato per le icone.",
  "_A_ELEMENT_PROPS_ID_DESCRIPTION_": "Definisce un ID univoco per l'elemento. Se non specificato, verrà generato automaticamente un ID univoco.",
  "_A_ELEMENT_PROPS_IS_SWITCH_DESCRIPTION_": "Determina se l'elemento deve essere utilizzato come interruttore. Se impostato su <strong lang=\"en\">true</strong>, l'elemento verrà renderizzato come un toggle.",
  "_A_ELEMENT_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Determina se il titolo deve essere interpretato come <strong lang=\"en\">HTML</strong>. Se impostato su <strong lang=\"en\">true</strong>, il titolo verrà renderizzato come <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_LOADING_ALIGN_DESCRIPTION_": "Definisce l'allineamento dell'indicatore di caricamento. Accetta i valori \"<strong lang=\"en\">left</strong>\" o \"<strong lang=\"en\">right</strong>\".",
  "_A_ELEMENT_PROPS_LOADING_CLASS_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> utilizzata quando l'elemento è in stato di caricamento. Accetta una stringa o un oggetto per stili di stato diversi.",
  "_A_ELEMENT_PROPS_LOADING_DESCRIPTION_": "Determina se l'elemento è in stato di caricamento. Se impostato su <strong lang=\"en\">true</strong>, verrà mostrato un indicatore di caricamento.",
  "_A_ELEMENT_PROPS_MODEL_SWITCH_DESCRIPTION_": "Il valore del modello che controlla lo stato di toggle dell'elemento. Se impostato su <strong lang=\"en\">true</strong>, l'elemento è attivo (<strong lang=\"en\">pressed=true</strong>); altrimenti, è inattivo (<strong lang=\"en\">pressed=false</strong>).",
  "_A_ELEMENT_PROPS_PREVENT_DESCRIPTION_": "Determina se prevenire il comportamento predefinito dei gestori di eventi per l'elemento (<strong lang=\"en\">preventDefault</strong>).",
  "_A_ELEMENT_PROPS_SAFE_HTML_DESCRIPTION_": "Abilita la fiducia per la stringa <strong lang=\"en\">HTML</strong> fornita, consentendone il rendering all'interno dell'elemento.",
  "_A_ELEMENT_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Definisce contenuti <strong lang=\"en\">HTML</strong> sicuri per le regioni dello screen reader. Accetta una stringa, un numero o un oggetto per stati diversi.",
  "_A_ELEMENT_PROPS_STOP_DESCRIPTION_": "Determina se interrompere la propagazione degli eventi (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_ELEMENT_PROPS_TABINDEX_DESCRIPTION_": "Definisce il valore <strong lang=\"en\">tabindex</strong> per l'elemento. Può essere un numero o una stringa.",
  "_A_ELEMENT_PROPS_TAG_DESCRIPTION_": "Specifica il tag <strong lang=\"en\">HTML</strong> da utilizzare per il rendering dell'elemento.",
  "_A_ELEMENT_PROPS_TEXT_AFTER_DESCRIPTION_": "Definisce il testo da visualizzare dopo il testo principale dell'elemento.",
  "_A_ELEMENT_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Indica se il testo dell'elemento deve essere contrassegnato come <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_ELEMENT_PROPS_TEXT_BEFORE_DESCRIPTION_": "Definisce il testo da visualizzare prima del testo principale dell'elemento.",
  "_A_ELEMENT_PROPS_TEXT_CLASS_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> da applicare al testo dell'elemento.",
  "_A_ELEMENT_PROPS_TEXT_DESCRIPTION_": "Stringa o oggetto contenente testo per diversi dispositivi. Utilizza le chiavi \"<strong lang=\"en\">mobile</strong>\" e \"<strong lang=\"en\">desktop</strong>\" per impostare i rispettivi testi.",
  "_A_ELEMENT_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Definisce il testo da leggere da uno <strong lang=\"en\">screen reader</strong>.",
  "_A_ELEMENT_PROPS_TEXT_TAG_DESCRIPTION_": "Questa proprietà consente di personalizzare il tag <strong lang=\"en\">HTML</strong> utilizzato per avvolgere il testo all'interno dell'elemento.",
  "_A_ELEMENT_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fornisce un oggetto per configurare attributi <strong lang=\"en\">HTML</strong> aggiuntivi per il titolo dell'elemento, consentendo un controllo più dettagliato sul suo comportamento e stile.",
  "_A_ELEMENT_PROPS_TITLE_DESCRIPTION_": "Stringa o array di elementi che verranno uniti in un unico titolo.",
  "_A_ELEMENT_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Posizionamento del titolo <strong lang=\"en\">HTML</strong>.",
  "_A_ELEMENT_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Imposta il <strong lang=\"en\">z-index</strong> per il titolo dell'elemento per definire il suo ordine di sovrapposizione tra elementi sovrapposti.",
  "_A_ELEMENT_PROPS_TYPE_DESCRIPTION_": "Specifica il tipo di elemento. Valori consentiti: <strong lang=\"en\">button</strong>, <strong lang=\"en\">link</strong>, <strong lang=\"en\">text</strong>, <strong lang=\"en\">submit</strong> e <strong lang=\"en\">reset</strong>.",
  "_A_ELEMENT_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot contenente contenuti da renderizzare dopo il testo dell'elemento.",
  "_A_ELEMENT_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot contenente contenuti da renderizzare prima del testo dell'elemento.",
  "_A_ELEMENT_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot che contiene contenuti <strong lang=\"en\">HTML</strong> da utilizzare come titolo dell'elemento.",
  "_A_ELEMENT_SLOT_DEFAULT_DESCRIPTION_": "Slot predefinito che contiene contenuti per l'elemento."
}
