{
  "_A_CHECKBOX_COMPONENT_DESCRIPTION_": "Die <strong lang=\"en\">ACheckbox</strong> Komponente bietet eine Schnittstelle zum Erstellen einer Gruppe von Kontrollkästchen, mit der Benutzer mehrere Optionen aus einer Liste auswählen können. Die Komponente unterstützt verschiedene Einstellungen wie zusammenklappbare Gruppen, Schaltflächengruppenanzeige, Suchfunktionalität und vieles mehr.",
  "_A_CHECKBOX_COMPONENT_NAME_": "Kontrollkästchen",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Wenn diese Option aktiviert ist, wird ein zusätzliches Steuerungskontrollkästchen angezeigt. Dieses Steuerungskontrollkästchen ermöglicht es dem Benutzer, alle untergeordneten Kontrollkästchen gleichzeitig auszuwählen oder abzuwählen.",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_HEADER_": "Steuerungskontrollkästchen",
  "_A_CHECKBOX_PROPS_COLLAPSIBLE_DESCRIPTION_": "Gibt an, ob die Gruppe von Kontrollkästchen zusammengeklappt und erweitert werden kann. Wenn auf <strong lang=\"en\">true</strong> gesetzt, kann die Gruppe vom Benutzer umgeschaltet werden.",
  "_A_CHECKBOX_PROPS_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Fügt ein Steuerungskontrollkästchen hinzu, mit dem alle Kontrollkästchen in der Gruppe gleichzeitig ausgewählt oder abgewählt werden können.",
  "_A_CHECKBOX_PROPS_INLINE_DESCRIPTION_": "Gibt an, ob die Kontrollkästchen in einer Zeile angezeigt werden sollen. Wenn auf <strong lang=\"en\">true</strong> gesetzt, werden die Kontrollkästchen horizontal ausgerichtet.",
  "_A_CHECKBOX_PROPS_IS_BUTTON_GROUP_DESCRIPTION_": "Gibt an, ob die Kontrollkästchen als Schaltflächen angezeigt werden sollen. Wenn auf <strong lang=\"en\">true</strong> gesetzt, werden die Kontrollkästchen als Schaltflächen angezeigt, was eine visuell ansprechendere Benutzeroberfläche bieten kann.",
  "_A_CHECKBOX_PROPS_IS_COLLAPSED_DESCRIPTION_": "Gibt den anfänglichen Zustand der Zusammenklappung der Kontrollkästchengruppe an. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird die Gruppe beim Laden der Seite zusammengeklappt.",
  "_A_CHECKBOX_PROPS_IS_WIDTH_AUTO_DESCRIPTION_": "Gibt an, ob die Breite der Kontrollkästchengruppe automatisch an ihren Inhalt angepasst werden soll. Wenn auf <strong lang=\"en\">true</strong> gesetzt, passt sich die Breite automatisch an."
}