{
  "_A_CHECKBOX_COMPONENT_DESCRIPTION_": "Eine Checkbox ist ein Steuerelement, das Benutzern ermöglicht, zwischen zwei Zuständen umzuschalten, typischerweise \"ausgewählt\" und \"nicht ausgewählt\". Es wird oft verwendet, um Auswahlmöglichkeiten zu treffen oder Optionen in einer Benutzeroberfläche zu aktivieren/deaktivieren.",
  "_A_CHECKBOX_COMPONENT_NAME_": "Checkbox",
  "_A_CHECKBOX_GROUP_COLLAPSE_DESCRIPTION_": "Ermöglicht das Aus- und Einklappen einer Gruppe von Checkboxen basierend auf der Benutzerinteraktion mit der Komponente.",
  "_A_CHECKBOX_GROUP_COLLAPSE_HEADER_": "Checkbox Gruppe: Einklappbarer Inhalt",
  "_A_CHECKBOX_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "Ermöglicht den Wechsel zwischen dem traditionellen quadratischen Erscheinungsbild und einem schaltflächenähnlichen Stil.",
  "_A_CHECKBOX_GROUP_IS_BUTTON_GROUP_HEADER_": "Schaltflächenstil-Gruppe",
  "_A_CHECKBOX_GROUP_KEY_DISABLED_DESCRIPTION_": "Es ist möglich, bestimmte Optionen basierend auf einer Eigenschaft im zugehörigen Objekt zu deaktivieren, wobei der Schlüsselname als Prop übergeben wird.",
  "_A_CHECKBOX_GROUP_KEY_DISABLED_HEADER_": "Deaktivierung von Optionen",
  "_A_CHECKBOX_GROUP_SEARCH_DESCRIPTION_": "Die Suche ermöglicht es Benutzern, schnell eine bestimmte Checkbox zu finden und markieren, indem man einen Suchbegriff eingebt. Dies verbessert die Benutzerfreundlichkeit für eine große Liste von Optionen.",
  "_A_CHECKBOX_GROUP_SEARCH_HEADER_": "Suche",
  "_A_CHECKBOX_GROUP_TRANSLATE_DATA_DESCRIPTION_": "Die Verwendung von übersetzbaren Labels für Optionen wird unterstützt, um die Benutzeroberfläche an verschiedene Sprachen und Regionen anzupassen.",
  "_A_CHECKBOX_GROUP_TRANSLATE_DATA_HEADER_": "Internationalisierung",
  "_A_CHECKBOX_GROUP_TWO_COLUMNS_DESCRIPTION_": "Durch das Übergeben eines Klassennamens als Prop wird festgelegt, ob die Optionen in einer oder zwei Spalten basierend auf dem bereitgestellten Klassennamen angezeigt werden.",
  "_A_CHECKBOX_GROUP_TWO_COLUMNS_HEADER_": "Zweispaltiges Layout",
  "_A_CHECKBOX_LABEL_WIDE_SCREEN_": "Breitbildlayout",
  "_A_CHECKBOX_GROUP_INLINE_HEADER_": "Inline-Checkbox-Gruppe",
  "_A_CHECKBOX_GROUP_INLINE_DESCRIPTION_": "Gibt an, ob die Kontrollkästchen in einer Zeile angezeigt werden sollen. Wenn auf true gesetzt, werden die Kontrollkästchen inline angezeigt. Andernfalls werden sie vertikal angezeigt.",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_HEADER_": "Steuer-Checkbox aktivieren",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Wenn diese Option aktiviert ist, wird eine zusätzliche Steuer-Checkbox angezeigt. Diese Steuer-Checkbox ermöglicht es dem Benutzer, alle untergeordneten Checkboxen auf einmal auszuwählen oder abzuwählen."
}
