{
  "_A_CHECKBOX_COMPONENT_NAME_": "Флажки (чекбоксы)",
  "_A_CHECKBOX_COMPONENT_DESCRIPTION_": "Компонент <strong lang=\"en\">ACheckbox</strong> предоставляет интерфейс для создания группы флажков (чекбоксов), позволяя пользователям выбирать несколько вариантов из списка. Компонент поддерживает различные настройки, такие как возможность сворачивания группы, отображение в виде группы кнопок, поиск и многие другие.",
  "_A_CHECKBOX_PROPS_COLLAPSIBLE_DESCRIPTION_": "Определяет, можно ли сворачивать и разворачивать группу флажков. Если установлено значение <strong lang=\"en\">true</strong>, группа может быть свернута или развернута пользователем.",
  "_A_CHECKBOX_PROPS_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Добавляет управляющий флажок, который позволяет выбрать или снять все флажки в группе одновременно.",
  "_A_CHECKBOX_PROPS_INLINE_DESCRIPTION_": "Задает, следует ли отображать флажки в строку. Если установлено значение <strong lang=\"en\">true</strong>, флажки будут выровнены по горизонтали.",
  "_A_CHECKBOX_PROPS_IS_BUTTON_GROUP_DESCRIPTION_": "Определяет, следует ли отображать флажки как кнопки. Если установлено значение <strong lang=\"en\">true</strong>, флажки будут отображаться в виде кнопок, что может быть полезно для более визуально привлекательного интерфейса.",
  "_A_CHECKBOX_PROPS_IS_COLLAPSED_DESCRIPTION_": "Указывает начальное состояние сворачивания группы флажков. Если установлено значение <strong lang=\"en\">true</strong>, группа будет свернута при загрузке страницы.",
  "_A_CHECKBOX_PROPS_IS_WIDTH_AUTO_DESCRIPTION_": "Определяет, будет ли ширина группы флажков автоматически подстраиваться под её содержимое. Если установлено значение <strong lang=\"en\">true</strong>, ширина будет изменяться автоматически.",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_HEADER_": "Управляющий чекбокс",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Когда эта опция включена, будет отображен дополнительный управляющий чекбокс. Этот управляющий чекбокс позволяет пользователю выбрать или снять выбор со всех дочерних чекбоксов одновременно."
}