{
  "_A_UI_ELEMENT_0_": "العنصر 0",
  "_A_UI_ELEMENT_1_": "العنصر 1",
  "_A_UI_ELEMENT_2_": "العنصر 2",
  "_A_UI_ELEMENT_3_": "العنصر 3",
  "_A_UI_ELEMENT_4_": "العنصر 4",
  "_A_UI_ELEMENT_5_": "العنصر 5",
  "_A_UI_ELEMENT_6_": "العنصر 6",
  "_A_UI_ELEMENT_7_": "العنصر 7",
  "_A_UI_ELEMENT_8_": "العنصر 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "الحدث الذي يتم تشغيله عند فقدان المكون للتركيز. يُستخدم للتحقق من البيانات أو حفظها عندما يترك المستخدم الحقل.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "الحدث الذي يتم تشغيله عند حصول المكون على التركيز. مفيد لتتبع تفاعل المستخدم مع العنصر.",
  "_A_UI_EVENTS_FOCUSIN_DESCRIPTION_": "يتم تشغيله عند دخول التركيز إلى المكون لأول مرة.",
  "_A_UI_EVENTS_FOCUSOUT_DESCRIPTION_": "يتم تشغيله عند مغادرة التركيز بالكامل للمكون.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "حدث يتم تفعيله عندما يقوم المستخدم بإجراء بحث خارج المكون، على سبيل المثال، عبر <strong lang=\"en\">API</strong> أو مصدر بيانات خارجي آخر. يتيح هذا الحدث معالجة نتيجة البحث وتحديث بيانات المكون.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "يتم تفعيل الحدث عندما يقوم المستخدم بطي أو توسيع مجموعة العناصر.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "حدث يتم تفعيله عند تحديث بيانات المكون. يمكن استخدامه لأداء إجراءات بعد تغيير البيانات أو تحديثها، مثل إعادة الفرز أو تصفية العناصر.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "الحدث الذي يتم تشغيله عند تحديث قيمة نموذج المكون. يُستخدم لمزامنة البيانات بين المكون والمكون الرئيسي.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "في هذا المثال، تكون وظيفة <strong lang=\"en\">change</strong> مسؤولة عن تحديث نموذج المكون. تأخذ الوظيفة ثلاثة معطيات: النموذج <strong lang=\"en\">model</strong>، ومعرف المكون <strong lang=\"en\">id</strong>، وجميع الخصائص <strong lang=\"en\">props</strong> الممررة. يتيح هذا النهج معالجة التغييرات في النموذج بمرونة وتنفيذ إجراءات إضافية، مثل التسجيل أو التحقق.",
  "_A_UI_GROUP_CHANGE_HEADER_": "وظيفة تغيير النموذج",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">class-column-default</strong>. يتيح تعيين فئات <strong lang=\"en\">CSS</strong> لجميع العناصر الفرعية في <strong lang=\"en\">children</strong>، إذا لم يكن للفرد فئته الخاصة. في المثال، تم تعيين الفئة <strong lang=\"en\">a_column a_column_12</strong> بشكل صريح للعنصر الأول، وستستخدم البقية الفئة المحددة في <strong lang=\"en\">class-column</strong> الخاصة بالمكون.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "فئة للعناصر الفرعية",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">class-columns</strong> لإدارة فئات <strong lang=\"en\">CSS</strong> الخاصة بالحاوية الرئيسية التي تعرض العناصر الفرعية. تتيح هذه الفئات تخصيص الشبكة والمسافات وسلوك الأعمدة بناءً على الجهاز.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "فئات الحاوية الرئيسية",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">collapsible</strong> و <strong lang=\"en\">is-collapsed</strong> في المكون. تتيح خاصية <strong lang=\"en\">collapsible</strong> جعل مجموعة العناصر قابلة للطي، بينما تحدد <strong lang=\"en\">is-collapsed</strong> حالة الطي الأولية. كما تم توضيح استخدام حدث <strong lang=\"en\">toggle-collapse</strong> الذي يتم تفعيله عند طي أو توسيع المجموعة.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "طي/توسيع",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">data-extra</strong> في المكون. في المثال الأول، يتم تمرير البيانات الإضافية كمصفوفة من المصفوفات، حيث تحتوي كل مصفوفة على معرف واسم العنصر. في المثال الثاني، يتم تمرير البيانات الإضافية كمصفوفة من الكائنات. كلا النهجين يسمح بإدارة مرنة لقائمة العناصر القابلة للاختيار.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "بيانات إضافية",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">errors-all</strong> لتمرير كائن يحتوي على أخطاء للعناصر الفرعية المحددة في <strong lang=\"en\">children</strong>. يمكن تحديد رسالة خطأ خاصة لكل عنصر فرعي والتي ستظهر في حالة فشل التحقق.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "أخطاء العناصر الفرعية",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">errors</strong> لعرض رسائل الخطأ أسفل حقل الإدخال. تساعد رسائل الخطأ المستخدم على فهم البيانات التي تم إدخالها بشكل غير صحيح وكيفية تصحيحها.",
  "_A_UI_GROUP_ERRORS_HEADER_": "عرض الخطأ",
  "_A_UI_GROUP_FOCUS_BLUR_DESCRIPTION_": "يوضح هذا المثال كيف يتفاعل المكون عند اكتساب أو فقدان التركيز. يتم تشغيل حدث \"<code>focusin</code>\" مرة واحدة عند دخول التركيز لأول مرة إلى المكون. ويتم تشغيل حدث \"<code>focusout</code>\" فقط عند مغادرة التركيز بالكامل للمكون.",
  "_A_UI_GROUP_FOCUS_BLUR_HEADER_": "التركيز وفقدانه",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">key-group</strong> و <strong lang=\"en\">key-group-label-callback</strong> لتجميع العناصر وتعيين أسماء المجموعات في المكون. في الحالة الأولى، يتم استخدام التجميع البسيط حسب المفاتيح <strong lang=\"en\">alohaBR</strong> و <strong lang=\"en\">aloha</strong>. في المثال الثاني، يتم تطبيق دالة رد الاتصال <strong lang=\"en\">key-group-label-callback</strong> بشكل إضافي لتحديد أسماء المجموعات ديناميكيًا بناءً على البيانات.",
  "_A_UI_GROUP_GROUP_HEADER_": "تجميع العناصر",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">has-border</strong> للتحكم في عرض الحدود. في المثال الأول، تم تمكين الحدود، مما يجعل العناصر أكثر بروزًا. في المثال الثاني، تم تعطيل الحدود، مما يمنح العناصر مظهرًا أكثر تبسيطًا.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "عرض الحدود",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">help-text</strong> لإضافة نص مساعدة أسفل حقل الإدخال. يوفر نص المساعدة معلومات إضافية للمستخدم حول البيانات المتوقعة في هذا الحقل.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "نص المساعدة",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">inline</strong> لعرض العناصر في خط واحد.",
  "_A_UI_GROUP_INLINE_HEADER_": "في خط واحد",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">is-button-group</strong> و <strong lang=\"en\">class-button-group-default</strong> في المكون. تتيح الخاصية الأولى عرض العناصر كمجموعة من الأزرار، مما يخلق واجهة أكثر تفاعلية. أما الخاصية الثانية، فهي تقوم بتخصيص مظهر مجموعة الأزرار عن طريق تعيين فئة التصميم.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "مجموعة الأزرار",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">is-data-simple-array</strong> للعمل مع مصفوفة بسيطة من السلاسل النصية. البيانات مقدمة كمصفوفة من السلاسل النصية، حيث أن كل سلسلة تمثل عنصرًا منفردًا في القائمة. يبسط هذا عملية عرض وإدارة العناصر دون الحاجة إلى استخدام الكائنات.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "مصفوفة بيانات بسيطة",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">is-label-float</strong> للتحكم في سلوك التسمية في حقل الإدخال. إذا تم تعيين قيمة الخاصية إلى <strong lang=\"en\">false</strong>، تظل التسمية ثابتة. إذا تم تعيين القيمة إلى <strong lang=\"en\">true</strong>، تتحرك التسمية فوق حقل الإدخال عندما يبدأ المستخدم في الكتابة أو عندما يحصل الحقل على التركيز.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "التسمية العائمة",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">is-width-auto</strong> للتحكم في عرض العناصر. عند تعيينها إلى <strong lang=\"en\">true</strong>، يتم تعديل عرض العناصر تلقائيًا وفقًا لمحتواها. عند تعيينها إلى <strong lang=\"en\">false</strong>، يكون العرض ثابتًا ويتم تحديده بواسطة الأنماط أو حاوية الوالد.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "العرض التلقائي",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">key-disabled</strong> لتعطيل عناصر معينة في المكون. يتيح هذا التحكم المرن في توفر العناصر بناءً على البيانات.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "تعطيل العناصر الفردية",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">key-label-callback</strong> لتوليد التسميات ديناميكيًا للعناصر. الدالة الممررة كقيمة تأخذ بيانات العنصر وتعيد سلسلة نصية تُستخدم كتسمية.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "دالة لتكوين التسميات",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">key-title</strong> و <strong lang=\"en\">key-title-callback</strong> لتعيين عناوين العناصر. في الحالة الأولى، يتم تعيين عنوان كل عنصر بشكل ثابت باستخدام خاصية <strong lang=\"en\">key-title</strong>. في المثال الثاني، يتم إنشاء العنوان ديناميكيًا باستخدام دالة <strong lang=\"en\">key-title-callback</strong> التي تأخذ بيانات العنصر وتعيد سلسلة نصية للعرض.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "تكوين العناوين",
  "_A_UI_GROUP_LABEL_DESCRIPTION_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">label-description</strong> لإضافة وصف إضافي إلى تسمية المكون. هذا يسمح بتزويد المستخدم بمعلومات أكثر تفصيلاً حول الغرض من الحقل.",
  "_A_UI_GROUP_LABEL_DESCRIPTION_HEADER_": "استخدام <strong lang=\"en\">label-description</strong>",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">label-screen-reader</strong>. يتيح لك تعيين تسمية مخفية تظهر فقط لقارئات الشاشة.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "تسمية لقارئ الشاشة",
  "_A_UI_GROUP_READONLY_DESCRIPTION_": "في هذا المثال، يتم استخدام المكون في وضع <strong lang=\"en\">readonly</strong>، حيث يتم عرض القيمة كنص ولا يمكن تعديلها من قبل المستخدم.",
  "_A_UI_GROUP_READONLY_HEADER_": "وضع العرض <strong lang=\"en\">readonly</strong>",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">search</strong> لإضافة وظيفة البحث في العناصر في المكون. هذه الميزة تتيح للمستخدمين العثور بسهولة على العناصر المطلوبة في مجموعة كبيرة من البيانات.",
  "_A_UI_GROUP_SEARCH_HEADER_": "البحث في العناصر",
  "_A_UI_GROUP_SEARCH_TEXT_IN_HTML_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام الخاصية <code>search-text-in-html</code> لتنفيذ البحث فقط في النص المرئي من <strong lang=\"en\">HTML</strong> مع تجاهل الوسوم.",
  "_A_UI_GROUP_SEARCH_TEXT_IN_HTML_HEADER_": "البحث في نص <strong lang=\"en\">HTML</strong>",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">sort-order</strong> لتعيين ترتيب فرز العناصر. في الحالة الأولى، لم يتم تعيين ترتيب الفرز، في الثانية تم فرز العناصر بترتيب تصاعدي (<strong lang=\"en\">asc</strong>)، وفي الثالثة بترتيب تنازلي (<strong lang=\"en\">desc</strong>). يتيح لك هذا تخصيص ترتيب عرض العناصر.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">sort-order-group</strong> لتحديد ترتيب فرز مجموعات العناصر. في الحالة الأولى، لم يتم تعيين ترتيب الفرز، في الثانية تم فرز المجموعات بترتيب تصاعدي (<strong lang=\"en\">asc</strong>)، وفي الثالثة بترتيب تنازلي (<strong lang=\"en\">desc</strong>). يتيح لك هذا تخصيص ترتيب عرض مجموعات العناصر.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "ترتيب فرز المجموعات",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "ترتيب الفرز",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">translate-data</strong> في المكون. البيانات المقدمة تحتوي على تسميات بمفاتيح يتم ترجمتها تلقائيًا بناءً على إعدادات الترجمة. هذا يسمح بعرض القيم المترجمة وفقًا للغة المختارة.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "العناصر القابلة للترجمة",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">class-data-parent</strong> لتعيين فئات <strong lang=\"en\">CSS</strong> التي تتحكم في عرض العناصر. في المثال الأول، يتم ترتيب العناصر في عمودين باستخدام الفئات <strong lang=\"en\">a_list_columns a_list_columns_2</strong>. في المثال الثاني، تم استخدام فئات إضافية للعرض المتجاوب على شاشات مختلفة الدقة مثل <strong lang=\"en\">desktop</strong> و <strong lang=\"en\">widescreen</strong> و <strong lang=\"en\">fullhd</strong>.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "عمودين",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "معرف فريد لحفظ البيانات المستردة من <strong lang=\"en\">API</strong>. يمكن أن يكون ذلك مفيدًا للتخزين المؤقت أو إعادة استخدام البيانات داخل الجلسة.",
  "_A_UI_PROPS_ATTRIBUTES_FIELDSET_DESCRIPTION_": "سمات <strong lang=\"en\">HTML</strong> تُضاف إلى وسم <strong lang=\"en\">fieldset</strong>.",
  "_A_UI_PROPS_AUTOCOMPLETE_DESCRIPTION_": "يحدد ما إذا كان الحقل يدعم الإكمال التلقائي، كما هو الحال في السمة <strong lang=\"en\">autocomplete</strong> في <strong lang=\"en\">HTML</strong>.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "وظيفة تُستدعى عند تغيير النموذج. تقبل القيمة الجديدة للنموذج والمعلمات الإضافية لمعالجة التغيير.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "مصفوفة من العناصر الفرعية التي سيتم عرضها داخل المكون. يمثل كل عنصر في المصفوفة كائنًا يحتوي على معلمات مثل <strong lang=\"en\">type</strong> و <strong lang=\"en\">label</strong> و <strong lang=\"en\">id</strong> وخصائص أخرى لتخصيص العنصر الفرعي وعرضه.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "فئات <strong lang=\"en\">CSS</strong> الافتراضية التي سيتم تطبيقها على الأزرار في المجموعة. يمكن استخدام هذه الفئات لتنسيق الأزرار في مجموعة الفحص أو مجموعة الأزرار الدائرية.",
  "_A_UI_PROPS_CLASS_COLUMN_DEFAULT_DESCRIPTION_": "يحدد فئة <strong lang=\"en\">CSS</strong> لجميع العناصر الفرعية، إذا لم يتم تعيين <strong lang=\"en\">classColumn</strong> الفردي في مصفوفة <strong lang=\"en\">children</strong>. يتيح ذلك التحكم في عرض جميع العناصر الفرعية دفعة واحدة.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "فئات <strong lang=\"en\">CSS</strong> التي سيتم تطبيقها على الحاوية التي تحتوي على العناصر الفرعية من خصائص <strong lang=\"en\">children</strong>. تتحكم هذه الفئات في عدد الأعمدة والمسافات بينها وسلوكها التكيفي.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "فئات <strong lang=\"en\">CSS</strong> التي تطبق على حاوية البيانات الأصلية. يتيح ذلك تخصيص مظهر الحاوية التي تحتوي على عناصر البيانات.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "فئات <strong lang=\"en\">CSS</strong> التي سيتم تطبيقها على علامة <strong lang=\"en\">fieldset</strong> التي تحتوي على مجموعة من عناصر التحكم. يتيح ذلك تخصيص مظهر مجموعة عناصر النموذج.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "يحدد فئة <strong lang=\"en\">CSS</strong> التي سيتم تطبيقها على زر المسح. يتيح هذا تخصيص مظهر الزر وفقًا لمتطلبات التصميم.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "مصفوفة البيانات المستخدمة لتوليد العناصر.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "مصفوفة بيانات إضافية يمكن استخدامها لعرض عناصر إضافية غير مدرجة في المصفوفة الأساسية.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "يحدد التبعيات التي قد تؤثر على رؤية أو سلوك المكون بناءً على قيم العناصر الأخرى.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "يحدد ما إذا كان المكون معطلاً. إذا تم تعيينه على <strong lang=\"en\">true</strong>، يصبح المكون غير نشط ولا يمكن للمستخدم التفاعل معه.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "كائن يحتوي على أخطاء لجميع العناصر الفرعية المرسلة عبر <strong lang=\"en\">children</strong>. يجب تحديد كل خطأ للعنصر المقابل باستخدام <strong lang=\"en\">id</strong>.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "يحتوي على نص أو مجموعة من الأخطاء التي يجب عرضها للمستخدم. إذا كانت هناك أخطاء، يتم عرضها أسفل المكون.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "مجموعة من السمات التي لا ينبغي أن يتم عرضها لهذا المكون. مفيد لاستبعاد السمات غير الضرورية من <strong lang=\"en\">DOM</strong> النهائي.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "يشير إلى ما إذا كان العنصر يجب أن يحتوي على حد. إذا تم تعيينه على <strong lang=\"en\">true</strong>، سيتم عرض حد حول العنصر.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "نص المساعدة الذي يتم عرضه أسفل المكون. يوفر للمستخدم معلومات أو تعليمات إضافية.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "يحدد <strong lang=\"en\">HTML ID</strong> للعنصر. يمكن استخدامه لتحديد المكون بشكل فريد في الصفحة.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "معرف المكون، الذي يمكن استخدامه لتتبع المكون أو الإشارة إليه في الكود.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "بادئة لـ<strong lang=\"en\">ID</strong> المكون. يستخدم لإنشاء معرف فريد بناءً على البادئة المحددة.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "كائن السمات المطبقة مباشرة على عنصر الإدخال. يتيح إضافة أو تخصيص سمات إدخال إضافية.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "فئة/فئات <strong lang=\"en\">CSS</strong> المطبقة على عنصر الإدخال. تتيح تنسيق المكون وفقًا لمتطلباتك.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "يحدد ما إذا كان يجب عرض زر المسح. إذا كان <strong lang=\"en\">true</strong>، فسيتم عرض زر بجانب حقل النص، مما يسمح للمستخدم بمسح المحتوى.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "يحدد ما إذا كانت مصفوفة البيانات هي مصفوفة بسيطة من القيم. إذا تم تعيينه على <strong lang=\"en\">true</strong>، سيتم اعتبار كل عنصر من عناصر المصفوفة كقيمة بسيطة بدون مفاتيح.",
  "_A_UI_PROPS_IS_DESELECT_ALL_DESCRIPTION_": "عرض الزر. عند النقر، يتم إلغاء تحديد جميع العناصر في القائمة.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "يحدد ما إذا كان يجب إخفاء المكون. إذا تم تعيينه على <strong lang=\"en\">true</strong>، فلن يتم عرض المكون على الصفحة.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "يحدد ما إذا كانت تسمية المكون يجب أن تكون فوق الحقل. إذا كان <strong lang=\"en\">true</strong>، فستتحرك التسمية فوق حقل النص عند التركيز أو عند وجود محتوى.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "يشير إلى ما إذا كان يجب عرض المكون. إذا تم تعيينه على <strong lang=\"en\">false</strong>، فلن يتم إنشاء المكون في <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_IS_SELECT_ALL_DESCRIPTION_": "عرض الزر. عند النقر، يتم تحديد جميع العناصر تلقائيًا من القائمة.",
  "_A_UI_PROPS_KEY_DISABLED_CALLBACK_DESCRIPTION_": "دالة لتحديد ما إذا كان يجب تعطيل عنصر ما. تُرجع <code>true</code> لتعطيل عنصر معين. تقبل كائنًا يحتوي على بيانات العنصر: <code>{ item }</code>.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "يشير إلى المفتاح في كائن البيانات الذي يحدد ما إذا كان سيتم تعطيل العنصر (غير قابل للتحديد).",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "مفتاح أو مصفوفة من المفاتيح المستخدمة لتجميع البيانات حسب فئات محددة. يتيح هذا الخاصية تجميع العناصر في مجموعات.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "دالة رد الاتصال التي تأخذ وسيطين <strong lang=\"en\">({ group, item })</strong> وتعيد اسم المجموعة. تستخدم لتحديد أسماء المجموعات ديناميكيًا بناءً على البيانات المقدمة.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "المفتاح في كائن البيانات الذي سيتم استخدامه كمعرف لكل عنصر.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "دالة رد الاتصال المستخدمة لتوليد نص التسمية بناءً على بيانات العنصر. يتيح ذلك إنشاء التسميات ديناميكيًا بناءً على منطق معقد.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "المفتاح في كائن البيانات الذي يحدد نص التسمية لكل عنصر.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "دالة رد الاتصال المستخدمة لتوليد العنوان بناءً على بيانات العنصر. يتيح ذلك إنشاء العناوين ديناميكيًا بناءً على منطق معقد.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "المفتاح في كائن البيانات الذي يحدد العنوان لكل عنصر.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "فئة/فئات <strong lang=\"en\">CSS</strong> المطبقة على التسمية. تتيح تخصيص نمط التسمية.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "نص التسمية الذي يظهر بجانب المكون. يُستخدم عادةً لوصف هدف عنصر الإدخال.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_DESCRIPTION_": "وصف إضافي يظهر بجانب تسمية المكون. يساعد المستخدم على فهم الغرض من الحقل بشكل أفضل.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "تسمية مخصصة لبرامج قراءة الشاشة. مفيد لتحسين إمكانية الوصول.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "يشير إلى ما إذا كان العنصر في حالة تحميل. إذا تم تعيينه على <strong lang=\"en\">true</strong>، يعرض العنصر مؤشر التحميل.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "يحدد الحد الأقصى لعدد الأحرف التي يمكن إدخالها في الحقل. إذا تم تجاوز هذا الحد، فسيتم حظر المزيد من الإدخال.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "يحدد تبعيات النموذج التي قد تؤثر على رؤية أو سلوك المكون.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "القيمة المستخدمة لإعادة تعيين النموذج إلى حالة غير معرّفة. مفيد لتفريغ قيمة النموذج.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "القيمة الحالية للنموذج المرتبطة بالمكون. تُستخدم لإدارة البيانات المعروضة في المكون.",
  "_A_UI_PROPS_OPTIONS_DESCRIPTION_": "كائن بيانات إضافي متاح داخل المكون أو في الفتحات أو المنطق المخصص.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "يحدد النص البديل الذي سيتم عرضه في حقل الإدخال حتى يقوم المستخدم بإدخال البيانات. يساعد النص البديل المستخدم على فهم البيانات المطلوبة في الحقل.",
  "_A_UI_PROPS_READONLY_DEFAULT_DESCRIPTION_": "النص الافتراضي الذي يُعرض إذا كانت القيمة غير موجودة في وضع القراءة فقط.",
  "_A_UI_PROPS_READONLY_DESCRIPTION_": "يُفعّل وضع القراءة فقط، حيث يتم عرض القيمة كنص دون إمكانية التعديل.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "يشير إلى ما إذا كان المكون مطلوبًا. إذا تم تعيينه على <strong lang=\"en\">true</strong>، يتطلب المكون إدخالًا من المستخدم.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "يشير إلى ما إذا كان البحث عن العناصر سيتم تنفيذه باستخدام <strong lang=\"en\">API</strong>. إذا تم تعيينه على <strong lang=\"en\">true</strong>، سيتم تحميل البيانات من الخادم أثناء إدخال الاستعلام.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "المفتاح المستخدم لتنفيذ البحث عبر <strong lang=\"en\">API</strong>. عادة ما يكون هذا المعلمة التي يتم تمريرها في الطلب إلى الخادم لتصفية البيانات.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "يحدد ما إذا كانت ميزة البحث مدعومة. إذا تم تعيينه على <strong lang=\"en\">true</strong>، سيتمكن المستخدمون من البحث داخل المجموعة.",
  "_A_UI_PROPS_SEARCH_IN_GROUP_DESCRIPTION_": "يتيح البحث الإضافي بأسماء المجموعات.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "يحدد ما إذا كان سيتم إجراء البحث خارج المكون، على سبيل المثال، عبر <strong lang=\"en\">API</strong> أو مصدر بيانات خارجي آخر.",
  "_A_UI_PROPS_SEARCH_SEARCH_TEXT_IN_HTML_DESCRIPTION_": "عند التعيين إلى <code>true</code>، يتم البحث في النص المُستخرج من <strong lang=\"en\">HTML</strong> المرسوم. يتيح ذلك البحث فقط في النص الظاهر للمستخدم، مع تجاهل الوسوم والسمات.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "يحدد وقت التأخير بالمللي ثانية قبل تنفيذ البحث. مفيد لمنع الطلبات الزائدة أثناء إدخال النص بسرعة من قبل المستخدم.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "اسم الفتحة التي سيتم إضافتها بعد المحتوى الرئيسي للمكون. يتيح ذلك توسيع وظيفة المكون بإضافة محتوى مخصص.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "اسم الفتحة الرئيسية المستخدمة لإدخال محتوى مخصص في المكون.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "يحدد ترتيب فرز العناصر. القيم الممكنة: <strong lang=\"en\">asc</strong> (تصاعدي) أو <strong lang=\"en\">desc</strong> (تنازلي).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "يحدد ترتيب فرز المجموعات إذا كانت العناصر مجمعة. القيم الممكنة: <strong lang=\"en\">asc</strong> (تصاعدي) أو <strong lang=\"en\">desc</strong> (تنازلي).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "يشير إلى ما إذا كان يجب ترجمة البيانات قبل العرض. إذا تم تعيينه على <strong lang=\"en\">true</strong>، سيتم ترجمة القيم النصية وفقًا لإعدادات اللغة الحالية.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "عنوان <strong lang=\"en\">URL</strong> الذي سيتم تحميل مصدر البيانات الخارجي منه لملء مجموعة الفحص أو الأزرار الدائرية.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "المعلمات التي سيتم إضافتها إلى طلب <strong lang=\"en\">URL</strong> عند تحميل البيانات من الخادم. تتيح هذه المعلمات تصفية البيانات المستردة من <strong lang=\"en\">API</strong> أو تعديلها.",
  "_A_UI_TYPES_FOR_USE_": "الأنواع المتاحة للاستخدام."
}
