{
  "_A_UI_ELEMENT_0_": "Element 0",
  "_A_UI_ELEMENT_1_": "Element 1",
  "_A_UI_ELEMENT_2_": "Element 2",
  "_A_UI_ELEMENT_3_": "Element 3",
  "_A_UI_ELEMENT_4_": "Element 4",
  "_A_UI_ELEMENT_5_": "Element 5",
  "_A_UI_ELEMENT_6_": "Element 6",
  "_A_UI_ELEMENT_7_": "Element 7",
  "_A_UI_ELEMENT_8_": "Element 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn die Komponente den Fokus verliert. Wird verwendet, um Daten zu überprüfen oder zu speichern, wenn der Benutzer das Feld verlässt.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn die Komponente den Fokus erhält. Nützlich, um die Benutzerinteraktion mit dem Element zu verfolgen.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn der Benutzer eine Suche außerhalb des Komponents durchführt, beispielsweise über <strong lang=\"en\">API</strong> oder eine andere externe Datenquelle. Dieses Ereignis ermöglicht die Verarbeitung des Suchergebnisses und die Aktualisierung der Komponentdaten.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "Das Ereignis wird ausgelöst, wenn der Benutzer eine Gruppe von Elementen ein- oder ausklappt.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn die Daten des Komponents aktualisiert werden. Es kann verwendet werden, um Aktionen auszuführen, nachdem die Daten geändert oder aktualisiert wurden, z. B. um die Elemente neu zu sortieren oder zu filtern.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn der Modellwert der Komponente aktualisiert wird. Wird verwendet, um Daten zwischen der Komponente und der übergeordneten Komponente zu synchronisieren.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "In diesem Beispiel ist die Funktion <strong lang=\"en\">change</strong> für die Aktualisierung des Modellwerts der Komponente verantwortlich. Die Funktion nimmt drei Argumente entgegen: das Modell <strong lang=\"en\">model</strong>, die Komponenten-ID <strong lang=\"en\">id</strong> und alle übergebenen <strong lang=\"en\">props</strong>. Dieser Ansatz ermöglicht eine flexible Handhabung von Modelländerungen und das Ausführen zusätzlicher Aktionen, wie Protokollierung oder Validierung.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Model Änderungsfunktion",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">class-column-default</strong> verwendet wird. Es ermöglicht die Zuweisung von <strong lang=\"en\">CSS</strong>-Klassen für alle untergeordneten Elemente in <strong lang=\"en\">children</strong>, wenn für das spezifische Element keine Klasse angegeben ist. Im Beispiel wird für das erste Element die Klasse <strong lang=\"en\">a_column a_column_12</strong> explizit angegeben, während für die übrigen die in der <strong lang=\"en\">class-column</strong> des Elements festgelegte Klasse verwendet wird.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "Klasse für untergeordnete Elemente",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">class-columns</strong> verwendet wird, um <strong lang=\"en\">CSS</strong>-Klassen für den übergeordneten Container zu steuern, in dem die untergeordneten Elemente angezeigt werden. Diese Klassen ermöglichen die Anpassung des Rasters, der Abstände und des Spaltenverhaltens basierend auf dem Gerät.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "Klassen für das übergeordnete Container",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">collapsible</strong> und <strong lang=\"en\">is-collapsed</strong> im Komponent verwenden. Die Eigenschaft <strong lang=\"en\">collapsible</strong> ermöglicht es, die Gruppe von Elementen einklappbar zu machen, während <strong lang=\"en\">is-collapsed</strong> den anfänglichen Zustand des Einklappens festlegt. Es wird auch die Verwendung des Ereignisses <strong lang=\"en\">toggle-collapse</strong> gezeigt, das ausgelöst wird, wenn die Gruppe ein- oder ausgeklappt wird.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "Ein-/Ausklappen",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">data-extra</strong> im Komponent verwenden. Im ersten Beispiel werden zusätzliche Daten als Array von Arrays übergeben, wobei jedes Array eine ID und einen Namen des Elements enthält. Im zweiten Beispiel werden die zusätzlichen Daten als Array von Objekten übergeben. Beide Ansätze ermöglichen eine flexible Verwaltung der Liste der auswählbaren Elemente.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "Zusätzliche Daten",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">errors-all</strong> verwendet wird, um ein Objekt mit Fehlern für die untergeordneten Elemente, die in <strong lang=\"en\">children</strong> angegeben sind, zu übergeben. Für jedes untergeordnete Element kann eine eigene Fehlermeldung angegeben werden, die angezeigt wird, wenn die Validierung fehlschlägt.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "Fehler für untergeordnete Elemente",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">errors</strong> verwendet wird, um Fehlermeldungen unter dem Eingabefeld anzuzeigen. Fehlermeldungen helfen dem Benutzer zu verstehen, welche Daten falsch eingegeben wurden und wie diese korrigiert werden können.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Fehleranzeige",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">key-group</strong> und <strong lang=\"en\">key-group-label-callback</strong> verwenden, um Elemente zu gruppieren und Gruppennamen im Komponent anzupassen. Im ersten Fall wird eine einfache Gruppierung nach den Schlüsseln <strong lang=\"en\">alohaBR</strong> und <strong lang=\"en\">aloha</strong> verwendet. Im zweiten Beispiel wird zusätzlich die Rückruffunktion <strong lang=\"en\">key-group-label-callback</strong> angewendet, um Gruppennamen dynamisch basierend auf den Daten festzulegen.",
  "_A_UI_GROUP_GROUP_HEADER_": "Elementgruppen",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">has-border</strong> verwenden, um die Rahmenanzeige zu steuern. Im ersten Beispiel ist der Rahmen aktiviert, wodurch die Elemente stärker hervorgehoben werden. Im zweiten Beispiel ist der Rahmen deaktiviert, was den Elementen ein minimalistisches Aussehen verleiht.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "Rahmenanzeige",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">help-text</strong> verwendet wird, um einen Hilfetext unter dem Eingabefeld hinzuzufügen. Der Hilfetext bietet dem Benutzer zusätzliche Informationen über die in diesem Feld erwarteten Daten.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Hilfetext",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">inline</strong> verwenden, um Elemente in einer Linie anzuzeigen.",
  "_A_UI_GROUP_INLINE_HEADER_": "In einer Linie",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">is-button-group</strong> und <strong lang=\"en\">class-button-group-default</strong> im Komponent verwenden. Die erste Eigenschaft ermöglicht es, die Elemente als Schaltflächengruppe anzuzeigen, was eine interaktivere Benutzeroberfläche schafft. Die zweite Eigenschaft passt das Erscheinungsbild der Schaltflächengruppe an, indem eine Designklasse festgelegt wird.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "Schaltflächengruppe",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">is-data-simple-array</strong> verwenden, um mit einem einfachen String-Array zu arbeiten. Die Daten werden als Array von Strings dargestellt, wobei jeder String ein separates Listenelement darstellt. Dies vereinfacht den Prozess der Darstellung und Verwaltung von Elementen, ohne dass Objekte verwendet werden müssen.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Einfaches Datenarray",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">is-label-float</strong> verwendet wird, um das Verhalten des Labels im Eingabefeld zu steuern. Wenn der Prop-Wert auf <strong lang=\"en\">false</strong> gesetzt ist, bleibt das Label statisch. Wenn der Wert auf <strong lang=\"en\">true</strong> gesetzt ist, bewegt sich das Label über das Eingabefeld, wenn der Benutzer zu tippen beginnt oder wenn das Feld den Fokus erhält.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Schwebendes Label",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">is-width-auto</strong> verwenden, um die Breite der Elemente zu steuern. Bei einem Wert von <strong lang=\"en\">true</strong> passt sich die Breite der Elemente automatisch an den Inhalt an. Bei einem Wert von <strong lang=\"en\">false</strong> ist die Breite der Elemente fest und wird durch Stile oder das übergeordnete Container-Element bestimmt.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "Automatische Breite",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">key-disabled</strong> verwenden, um bestimmte Elemente im Komponent zu deaktivieren. Dies ermöglicht eine flexible Verwaltung der Verfügbarkeit von Elementen basierend auf den Daten.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "Deaktivierung einzelner Elemente",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">key-label-callback</strong> verwenden, um dynamisch Labels für Elemente zu erstellen. Die übergebene Funktion erhält die Daten des Elements und gibt eine Zeichenkette zurück, die als Label verwendet wird.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "Funktion zur Anpassung der Labels",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">key-title</strong> und <strong lang=\"en\">key-title-callback</strong> verwenden, um die Titel der Elemente festzulegen. Im ersten Fall wird der Titel jedes Elements statisch über die Eigenschaft <strong lang=\"en\">key-title</strong> festgelegt. Im zweiten Beispiel wird der Titel dynamisch mit einer Funktion <strong lang=\"en\">key-title-callback</strong> generiert, die die Elementdaten erhält und eine Zeichenkette zur Anzeige zurückgibt.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "Anpassung der Titel",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "Dieses Beispiel zeigt, wie man <strong lang=\"en\">label-screen-reader</strong> verwendet. Es ermöglicht das Festlegen eines versteckten Etiketts, das nur für Bildschirmleser sichtbar ist.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "Beschriftung für Bildschirmleser",
  "_A_UI_GROUP_READONLY_DESCRIPTION_": "In diesem Beispiel wird die Komponente im <strong lang=\"en\">readonly</strong>-Modus verwendet, bei dem der Wert als Text angezeigt wird und vom Benutzer nicht geändert werden kann.",
  "_A_UI_GROUP_READONLY_HEADER_": "<strong lang=\"en\">Readonly</strong>-Anzeigemodus",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">search</strong> verwenden, um eine Suchfunktion für Elemente im Komponent hinzuzufügen. Diese Funktion ermöglicht es Benutzern, die gewünschten Elemente in einem großen Datensatz leicht zu finden.",
  "_A_UI_GROUP_SEARCH_HEADER_": "Suche in Elementen",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">sort-order</strong> verwenden, um die Sortierreihenfolge von Elementen festzulegen. Im ersten Fall ist keine Sortierung festgelegt, im zweiten Fall werden die Elemente in aufsteigender Reihenfolge (<strong lang=\"en\">asc</strong>) und im dritten in absteigender Reihenfolge (<strong lang=\"en\">desc</strong>) sortiert. Dies ermöglicht es Ihnen, die Darstellung von Elementen in der gewünschten Reihenfolge anzupassen.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">sort-order-group</strong> verwenden, um die Sortierreihenfolge von Gruppenelementen festzulegen. Im ersten Fall ist keine Sortierung festgelegt, im zweiten Fall werden die Gruppen in aufsteigender Reihenfolge (<strong lang=\"en\">asc</strong>) und im dritten in absteigender Reihenfolge (<strong lang=\"en\">desc</strong>) sortiert. Dies ermöglicht es Ihnen, die Darstellung von Gruppenelementen in der gewünschten Reihenfolge anzupassen.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "Gruppensortierreihenfolge",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "Sortierreihenfolge",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">translate-data</strong> im Komponent verwenden. Die bereitgestellten Daten enthalten Labels mit Schlüsseln, die automatisch basierend auf den Lokalisierungseinstellungen übersetzt werden. Dies ermöglicht die Anzeige von übersetzten Werten je nach ausgewählter Sprache.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "Übersetzbare Elemente",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie <strong lang=\"en\">class-data-parent</strong> verwenden, um <strong lang=\"en\">CSS</strong>-Klassen festzulegen, die das Layout der Elemente steuern. Im ersten Beispiel werden die Elemente mithilfe der Klassen <strong lang=\"en\">a_list_columns a_list_columns_2</strong> in zwei Spalten aufgeteilt. Im zweiten Beispiel werden zusätzliche Klassen für das responsive Design auf verschiedenen Bildschirmauflösungen wie <strong lang=\"en\">Desktop</strong>, <strong lang=\"en\">Widescreen</strong> und <strong lang=\"en\">FullHD</strong> verwendet.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "In zwei Spalten",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "Eine eindeutige Kennung zum Speichern von Daten, die von <strong lang=\"en\">API</strong> abgerufen wurden. Dies kann nützlich sein, um Daten zwischenspeichern oder innerhalb einer Sitzung wiederzuverwenden.",
  "_A_UI_PROPS_AUTOCOMPLETE_DESCRIPTION_": "Gibt an, ob das Feld die Autovervollständigung unterstützen soll, ähnlich dem Attribut <strong lang=\"en\">autocomplete</strong> in <strong lang=\"en\">HTML</strong>.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funktion, die aufgerufen wird, wenn sich das Modell ändert. Es akzeptiert den neuen Modellwert und zusätzliche Parameter zur Verarbeitung der Änderung.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "Ein Array untergeordneter Elemente, die innerhalb der Komponente gerendert werden. Jedes Element im Array stellt ein Objekt mit Parametern wie <strong lang=\"en\">type</strong>, <strong lang=\"en\">label</strong>, <strong lang=\"en\">id</strong> und anderen Eigenschaften zur Konfiguration und Anzeige des untergeordneten Elements dar.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klassen, die standardmäßig auf die Schaltflächen in der Gruppe angewendet werden. Diese Klassen können verwendet werden, um die Schaltflächen in der Checkbox- oder Radiogruppen zu stylen.",
  "_A_UI_PROPS_CLASS_COLUMN_DEFAULT_DESCRIPTION_": "Legt eine <strong lang=\"en\">CSS</strong>-Klasse für alle untergeordneten Elemente fest, wenn für das einzelne Element in der <strong lang=\"en\">children</strong>-Array keine <strong lang=\"en\">classColumn</strong> angegeben ist. Dies ermöglicht die einfache Verwaltung der Darstellung aller untergeordneten Elemente gleichzeitig.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klassen, die auf den Container angewendet werden, der die untergeordneten Elemente aus dem <strong lang=\"en\">children</strong>-Prop enthält. Diese Klassen steuern die Anzahl der Spalten, die Abstände zwischen ihnen und ihr responsives Verhalten.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klassen, die auf das übergeordnete Datencontainer angewendet werden. Dies ermöglicht die Anpassung des Aussehens des Containers, der die Datenelemente enthält.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klassen, die auf das <strong lang=\"en\">fieldset</strong>-Tag angewendet werden, das eine Gruppe von Steuerelementen enthält. Dadurch kann das Erscheinungsbild der Gruppe von Formularelementen angepasst werden.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Gibt die <strong lang=\"en\">CSS</strong>-Klasse an, die auf die Löschtaste angewendet wird. Dadurch kann das Erscheinungsbild der Schaltfläche entsprechend den Designanforderungen angepasst werden.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "Ein Array von Daten, das zur Generierung von Elementen verwendet wird.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "Ein zusätzliches Datenarray, das verwendet werden kann, um zusätzliche Elemente anzuzeigen, die nicht im Hauptdatenarray enthalten sind.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Gibt Abhängigkeiten an, die die Sichtbarkeit oder das Verhalten der Komponente basierend auf den Werten anderer Elemente beeinflussen können.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Bestimmt, ob die Komponente deaktiviert ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird die Komponente inaktiv und der Benutzer kann nicht mit ihr interagieren.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "Ein Objekt, das Fehler für alle untergeordneten Elemente enthält, die über <strong lang=\"en\">children</strong> übergeben werden. Jeder Fehler muss dem entsprechenden Element anhand seiner <strong lang=\"en\">id</strong> zugewiesen werden.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Enthält Text oder ein Array von Fehlern, die dem Benutzer angezeigt werden sollen. Wenn Fehler vorhanden sind, werden sie unter der Komponente angezeigt.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Array von Attributen, die für diese Komponente nicht gerendert werden sollen. Nützlich, um unnötige Attribute aus dem endgültigen <strong lang=\"en\">DOM</strong> auszuschließen.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "Gibt an, ob das Element einen Rahmen haben soll. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird um das Element ein Rahmen angezeigt.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Hilfetext, der unter der Komponente angezeigt wird. Bietet dem Benutzer zusätzliche Informationen oder Anweisungen.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Setzt die <strong lang=\"en\">HTML ID</strong> des Elements. Kann verwendet werden, um die Komponente auf der Seite eindeutig zu identifizieren.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Die Kennung der Komponente, die verwendet werden kann, um die Komponente im Code zu verfolgen oder darauf zu verweisen.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Präfix für die <strong lang=\"en\">ID</strong> der Komponente. Wird verwendet, um eine eindeutige Kennung basierend auf dem angegebenen Präfix zu erstellen.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Ein Objekt von Attributen, das direkt auf das Eingabeelement angewendet wird. Ermöglicht das Hinzufügen oder Anpassen zusätzlicher Eingabeattribute.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klasse(n), die auf das Eingabeelement angewendet werden. Ermöglicht die Gestaltung der Komponente nach Ihren Anforderungen.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Bestimmt, ob die Löschtaste angezeigt werden soll. Wenn <strong lang=\"en\">true</strong>, wird eine Schaltfläche neben dem Textfeld angezeigt, mit der der Benutzer den Inhalt löschen kann.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Gibt an, ob das Datenarray ein einfaches Wertearray ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird jedes Array-Element als einfacher Wert ohne Schlüssel behandelt.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Bestimmt, ob die Komponente ausgeblendet werden soll. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird die Komponente nicht auf der Seite angezeigt.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Bestimmt, ob das Label der Komponente über dem Feld positioniert werden soll. Wenn <strong lang=\"en\">true</strong>, wird das Label über das Textfeld verschoben, wenn es fokussiert wird oder Inhalt vorhanden ist.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Gibt an, ob die Komponente gerendert werden soll. Wenn auf <strong lang=\"en\">false</strong> gesetzt, wird die Komponente nicht im <strong lang=\"en\">DOM</strong> erstellt.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "Gibt den Schlüssel im Datenobjekt an, der bestimmt, ob das Element deaktiviert (nicht auswählbar) ist.",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "Schlüssel oder ein Array von Schlüsseln, die verwendet werden, um die Daten nach bestimmten Kategorien zu gruppieren. Diese Eigenschaft ermöglicht die Gruppierung von Elementen.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "Eine Rückruffunktion, die zwei Argumente <strong lang=\"en\">({ group, item })</strong> annimmt und den Gruppennamen zurückgibt. Wird verwendet, um die Gruppennamen dynamisch basierend auf den bereitgestellten Daten festzulegen.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "Der Schlüssel im Datenobjekt, der als Identifikator für jedes Element verwendet wird.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "Eine Rückruffunktion, die verwendet wird, um den Labeltext basierend auf den Daten des Elements zu generieren. Dies ermöglicht es, Labels dynamisch basierend auf komplexer Logik zu erstellen.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "Der Schlüssel im Datenobjekt, der den Labeltext für jedes Element bestimmt.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "Eine Rückruffunktion, die verwendet wird, um den Titel basierend auf den Daten des Elements zu generieren. Dies ermöglicht es, Titel dynamisch basierend auf komplexer Logik zu erstellen.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "Der Schlüssel im Datenobjekt, der den Titel für jedes Element bestimmt.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klasse(n), die auf die Beschriftung angewendet werden. Ermöglicht die Anpassung des Stils der Beschriftung.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Beschriftungstext, der neben der Komponente angezeigt wird. Wird typischerweise verwendet, um den Zweck des Eingabeelements zu beschreiben.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Beschriftung für Screenreader. Nützlich zur Verbesserung der Barrierefreiheit.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "Gibt an, ob sich das Element im Ladezustand befindet. Wenn auf <strong lang=\"en\">true</strong> gesetzt, zeigt das Element einen Ladeindikator an.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Legt die maximale Anzahl von Zeichen fest, die in das Feld eingegeben werden können. Wenn dieses Limit überschritten wird, wird die weitere Eingabe verhindert.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Bestimmt Modellabhängigkeiten, die die Sichtbarkeit oder das Verhalten der Komponente beeinflussen können.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Der Wert, der verwendet wird, um das Modell in einen undefinierten Zustand zurückzusetzen. Nützlich, um den Modellwert zu löschen.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Der aktuelle Modellwert, der mit der Komponente verknüpft ist. Wird verwendet, um die in der Komponente angezeigten Daten zu verwalten.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Legt den Platzhaltertext fest, der im Eingabefeld angezeigt wird, bis der Benutzer Daten eingibt. Der Platzhalter hilft dem Benutzer zu verstehen, welche Daten im Feld erwartet werden.",
  "_A_UI_PROPS_READONLY_DEFAULT_DESCRIPTION_": "Der Standardtext, der angezeigt wird, wenn im Nur-Lesen-Modus kein Wert vorhanden ist.",
  "_A_UI_PROPS_READONLY_DESCRIPTION_": "Aktiviert den Nur-Lesen-Modus, bei dem der Wert als Text angezeigt wird und nicht bearbeitet werden kann.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Gibt an, ob die Komponente erforderlich ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, erfordert die Komponente eine Benutzereingabe.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "Gibt an, ob die Suche nach Elementen mit <strong lang=\"en\">API</strong> ausgeführt wird. Wenn auf <strong lang=\"en\">true</strong> gesetzt, werden die Daten während der Eingabe der Suchanfrage vom Server geladen.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "Der Schlüssel, der für die Ausführung der Suche über <strong lang=\"en\">API</strong> verwendet wird. Dies ist normalerweise ein Parameter, der in der Anforderung an den Server übergeben wird, um die Daten zu filtern.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "Gibt an, ob die Suchfunktion unterstützt wird. Wenn auf <strong lang=\"en\">true</strong> gesetzt, können Benutzer innerhalb der Gruppe suchen.",
  "_A_UI_PROPS_SEARCH_IN_GROUP_DESCRIPTION_": "Ermöglicht zusätzliche Suche nach Gruppennamen.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "Gibt an, ob die Suche außerhalb des Komponents ausgeführt wird, z. B. über <strong lang=\"en\">API</strong> oder eine andere externe Datenquelle.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "Legt die Verzögerungszeit in Millisekunden fest, bevor die Suche ausgeführt wird. Nützlich, um übermäßige Anfragen bei schneller Texteingabe durch den Benutzer zu verhindern.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "Der Name des Slots, der nach dem Hauptinhalt des Komponents hinzugefügt wird. Dies ermöglicht es, die Funktionalität des Komponents zu erweitern, indem benutzerdefinierter Inhalt hinzugefügt wird.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "Der Name des Hauptslots, der verwendet wird, um benutzerdefinierten Inhalt in das Komponent einzufügen.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "Legt die Sortierreihenfolge der Elemente fest. Mögliche Werte: <strong lang=\"en\">asc</strong> (aufsteigend) oder <strong lang=\"en\">desc</strong> (absteigend).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "Legt die Sortierreihenfolge der Gruppen fest, wenn die Elemente gruppiert sind. Mögliche Werte: <strong lang=\"en\">asc</strong> (aufsteigend) oder <strong lang=\"en\">desc</strong> (absteigend).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "Gibt an, ob die Daten vor der Anzeige übersetzt werden sollen. Wenn auf <strong lang=\"en\">true</strong> gesetzt, werden Textwerte gemäß den aktuellen Spracheinstellungen übersetzt.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "Die <strong lang=\"en\">URL</strong>, von der die externe Datenquelle geladen wird, um die Checkbox- oder Radiogruppen zu füllen.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "Parameter, die der <strong lang=\"en\">URL</strong>-Anfrage hinzugefügt werden, wenn Daten vom Server geladen werden. Diese Parameter ermöglichen die Filterung oder Änderung der von <strong lang=\"en\">API</strong> abgerufenen Daten.",
  "_A_UI_TYPES_FOR_USE_": "Verfügbare Typen zur Verwendung."
}