{
  "_A_UI_ELEMENT_0_": "Element 0",
  "_A_UI_ELEMENT_1_": "Element 1",
  "_A_UI_ELEMENT_2_": "Element 2",
  "_A_UI_ELEMENT_3_": "Element 3",
  "_A_UI_ELEMENT_4_": "Element 4",
  "_A_UI_ELEMENT_5_": "Element 5",
  "_A_UI_ELEMENT_6_": "Element 6",
  "_A_UI_ELEMENT_7_": "Element 7",
  "_A_UI_ELEMENT_8_": "Element 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Događaj koji se aktivira kada komponenta izgubi fokus. Koristi se za provjeru ili spremanje podataka kada korisnik napusti polje.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Događaj koji se aktivira kada komponenta dobije fokus. Korisno za praćenje interakcije korisnika s elementom.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "Događaj koji se pokreće kada korisnik izvrši pretraživanje izvan komponente, primjerice putem <strong lang=\"en\">API</strong> sučelja ili drugog vanjskog izvora podataka. Ovaj događaj omogućuje obradu rezultata pretraživanja i ažuriranje podataka komponente.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "Događaj se pokreće kada korisnik sažme ili proširi grupu elemenata.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "Događaj koji se pokreće pri ažuriranju podataka komponente. Može se koristiti za izvođenje radnji nakon što su podaci izmijenjeni ili ažurirani, kao što je ponovno sortiranje ili filtriranje elemenata.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Događaj koji se aktivira kada se ažurira vrijednost modela komponente. Koristi se za sinkronizaciju podataka između komponente i roditeljske komponente.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "U ovom primjeru, funkcija <strong lang=\"en\">change</strong> odgovorna je za ažuriranje modela komponente. Funkcija prihvaća tri argumenta: model <strong lang=\"en\">model</strong>, identifikator komponente <strong lang=\"en\">id</strong> i sve proslijeđene <strong lang=\"en\">props</strong>. Ovaj pristup omogućuje fleksibilno rukovanje promjenama modela i izvršavanje dodatnih radnji, kao što su zapisivanje u logove ili validacija.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Funkcija za promjenu modela",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">class-column-default</strong>. Omogućuje dodjelu <strong lang=\"en\">CSS</strong> klasa za sve podređene elemente u <strong lang=\"en\">children</strong>, osim ako određeni element nema vlastitu klasu. U primjeru, prva stavka eksplicitno ima dodijeljenu klasu <strong lang=\"en\">a_column a_column_12</strong>, dok će ostale koristiti klasu određenu u <strong lang=\"en\">class-column</strong> komponente.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "Klasa za podređene elemente",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">class-columns</strong> za upravljanje <strong lang=\"en\">CSS</strong> klasama roditeljskog kontejnera u kojem se prikazuju podređeni elementi. Ove klase omogućuju prilagodbu mreže, razmaka i ponašanja stupaca ovisno o uređaju.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "Klase za roditeljski kontejner",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">collapsible</strong> i <strong lang=\"en\">is-collapsed</strong> u komponenti. Svojstvo <strong lang=\"en\">collapsible</strong> omogućuje grupi elemenata da se sažme, dok <strong lang=\"en\">is-collapsed</strong> postavlja početno stanje sažimanja. Također je prikazana uporaba događaja <strong lang=\"en\">toggle-collapse</strong>, koji se pokreće kada se grupa sažme ili proširi.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "Sažimanje/Proširivanje",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">data-extra</strong> u komponenti. U prvom primjeru, dodatni podaci se prosljeđuju kao niz nizova, gdje svaki niz sadrži identifikator i naziv elementa. U drugom primjeru, dodatni podaci se prosljeđuju kao niz objekata. Oba pristupa omogućuju fleksibilno upravljanje popisom elemenata dostupnih za odabir.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "Dodatni podaci",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">errors-all</strong> za prosljeđivanje objekta s pogreškama za podređene elemente navedene u <strong lang=\"en\">children</strong>. Za svaki podređeni element može se navesti vlastita poruka o pogrešci koja će se prikazati ako validacija ne uspije.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "Pogreške za podređene elemente",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">errors</strong> za prikazivanje poruka o pogreškama ispod polja za unos. Poruke o pogreškama pomažu korisniku razumjeti koje su podatke uneseni pogrešno i kako ih ispraviti.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Prikaz Pogreške",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-group</strong> i <strong lang=\"en\">key-group-label-callback</strong> za grupiranje elemenata i prilagodbu naziva grupa u komponenti. U prvom slučaju koristi se jednostavno grupiranje prema ključevima <strong lang=\"en\">alohaBR</strong> i <strong lang=\"en\">aloha</strong>. U drugom primjeru dodatno se primjenjuje funkcija povratnog poziva <strong lang=\"en\">key-group-label-callback</strong> za dinamičko određivanje naziva grupa na temelju podataka.",
  "_A_UI_GROUP_GROUP_HEADER_": "Grupiranje elemenata",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">has-border</strong> za upravljanje prikazom granice. U prvom primjeru, granica je uključena, što čini elemente istaknutijima. U drugom primjeru, granica je isključena, što daje minimalistički izgled elementima.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "Prikazivanje granica",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">help-text</strong> za dodavanje teksta pomoći ispod polja za unos. Tekst pomoći pruža korisniku dodatne informacije o očekivanim podacima u ovom polju.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Tekst Pomoći",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">inline</strong> za prikazivanje elemenata u liniji.",
  "_A_UI_GROUP_INLINE_HEADER_": "U liniji",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-button-group</strong> i <strong lang=\"en\">class-button-group-default</strong> u komponenti. Prvo svojstvo omogućuje prikazivanje elemenata kao grupe gumba, stvarajući interaktivnije sučelje. Drugo svojstvo prilagođava izgled grupe gumba postavljanjem klase stila.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "Grupa gumba",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-data-simple-array</strong> za rad s jednostavnim nizom podataka. Podaci su predstavljeni kao niz nizova, gdje je svaki niz zasebni element liste. Ovo pojednostavljuje proces prikazivanja i upravljanja elementima bez potrebe za korištenjem objekata.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Jednostavan niz podataka",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-label-float</strong> za kontrolu ponašanja oznake u polju za unos. Ako je vrijednost svojstva postavljena na <strong lang=\"en\">false</strong>, oznaka ostaje statična. Ako je vrijednost postavljena na <strong lang=\"en\">true</strong>, oznaka se pomiče iznad polja za unos kada korisnik počne tipkati ili kada polje dobije fokus.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Plutajuća Oznaka",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-width-auto</strong> za upravljanje širinom elemenata. Uz vrijednost <strong lang=\"en\">true</strong>, širina elemenata automatski se prilagođava sadržaju. Uz vrijednost <strong lang=\"en\">false</strong>, širina elemenata je fiksna i određuje ju stil ili nadređeni spremnik.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "Automatska širina",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-disabled</strong> za onemogućavanje određenih elemenata u komponenti. Ovo omogućuje fleksibilno upravljanje dostupnošću elemenata na temelju podataka.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "Onemogućavanje pojedinačnih elemenata",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-label-callback</strong> za dinamičko generiranje oznaka za elemente. Funkcija koja se prosljeđuje kao vrijednost prima podatke o elementu i vraća niz koji će se koristiti kao oznaka.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "Funkcija za postavljanje oznaka",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-title</strong> i <strong lang=\"en\">key-title-callback</strong> za postavljanje naslova elemenata. U prvom slučaju, naslov svakog elementa statički se postavlja putem svojstva <strong lang=\"en\">key-title</strong>. U drugom primjeru, naslov se dinamički generira pomoću funkcije <strong lang=\"en\">key-title-callback</strong> koja prima podatke o elementu i vraća niz za prikaz.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "Postavka naslova",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">label-screen-reader</strong>. Omogućuje postavljanje skrivene oznake koja će biti vidljiva samo čitačima zaslona.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "Oznaka za čitač zaslona",
  "_A_UI_GROUP_READONLY_DESCRIPTION_": "U ovom primjeru komponenta se koristi u <strong lang=\"en\">readonly</strong> načinu, gdje se vrijednost prikazuje kao tekst i korisnik je ne može mijenjati.",
  "_A_UI_GROUP_READONLY_HEADER_": "<strong lang=\"en\">Readonly</strong> način prikaza",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">search</strong> za dodavanje funkcionalnosti pretraživanja elemenata u komponenti. Ova značajka omogućuje korisnicima da lako pronađu željene elemente u velikom skupu podataka.",
  "_A_UI_GROUP_SEARCH_HEADER_": "Pretraživanje elemenata",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">sort-order</strong> za postavljanje redoslijeda sortiranja elemenata. U prvom slučaju nije specificiran redoslijed sortiranja, u drugom su elementi sortirani uzlaznim redoslijedom (<strong lang=\"en\">asc</strong>), a u trećem silaznim redoslijedom (<strong lang=\"en\">desc</strong>). Ovo vam omogućuje prilagodbu prikaza elemenata u željenom redoslijedu.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">sort-order-group</strong> za postavljanje redoslijeda sortiranja grupa elemenata. U prvom slučaju nije specificiran redoslijed sortiranja, u drugom su grupe sortirane uzlaznim redoslijedom (<strong lang=\"en\">asc</strong>), a u trećem silaznim redoslijedom (<strong lang=\"en\">desc</strong>). Ovo vam omogućuje prilagodbu prikaza grupa elemenata u željenom redoslijedu.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "Redoslijed sortiranja grupa",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "Redoslijed sortiranja",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">translate-data</strong> u komponenti. Proslijeđeni podaci sadrže oznake s ključevima koji se automatski prevode na temelju postavki lokalizacije. Ovo omogućuje prikazivanje prevedenih vrijednosti ovisno o odabranom jeziku.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "Prevedivi elementi",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">class-data-parent</strong> za postavljanje <strong lang=\"en\">CSS</strong> klasa koje upravljaju rasporedom elemenata. U prvom primjeru, elementi su raspoređeni u dvije kolone koristeći klase <strong lang=\"en\">a_list_columns a_list_columns_2</strong>. U drugom primjeru koriste se dodatne klase za prilagodljiv prikaz na različitim razlučivostima zaslona, poput <strong lang=\"en\">desktop</strong>, <strong lang=\"en\">widescreen</strong> i <strong lang=\"en\">fullhd</strong>.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "U dvije kolone",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "Jedinstveni identifikator za spremanje podataka dobivenih iz <strong lang=\"en\">API</strong> sučelja. Ovo može biti korisno za predmemoriranje ili ponovnu uporabu podataka unutar jedne sesije.",
  "_A_UI_PROPS_AUTOCOMPLETE_DESCRIPTION_": "Određuje treba li polje podržavati automatsko popunjavanje, slično atributu <strong lang=\"en\">autocomplete</strong> u <strong lang=\"en\">HTML</strong>.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funkcija koja se poziva kada se model promijeni. Prihvaća novu vrijednost modela i dodatne parametre za obradu promjene.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "Niz podređenih elemenata koji će se prikazivati unutar komponente. Svaki element niza predstavlja objekt s parametrima kao što su <strong lang=\"en\">type</strong>, <strong lang=\"en\">label</strong>, <strong lang=\"en\">id</strong> i drugim svojstvima za konfiguraciju i prikaz podređenog elementa.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> klase koje se primjenjuju prema zadanim postavkama na gumbe u grupi. Ove klase mogu se koristiti za stiliziranje gumba u grupi potvrdnih okvira ili radio gumba.",
  "_A_UI_PROPS_CLASS_COLUMN_DEFAULT_DESCRIPTION_": "Definira <strong lang=\"en\">CSS</strong> klasu za sve podređene elemente, osim ako pojedini element u nizu <strong lang=\"en\">children</strong> nema vlastitu <strong lang=\"en\">classColumn</strong>. Ovo omogućuje jednostavno upravljanje prikazom svih podređenih elemenata odjednom.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> klase koje će se primijeniti na kontejner u kojem su smješteni podređeni elementi iz <strong lang=\"en\">children</strong> svojstva. Ove klase kontroliraju broj stupaca, razmake između njih i njihovo adaptivno ponašanje.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> klase koje se primjenjuju na nadređeni spremnik podataka. Ovo omogućuje prilagodbu izgleda spremnika u kojem su smješteni elementi podataka.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> klase koje će se primijeniti na oznaku <strong lang=\"en\">fieldset</strong> koja sadrži grupu kontrola. Omogućuje prilagodbu izgleda grupe elemenata obrasca.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Određuje <strong lang=\"en\">CSS</strong> klasu koja će se primijeniti na gumb za brisanje. Ovo omogućuje prilagodbu izgleda gumba prema zahtjevima dizajna.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "Niz podataka koji se koristi za generiranje elemenata.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "Dodatni niz podataka koji se može koristiti za prikaz dodatnih elemenata koji nisu uključeni u glavni niz podataka.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Određuje ovisnosti koje mogu utjecati na vidljivost ili ponašanje komponente na temelju vrijednosti drugih elemenata.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Određuje je li komponenta onemogućena. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta postaje neaktivna i korisnik ne može komunicirati s njom.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "Objekt koji sadrži pogreške za sve podređene elemente proslijeđene putem <strong lang=\"en\">children</strong>. Svaka pogreška mora biti povezana s odgovarajućim elementom putem njegove <strong lang=\"en\">id</strong> vrijednosti.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Sadrži tekst ili niz pogrešaka koje treba prikazati korisniku. Ako postoje pogreške, one se prikazuju ispod komponente.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Niz atributa koji se ne bi trebali prikazivati za ovu komponentu. Korisno za isključivanje nepotrebnih atributa iz konačnog <strong lang=\"en\">DOM-a</strong>.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "Naznačuje hoće li element imati obrub. Ako je postavljeno na <strong lang=\"en\">true</strong>, oko elementa će se prikazati obrub.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Pomoćni tekst prikazan ispod komponente. Korisniku pruža dodatne informacije ili upute.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Postavlja <strong lang=\"en\">HTML ID</strong> elementa. Može se koristiti za jedinstvenu identifikaciju komponente na stranici.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Identifikator komponente koji se može koristiti za praćenje ili pozivanje na komponentu u kodu.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefiks za <strong lang=\"en\">ID</strong> komponente. Koristi se za stvaranje jedinstvenog identifikatora na temelju zadanog prefiksa.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Objekt atributa primijenjen izravno na ulazni element. Omogućuje dodavanje ili prilagodbu dodatnih atributa unosa.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-klasa(e) primijenjena(e) na ulazni element. Omogućuje stiliziranje komponente prema vašim zahtjevima.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Određuje treba li prikazati gumb za brisanje. Ako je <strong lang=\"en\">true</strong>, prikazat će se gumb pored tekstualnog polja, omogućujući korisniku da izbriše sadržaj.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Naznačuje je li niz podataka jednostavan niz vrijednosti. Ako je postavljeno na <strong lang=\"en\">true</strong>, svaki element niza smatrat će se jednostavnom vrijednošću bez ključeva.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Određuje treba li komponenta biti skrivena. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta se ne prikazuje na stranici.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Određuje treba li oznaka komponente biti postavljena iznad polja. Ako je <strong lang=\"en\">true</strong>, oznaka će se premjestiti iznad tekstualnog polja kada je fokusirano ili kada je prisutan sadržaj.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Naznačuje treba li komponenta biti prikazana. Ako je postavljeno na <strong lang=\"en\">false</strong>, komponenta neće biti stvorena u <strong lang=\"en\">DOM-u</strong>.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "Naznačuje ključ u objektu podataka koji određuje hoće li element biti onemogućen (neće biti dostupan za odabir).",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "Ključ ili niz ključeva koji se koriste za grupiranje podataka prema određenim kategorijama. Ovo svojstvo omogućuje grupiranje elemenata u grupe.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "Funkcija povratnog poziva koja prima dva argumenta <strong lang=\"en\">({ group, item })</strong> i vraća naziv grupe. Koristi se za dinamičko određivanje naziva grupa na temelju proslijeđenih podataka.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "Ključ u objektu podataka koji će se koristiti kao identifikator za svaki element.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "Funkcija povratnog poziva koja se koristi za generiranje teksta oznake na temelju podataka elementa. Ovo omogućuje dinamičko stvaranje oznaka na temelju složene logike.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "Ključ u objektu podataka koji određuje tekst oznake za svaki element.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "Funkcija povratnog poziva koja se koristi za generiranje naslova na temelju podataka elementa. Ovo omogućuje dinamičko stvaranje naslova na temelju složene logike.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "Ključ u objektu podataka koji određuje naslov za svaki element.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-klasa(e) primijenjena(e) na oznaku. Omogućuje prilagodbu stila oznake.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Tekst oznake prikazan pored komponente. Obično se koristi za opisivanje svrhe ulaznog elementa.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Oznaka namijenjena za čitače ekrana. Korisno za poboljšanje pristupačnosti.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "Naznačuje je li element u stanju učitavanja. Ako je postavljeno na <strong lang=\"en\">true</strong>, element prikazuje indikator učitavanja.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Postavlja maksimalan broj znakova koji se mogu unijeti u polje. Ako se prekorači ovaj limit, daljnji unos će biti onemogućen.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Određuje ovisnosti modela koje mogu utjecati na vidljivost ili ponašanje komponente.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Vrijednost koja se koristi za vraćanje modela u neodređeno stanje. Korisno za brisanje vrijednosti modela.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Trenutna vrijednost modela povezana s komponentom. Koristi se za upravljanje podacima prikazanim u komponenti.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Određuje tekst rezerviranog mjesta koji će se prikazati u polju za unos dok korisnik ne unese podatke. Rezervirano mjesto pomaže korisniku razumjeti koji se podaci očekuju u polju.",
  "_A_UI_PROPS_READONLY_DEFAULT_DESCRIPTION_": "Zadani tekst koji se prikazuje ako vrijednost nedostaje u načinu samo za čitanje.",
  "_A_UI_PROPS_READONLY_DESCRIPTION_": "Omogućuje način samo za čitanje, u kojem se vrijednost prikazuje kao tekst bez mogućnosti uređivanja.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Naznačuje je li komponenta obvezna. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta zahtijeva unos korisnika.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "Naznačuje hoće li se pretraživanje elemenata provoditi putem <strong lang=\"en\">API</strong> sučelja. Ako je postavljeno na <strong lang=\"en\">true</strong>, podaci će se učitavati sa servera kako se unosi upit.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "Ključ koji se koristi za provođenje pretraživanja putem <strong lang=\"en\">API</strong> sučelja. Obično je to parametar koji se prosljeđuje u zahtjevu serveru za filtriranje podataka.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "Naznačuje hoće li funkcionalnost pretraživanja biti podržana. Ako je postavljeno na <strong lang=\"en\">true</strong>, korisnici će moći pretraživati elemente unutar grupe.",
  "_A_UI_PROPS_SEARCH_IN_GROUP_DESCRIPTION_": "Omogućuje dodatno pretraživanje prema nazivima grupa.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "Naznačuje hoće li se pretraživanje provoditi izvan komponente, primjerice putem <strong lang=\"en\">API</strong> sučelja ili drugog vanjskog izvora podataka.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "Postavlja vrijeme odgode u milisekundama prije provođenja pretraživanja. Korisno za sprječavanje prekomjernih zahtjeva kada korisnik brzo unosi tekst.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "Naziv utora koji će se dodati nakon glavnog sadržaja komponente. Ovo omogućuje proširenje funkcionalnosti komponente dodavanjem prilagođenog sadržaja.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "Naziv glavnog utora koji se koristi za umetanje prilagođenog sadržaja u komponentu.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "Određuje redoslijed sortiranja elemenata. Moguće vrijednosti: <strong lang=\"en\">asc</strong> (uzlazno) ili <strong lang=\"en\">desc</strong> (silazno).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "Određuje redoslijed sortiranja grupa ako su elementi grupirani. Moguće vrijednosti: <strong lang=\"en\">asc</strong> (uzlazno) ili <strong lang=\"en\">desc</strong> (silazno).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "Naznačuje hoće li podaci biti prevedeni prije prikazivanja. Ako je postavljeno na <strong lang=\"en\">true</strong>, tekstualne vrijednosti će se prevesti u skladu s trenutnim jezičnim postavkama.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "<strong lang=\"en\">URL</strong> adresa s koje će se učitavati vanjski izvor podataka za popunjavanje grupa potvrdnih okvira ili radio gumba.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "Parametri koji će biti dodani zahtjevu <strong lang=\"en\">URL</strong> adrese prilikom učitavanja podataka sa servera. Ovi parametri omogućuju filtriranje ili izmjenu podataka dobivenih putem <strong lang=\"en\">API</strong> sučelja.",
  "_A_UI_TYPES_FOR_USE_": "Tipovi dostupni za korištenje."
}