{
  "_A_UI_ELEMENT_0_": "Элемент 0",
  "_A_UI_ELEMENT_1_": "Элемент 1",
  "_A_UI_ELEMENT_2_": "Элемент 2",
  "_A_UI_ELEMENT_3_": "Элемент 3",
  "_A_UI_ELEMENT_4_": "Элемент 4",
  "_A_UI_ELEMENT_5_": "Элемент 5",
  "_A_UI_ELEMENT_6_": "Элемент 6",
  "_A_UI_ELEMENT_7_": "Элемент 7",
  "_A_UI_ELEMENT_8_": "Элемент 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Событие, которое вызывается, когда компонент теряет фокус. Используется для проверки или сохранения данных при выходе пользователя из поля.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Событие, которое вызывается, когда компонент получает фокус. Полезно для отслеживания взаимодействия пользователя с элементом.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "Событие, которое вызывается, когда пользователь выполняет поиск вне компонента, например, через <strong lang=\"en\">API</strong> или другой внешний источник данных. Это событие позволяет обработать результат поиска и обновить данные компонента.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "Событие вызывается, когда пользователь сворачивает или разворачивает группу элементов.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "Событие, которое вызывается при обновлении данных компонента. Оно может использоваться для выполнения действий после того, как данные были изменены или обновлены, например, для повторной сортировки или фильтрации элементов.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Событие, которое вызывается при обновлении значения модели компонента. Используется для синхронизации данных между компонентом и родительским компонентом.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "В данном примере функция <strong lang=\"en\">change</strong> отвечает за обновление модели компонента. Функция принимает три аргумента: модель <strong lang=\"en\">model</strong>, идентификатор компонента <strong lang=\"en\">id</strong> и все переданные <strong lang=\"en\">props</strong>. Этот подход позволяет гибко обрабатывать изменения модели и выполнять дополнительные действия, такие как логирование или валидация.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Функция изменения модели",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">class-column-default</strong>. Позволяет задать <strong lang=\"en\">CSS</strong>-классы для всех дочерних элементов в <strong lang=\"en\">children</strong>, если для конкретного элемента не указан свой класс. В примере, для первого элемента явно задан класс <strong lang=\"en\">a_column a_column_12</strong>, а для остальных будет использован класс, указанный в <strong lang=\"en\">class-column</strong> самого компонента.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "Класс для дочерних элементов",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">class-columns</strong> для управления <strong lang=\"en\">CSS</strong>-классами родительского контейнера, в котором отображаются дочерние элементы. Эти классы позволяют настроить сетку, отступы и поведение колонок в зависимости от устройства.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "Классы для родительского контейнера",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">collapsible</strong> и <strong lang=\"en\">is-collapsed</strong> в компоненте. Свойство <strong lang=\"en\">collapsible</strong> позволяет сделать группу элементов сворачиваемой, а <strong lang=\"en\">is-collapsed</strong> — задать начальное состояние сворачивания. Также продемонстрировано использование события <strong lang=\"en\">toggle-collapse</strong>, которое срабатывает при сворачивании или разворачивании группы.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "Сворачивание/разворачивание",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">data-extra</strong> в компоненте. В первом примере дополнительные данные передаются в виде массива массивов, где каждый массив содержит идентификатор и название элемента. Во втором примере дополнительные данные передаются в виде массива объектов. Оба подхода позволяют гибко управлять списком доступных для выбора элементов.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "Дополнительные данные",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">errors-all</strong> для передачи объекта с ошибками для дочерних элементов, указанных в <strong lang=\"en\">children</strong>. Для каждого дочернего элемента можно указать собственное сообщение об ошибке, которое будет отображаться, если валидация не пройдена.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "Ошибки для дочерних элементов",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">errors</strong> для отображения сообщений об ошибках под полем ввода. Сообщения об ошибках помогают пользователю понять, какие данные были введены неправильно и как их исправить.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Отображение ошибки",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-group</strong> и <strong lang=\"en\">key-group-label-callback</strong> для группировки элементов и настройки названий групп в компоненте. В первом случае используется простая группировка по ключам <strong lang=\"en\">alohaBR</strong> и <strong lang=\"en\">aloha</strong>. Во втором примере дополнительно применяется функция обратного вызова <strong lang=\"en\">key-group-label-callback</strong> для динамического определения названий групп на основе данных.",
  "_A_UI_GROUP_GROUP_HEADER_": "Группировка элементов",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">has-border</strong> для управления отображением границы. В первом примере граница включена, что делает элементы более выделенными. Во втором примере граница отключена, что придаёт более минималистичный вид элементам.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "Отображение границ",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">help-text</strong> для добавления текстовой подсказки под полем ввода. Текстовая подсказка предоставляет дополнительную информацию пользователю о том, какие данные ожидаются в данном поле.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Текстовая подсказка",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">inline</strong> для отображения элементов в линию.",
  "_A_UI_GROUP_INLINE_HEADER_": "В линию",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-button-group</strong> и <strong lang=\"en\">class-button-group-default</strong> в компоненте. Первое свойство позволяет отображать элементы как группу кнопок, создавая более интерактивный интерфейс. Второе свойство настраивает внешний вид группы кнопок, задавая класс оформления.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "Группа кнопок",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-data-simple-array</strong> для работы с простым массивом строк. Данные представлены в виде массива строк, где каждая строка — это отдельный элемент списка. Это упрощает процесс отображения и управления элементами без необходимости использования объектов.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Простой массив данных",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-label-float</strong> для управления поведением метки в поле ввода. Если значение пропса установлено в <strong lang=\"en\">false</strong>, метка остается статичной. Если значение установлено в <strong lang=\"en\">true</strong>, метка перемещается над полем ввода, когда пользователь начинает вводить данные или поле получает фокус.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Плавающая метка",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-width-auto</strong> для управления шириной элементов. При значении <strong lang=\"en\">true</strong> ширина элементов автоматически подстраивается под содержимое. При значении <strong lang=\"en\">false</strong> ширина элементов фиксирована и определяется стилями или родительским контейнером.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "Автоматическая ширина",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-disabled</strong> для отключения определенных элементов в компоненте. Это позволяет гибко управлять доступностью элементов на основе данных.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "Отключение отдельных элементов",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-label-callback</strong> для динамического формирования меток для элементов. Функция, передаваемая в качестве значения, получает данные элемента и возвращает строку, которая будет использована в качестве метки.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "Функция для настройки меток",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-title</strong> и <strong lang=\"en\">key-title-callback</strong> для задания заголовков элементов. В первом случае заголовок каждого элемента устанавливается статически через свойство <strong lang=\"en\">key-title</strong>. Во втором примере заголовок формируется динамически с помощью функции <strong lang=\"en\">key-title-callback</strong>, которая принимает данные элемента и возвращает строку для отображения.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "Настройка заголовков",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">label-screen-reader</strong>. Позволяет задать скрытую метку, которая будет видна только для скринридеров.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "Метка для скринридера",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">search</strong> для добавления функциональности поиска по элементам в компоненте. Эта возможность позволяет пользователям легко находить нужные элементы в большом наборе данных.",
  "_A_UI_GROUP_SEARCH_HEADER_": "Поиск по элементам",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">sort-order</strong> для задания порядка сортировки элементов. В первом случае сортировка не задана, во втором элементы отсортированы в порядке возрастания (<strong lang=\"en\">asc</strong>), а в третьем — в порядке убывания (<strong lang=\"en\">desc</strong>). Это позволяет настроить отображение элементов в нужном порядке.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">sort-order-group</strong> для задания порядка сортировки групп элементов. В первом случае сортировка не задана, во втором группы отсортированы в порядке возрастания (<strong lang=\"en\">asc</strong>), а в третьем — в порядке убывания (<strong lang=\"en\">desc</strong>). Это позволяет настроить отображение групп элементов в нужном порядке.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "Порядок сортировки групп",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "Порядок сортировки",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">translate-data</strong> в компоненте. Передаваемые данные содержат метки с ключами, которые автоматически переводятся на основе настроек локализации. Это позволяет отображать переведенные значения в зависимости от выбранного языка.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "Переводимые элементы",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">class-data-parent</strong> для задания <strong lang=\"en\">CSS</strong>-классов, которые управляют отображением элементов. В первом примере элементы располагаются в две колонки с помощью классов <strong lang=\"en\">a_list_columns a_list_columns_2</strong>. Во втором примере используются дополнительные классы для адаптивного отображения на разных разрешениях экрана, таких как <strong lang=\"en\">desktop</strong>, <strong lang=\"en\">widescreen</strong> и <strong lang=\"en\">fullhd</strong>.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "В две колонки",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "Уникальный идентификатор для сохранения данных, полученных от <strong lang=\"en\">API</strong>. Это может быть полезно для кэширования или повторного использования данных в пределах одного сеанса.",
  "_A_UI_PROPS_AUTOCOMPLETE_DESCRIPTION_": "Определяет, должно ли поле поддерживать автозаполнение, аналогично атрибуту <strong lang=\"en\">autocomplete</strong> в <strong lang=\"en\">HTML</strong>.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Функция, которая вызывается при изменении модели. Она принимает новое значение модели и дополнительные параметры для обработки изменения.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "Массив дочерних элементов, которые будут рендериться внутри компонента. Каждый элемент массива представляет собой объект с параметрами, такими как <strong lang=\"en\">type</strong>, <strong lang=\"en\">label</strong>, <strong lang=\"en\">id</strong>, и другими свойствами для настройки и отображения дочернего элемента.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-классы, которые будут применены по умолчанию к кнопкам в группе. Эти классы можно использовать для стилизации кнопок в группе флажков или радиокнопок.",
  "_A_UI_PROPS_CLASS_COLUMN_DEFAULT_DESCRIPTION_": "Задает <strong lang=\"en\">CSS</strong>-класс для всех дочерних элементов, если для отдельного элемента в массиве <strong lang=\"en\">children</strong> не указан свой <strong lang=\"en\">classColumn</strong>. Это позволяет легко управлять отображением всех дочерних элементов сразу.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-классы, которые будут применены к контейнеру, в котором размещены дочерние элементы из props <strong lang=\"en\">children</strong>. Эти классы управляют количеством колонок, отступами между ними и их адаптивным поведением.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-классы, которые применяются к родительскому контейнеру данных. Это позволяет настроить внешний вид контейнера, в котором размещены элементы данных.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-классы, которые будут применены к тегу <strong lang=\"en\">fieldset</strong>, содержащему группу элементов управления. Позволяет настроить внешний вид группы элементов формы.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Определяет <strong lang=\"en\">CSS</strong>-класс, который будет применен к кнопке очистки. Это позволяет настроить внешний вид кнопки в соответствии с требованиями дизайна.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "Массив данных, который используется для генерации элементов.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "Дополнительный массив данных, который может использоваться для отображения дополнительных элементов, не входящих в основной массив данных.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Задает зависимости, которые могут влиять на видимость или поведение компонента на основе значений других элементов.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Определяет, отключен ли компонент. Если значение установлено в <strong lang=\"en\">true</strong>, компонент становится неактивным и пользователь не может взаимодействовать с ним.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "Объект, содержащий ошибки для всех дочерних элементов, переданных через <strong lang=\"en\">children</strong>. Каждая ошибка должна быть указана для соответствующего элемента по его <strong lang=\"en\">id</strong>.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Содержит текст или массив ошибок, которые должны быть отображены пользователю. Если есть ошибки, они отображаются под компонентом.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Массив атрибутов, которые не должны рендериться для этого компонента. Полезно для исключения ненужных атрибутов из конечного <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "Указывает, будет ли у элемента рамка. Если установлено значение <strong lang=\"en\">true</strong>, вокруг элемента будет отображаться рамка.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Текст помощи, отображаемый под компонентом. Предоставляет пользователю дополнительную информацию или инструкцию.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Задает <strong lang=\"en\">HTML ID</strong> элемента. Может использоваться для уникальной идентификации компонента на странице.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Идентификатор компонента, который можно использовать для отслеживания или обращения к компоненту в коде.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Префикс для <strong lang=\"en\">ID</strong> компонента. Используется для создания уникального идентификатора на основе заданного префикса.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Объект атрибутов, который применяется непосредственно к элементу ввода. Позволяет добавлять или настраивать дополнительные атрибуты ввода.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-класс(ы), который применяется к элементу ввода. Позволяет стилизовать компонент в соответствии с вашими требованиями.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Определяет, должна ли отображаться кнопка очистки. Если <strong lang=\"en\">true</strong>, рядом с текстовым полем будет отображаться кнопка, позволяющая пользователю очистить содержимое.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Определяет, является ли массив данных простым массивом значений. Если установлено значение <strong lang=\"en\">true</strong>, каждый элемент массива будет рассматриваться как простое значение без ключей.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Определяет, должен ли компонент быть скрыт. Если значение установлено в <strong lang=\"en\">true</strong>, компонент не отображается на странице.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Определяет, должна ли метка компонента располагаться над полем. Если <strong lang=\"en\">true</strong>, метка будет перемещаться выше текстового поля при фокусировке или при наличии содержимого.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Указывает, должен ли компонент быть отрендерен. Если значение установлено в <strong lang=\"en\">false</strong>, компонент не будет создан в <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "Указывает ключ в объекте данных, который определяет, будет ли элемент отключен (недоступен для выбора).",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "Ключ или массив ключей, которые используются для группировки данных по определенным категориям. Это свойство позволяет сгруппировать элементы в группы.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "Функция обратного вызова, которая принимает два аргумента <strong lang=\"en\">({ group, item })</strong> и возвращает название группы. Используется для динамического определения названий групп на основе переданных данных.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "Ключ в объекте данных, который будет использоваться в качестве идентификатора для каждого элемента.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "Функция обратного вызова, которая используется для генерации текста метки на основе данных элемента. Это позволяет динамически создавать метки на основе сложной логики.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "Ключ в объекте данных, который определяет текст метки для каждого элемента.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "Функция обратного вызова, которая используется для генерации заголовка на основе данных элемента. Это позволяет динамически создавать заголовки на основе сложной логики.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "Ключ в объекте данных, который определяет заголовок для каждого элемента.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-класс(ы), который применяется к метке. Позволяет настраивать стиль метки компонента.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Текст метки, который отображается рядом с компонентом. Обычно используется для обозначения цели элемента ввода.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Метка, предназначенная для чтения скрин ридером. Полезно для улучшения доступности.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "Указывает, находится ли элемент в состоянии загрузки. Если установлено значение <strong lang=\"en\">true</strong>, элемент отображает индикатор загрузки.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Устанавливает максимальное количество символов, которое может быть введено в поле. Если это значение превышено, дальнейший ввод символов будет запрещен.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Определяет зависимости модели, которые могут влиять на видимость или поведение компонента.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Значение, которое используется для сброса модели в неопределенное состояние. Полезно для очистки значения модели.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Текущее значение модели, связанное с компонентом. Используется для управления данными, отображаемыми в компоненте.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Определяет текст-заполнитель, который будет отображаться в поле ввода до тех пор, пока пользователь не введет данные. Заполнитель помогает пользователю понять, какие данные ожидаются в поле.",
  "_A_UI_PROPS_READONLY_DEFAULT_DESCRIPTION_": "Текст по умолчанию, который отображается, если значение отсутствует в режиме только для чтения.",
  "_A_UI_PROPS_READONLY_DESCRIPTION_": "Включает режим только для чтения, при котором значение отображается в виде текста без возможности редактирования.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Указывает, является ли компонент обязательным для заполнения. Если значение установлено в <strong lang=\"en\">true</strong>, компонент требует ввода данных.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "Указывает, будет ли поиск элементов выполняться с помощью <strong lang=\"en\">API</strong>. Если установлено значение <strong lang=\"en\">true</strong>, данные будут загружаться с сервера по мере ввода запроса.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "Ключ, который используется для выполнения поиска по <strong lang=\"en\">API</strong>. Обычно это параметр, который передается в запросе на сервер для фильтрации данных.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "Определяет, будет ли поддерживаться функция поиска. Если установлено значение <strong lang=\"en\">true</strong>, пользователи смогут искать элементы внутри группы.",
  "_A_UI_PROPS_SEARCH_IN_GROUP_DESCRIPTION_": "Включает дополнительный поиск по названиям групп.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "Определяет, будет ли поиск выполняться вне компонента, например, через <strong lang=\"en\">API</strong> или другой внешний источник данных.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "Задает время задержки в миллисекундах перед выполнением поиска. Полезно для предотвращения избыточных запросов при быстром вводе текста пользователем.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "Имя слота, который будет добавлен после основного контента компонента. Это позволяет расширять функциональность компонента путем добавления пользовательского контента.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "Имя основного слота, который используется для вставки пользовательского контента в компонент.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "Определяет порядок сортировки элементов. Возможные значения: <strong lang=\"en\">asc</strong> (по возрастанию) или <strong lang=\"en\">desc</strong> (по убыванию).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "Определяет порядок сортировки групп, если элементы сгруппированы. Возможные значения: <strong lang=\"en\">asc</strong> (по возрастанию) или <strong lang=\"en\">desc</strong> (по убыванию).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "Указывает, должны ли данные быть переведены перед отображением. Если установлено значение <strong lang=\"en\">true</strong>, текстовые значения будут переведены в соответствии с текущими языковыми настройками.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "<strong lang=\"en\">URL</strong>-адрес, с которого будет загружаться внешний источник данных для заполнения группы флажков или радиокнопок.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "Параметры, которые будут добавлены к запросу <strong lang=\"en\">URL</strong> при загрузке данных с сервера. Эти параметры позволяют фильтровать или изменять данные, получаемые от <strong lang=\"en\">API</strong>.",
  "_A_UI_TYPES_FOR_USE_": "Типы, доступные для использования."
}