{
  "_A_TABS_COMPONENT_DESCRIPTION_": "El componente <strong lang=\"en\">ATabs</strong> se utiliza para organizar el contenido mediante pestañas. Cada pestaña contiene un título y el contenido correspondiente que se muestra al activar la pestaña. Se soportan varias configuraciones, como disposición vertical u horizontal, deshabilitar pestañas, posibilidad de usar <strong lang=\"en\">HTML</strong> en los títulos y configurar el comportamiento de la pestaña activa.",
  "_A_TABS_COMPONENT_NAME_": "Pestañas",
  "_A_TABS_CONTENT_1_": "Contenido 1",
  "_A_TABS_CONTENT_2_": "Contenido 2",
  "_A_TABS_CONTENT_3_": "Contenido 3",
  "_A_TABS_CONTENT_4_": "Contenido 4",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Evento que se dispara al hacer clic en una pestaña. Devuelve un objeto con los siguientes argumentos: <strong lang=\"en\">$event</strong> — información sobre el evento, <strong lang=\"en\">tab</strong> — datos de la pestaña, <strong lang=\"en\">tabId</strong> — identificador único de la pestaña o índice, <strong lang=\"en\">index</strong> — índice de la pestaña en el array de datos.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">active-tab-id</strong> para establecer la pestaña activa al renderizar. El valor de <strong lang=\"en\">active-tab-id</strong> puede ser un <strong lang=\"en\">ID</strong> si se utiliza <strong lang=\"en\">key-id</strong>, o el índice de la pestaña si no se establece la clave <strong lang=\"en\">key-id</strong>. El componente rastrea automáticamente los cambios de esta propiedad.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Definición de pestaña activa mediante <strong lang=\"en\">ID</strong> o índice",
  "_A_TABS_GROUP_COMPLEX_DESCRIPTION_": "Este ejemplo muestra cómo usar el componente <strong lang=\"en\">a-tabs</strong> con varias configuraciones y la capacidad de agregar y eliminar pestañas. En el formulario se pueden cambiar parámetros como deshabilitar pestañas, su disposición (vertical u horizontal), habilitar/deshabilitar el borde para pestañas activas y usar <strong lang=\"en\">HTML</strong> para los títulos de las pestañas. Además, se implementa la posibilidad de agregar dinámicamente nuevas pestañas y eliminar las existentes mediante una selección en la lista.",
  "_A_TABS_GROUP_COMPLEX_HEADER_": "Ejemplo con configuraciones y gestión de pestañas",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">disabled</strong> para deshabilitar todas las pestañas. Cuando esta propiedad se establece en <strong lang=\"en\">true</strong>, los usuarios no pueden interactuar con las pestañas.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Deshabilitar pestañas",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_DESCRIPTION_": "Este ejemplo muestra cómo usar slots dinámicos <strong lang=\"en\">slotTab</strong> y <strong lang=\"en\">slotContent</strong>, cuyos nombres se especifican en el array <strong lang=\"en\">data</strong>. Si se proporciona un nombre y un slot correspondiente, reemplazan el contenido estándar de las pestañas y el contenido. Los argumentos de los slots proporcionan acceso a <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_HEADER_": "Slots dinámicos para pestañas y contenido",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">is-boxed</strong> para determinar si se mostrará un borde alrededor de la pestaña activa. El primer ejemplo tiene el borde habilitado, el segundo lo tiene deshabilitado.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Borde para pestaña activa",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">is-change-outside</strong>. Si su valor está establecido en <strong lang=\"en\">true</strong>, al hacer clic en una pestaña no activa, esta no se activará automáticamente. Para cambiar la pestaña activa, es necesario usar el evento <strong lang=\"en\">change</strong> y la propiedad <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "La pestaña cambia solo a través del evento",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">is-vertical</strong> para disponer las pestañas vertical u horizontalmente. Los dos primeros ejemplos muestran disposición vertical, y el tercero horizontal.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Pestañas verticales",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-active</strong> para establecer la pestaña activa al inicializar el componente. Si en los datos de la pestaña se especifica un campo <strong lang=\"en\">active</strong> con valor <strong lang=\"en\">true</strong>, esa pestaña se activará en el primer renderizado.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Pestaña activa al inicializar",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-content</strong> para especificar qué campo de datos se utilizará para mostrar el contenido asociado a cada pestaña. En lugar de usar la clave estándar <strong lang=\"en\">content</strong>, se usa <strong lang=\"en\">aloha</strong> para mostrar el contenido correspondiente a cada pestaña.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Clave para mostrar contenido",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-disabled</strong> para deshabilitar pestañas individuales. Las pestañas que tengan el parámetro <strong lang=\"en\">disabled</strong> establecido en <strong lang=\"en\">true</strong> no estarán disponibles para interacción.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Deshabilitar pestañas individuales",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-id</strong> para mejorar el rendimiento al renderizar pestañas. Usar un identificador único para cada pestaña permite determinar más rápidamente la pestaña activa. Si <strong lang=\"en\">key-id</strong> no está especificado, se usa el índice de la pestaña.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Identificador único para pestañas",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-label</strong> para especificar un campo alternativo para las etiquetas de las pestañas. En este caso, se usa la clave <strong lang=\"en\">name</strong> en lugar de <strong lang=\"en\">label</strong> para los nombres de las pestañas.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Clave para etiquetas de pestañas",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">key-title</strong> para especificar qué campo de datos se utilizará para mostrar el título de las pestañas. En lugar del título estándar, se puede usar otra clave, como <strong lang=\"en\">label</strong>.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Clave para títulos de pestañas",
  "_A_TABS_GROUP_STATIC_SLOTS_DESCRIPTION_": "Este ejemplo muestra cómo usar slots estáticos <strong lang=\"en\">tab</strong> y <strong lang=\"en\">content</strong> para personalizar la visualización de las pestañas y su contenido. Los argumentos de los slots proporcionan acceso a <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_STATIC_SLOTS_HEADER_": "Slots estáticos para pestañas y contenido",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">is-title-html</strong> para permitir la visualización de contenido <strong lang=\"en\">HTML</strong> en los títulos de las pestañas. Junto con esto, se usa la propiedad <strong lang=\"en\">key-title</strong> para indicar la clave desde la cual se tomará el contenido <strong lang=\"en\">HTML</strong> para los títulos de las pestañas.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> en los títulos de las pestañas",
  "_A_TABS_LABEL_ADD_TABS_": "Agregar pestañas",
  "_A_TABS_LABEL_DELETE_TABS_": "Eliminar pestañas",
  "_A_TABS_LABEL_DISABLED_": "Deshabilitar pestañas (<strong lang=\"en\">disabled</strong>)",
  "_A_TABS_LABEL_IS_BOXED_": "Borde para pestaña activa (<strong lang=\"en\">isBoxed</strong>)",
  "_A_TABS_LABEL_IS_TITLE_HTML_": "<strong lang=\"en\">HTML</strong> en los títulos de las pestañas (<strong lang=\"en\">isTitleHtml</strong>)",
  "_A_TABS_LABEL_IS_VERTICAL_": "Pestañas verticales (<strong lang=\"en\">isVertical</strong>)",
  "_A_TABS_LABEL_TITLE_PLACEMENT_": "Ubicación de la tooltip respecto al elemento (<strong lang=\"en\">titlePlacement</strong>)",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Define el <strong lang=\"en\">ID</strong> o índice de la pestaña activa. Si <strong lang=\"en\">key-id</strong> no está establecido, se usa el índice de la pestaña. El componente rastrea los cambios de este valor para actualizar la pestaña activa.",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "Array de datos que describe las pestañas. Cada elemento del array es un objeto con parámetros para el título, contenido y otras propiedades de las pestañas.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Deshabilita la posibilidad de interactuar con las pestañas. Si el valor es <strong lang=\"en\">true</strong>, las pestañas no estarán disponibles para cambiar.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Determina si la pestaña activa estará rodeada por un borde. Si está establecido en <strong lang=\"en\">true</strong>, se mostrará el borde.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Si está establecido en <strong lang=\"en\">true</strong>, la pestaña no cambiará automáticamente al hacer clic. Para ello, es necesario usar el evento <strong lang=\"en\">change</strong> y establecer un nuevo valor en <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Determina si las pestañas se dispondrán vertical u horizontalmente. Si el valor está establecido en <strong lang=\"en\">true</strong>, las pestañas se mostrarán verticalmente.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Define la clave para activar una pestaña al inicializar. Si el valor del campo especificado en <strong lang=\"en\">key-active</strong> está establecido en <strong lang=\"en\">true</strong>, esa pestaña se activará.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Permite especificar la clave para los datos que se mostrarán como contenido para cada pestaña.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Clave para deshabilitar pestañas individuales. Si el valor de esta clave en una pestaña está establecido en <strong lang=\"en\">true</strong>, estará deshabilitada.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Identificador único para las pestañas. Si <strong lang=\"en\">key-id</strong> no está especificado, se usa el índice como identificador único de la pestaña.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Clave para especificar el campo que se usará para las etiquetas de las pestañas.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Permite especificar la clave para los datos que se mostrarán como títulos de las pestañas.",
  "_A_TABS_SLOTS_CONTENT_DESCRIPTION_": "Slot estático para personalizar la visualización del contenido de la pestaña. Los argumentos del slot incluyen: <strong lang=\"en\">activeTabId</strong> — identificador de la pestaña activa, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del bloque de contenido, <strong lang=\"en\">index</strong> — índice de la pestaña, <strong lang=\"en\">isActive</strong> — bandera de actividad, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> del componente completo, <strong lang=\"en\">tab</strong> — elemento del array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> de la pestaña.",
  "_A_TABS_SLOTS_SLOT_CONTENT_DESCRIPTION_": "Slot dinámico para personalizar la visualización del contenido de la pestaña. El nombre del slot se especifica en el array <strong lang=\"en\">data</strong> para cada elemento. Los argumentos del slot incluyen: <strong lang=\"en\">activeTabId</strong> — identificador de la pestaña activa, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del bloque de contenido, <strong lang=\"en\">index</strong> — índice de la pestaña, <strong lang=\"en\">isActive</strong> — bandera de actividad, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> del componente completo, <strong lang=\"en\">tab</strong> — elemento del array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> de la pestaña.",
  "_A_TABS_SLOTS_SLOT_TAB_DESCRIPTION_": "Slot dinámico para personalizar la visualización de la pestaña. El nombre del slot se especifica en el array <strong lang=\"en\">data</strong> para cada elemento. Los argumentos del slot incluyen: <strong lang=\"en\">activeTabId</strong> — identificador de la pestaña activa, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del bloque de contenido, <strong lang=\"en\">index</strong> — índice de la pestaña, <strong lang=\"en\">isActive</strong> — bandera de actividad, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> del componente completo, <strong lang=\"en\">tab</strong> — elemento del array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> de la pestaña.",
  "_A_TABS_SLOTS_TAB_DESCRIPTION_": "Slot estático para personalizar la visualización de la pestaña. Los argumentos del slot incluyen: <strong lang=\"en\">activeTabId</strong> — identificador de la pestaña activa, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del bloque de contenido, <strong lang=\"en\">index</strong> — índice de la pestaña, <strong lang=\"en\">isActive</strong> — bandera de actividad, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> del componente completo, <strong lang=\"en\">tab</strong> — elemento del array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> de la pestaña.",
  "_A_TABS_TAB_": "Pestaña",
  "_A_TABS_TAB_1_": "Pestaña 1",
  "_A_TABS_TAB_2_": "Pestaña 2",
  "_A_TABS_TAB_3_": "Pestaña 3",
  "_A_TABS_TAB_4_": "Pestaña 4"
}