{
  "_A_TABS_COMPONENT_DESCRIPTION_": "Компонент <strong lang=\"en\">ATabs</strong> используется для организации контента с помощью вкладок. Каждая вкладка содержит заголовок и соответствующий контент, отображаемый при активации вкладки. Поддерживаются различные настройки, такие как вертикальное или горизонтальное расположение, отключение вкладок, возможность использования <strong lang=\"en\">HTML</strong> в заголовках и настройка поведения активной вкладки.",
  "_A_TABS_COMPONENT_NAME_": "Вкладки",
  "_A_TABS_CONTENT_1_": "Содержимое 1",
  "_A_TABS_CONTENT_2_": "Содержимое 2",
  "_A_TABS_CONTENT_3_": "Содержимое 3",
  "_A_TABS_CONTENT_4_": "Содержимое 4",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Событие, которое срабатывает при нажатии на вкладку. Возвращает объект с аргументами: <strong lang=\"en\">$event</strong> — информация о событии, <strong lang=\"en\">tab</strong> — данные о вкладке, <strong lang=\"en\">tabId</strong> — уникальный идентификатор вкладки или индекс, <strong lang=\"en\">index</strong> — индекс вкладки в массиве данных.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">active-tab-id</strong>, чтобы задать активную вкладку при рендеринге. Значение <strong lang=\"en\">active-tab-id</strong> может быть <strong lang=\"en\">ID</strong>, если используется <strong lang=\"en\">key-id</strong>, или индекс вкладки, если ключ <strong lang=\"en\">key-id</strong> не задан. Компонент автоматически отслеживает изменения этого свойства.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Определение активной вкладки через <strong lang=\"en\">ID</strong> или индекс",
  "_A_TABS_GROUP_COMPLEX_DESCRIPTION_": "В этом примере показано, как использовать компонент <strong lang=\"en\">a-tabs</strong> с различными настройками и возможностью добавления и удаления вкладок. В форме можно изменить такие параметры, как отключение вкладок, их расположение (вертикальное или горизонтальное), включение/отключение рамки для активных вкладок и использование <strong lang=\"en\">HTML</strong> для заголовков вкладок. В дополнение, реализована возможность динамического добавления новых вкладок и удаления существующих через выбор в списке.",
  "_A_TABS_GROUP_COMPLEX_HEADER_": "Пример с настройками и управлением вкладками",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">disabled</strong> для отключения всех вкладок. Когда это свойство установлено в <strong lang=\"en\">true</strong>, пользователи не могут взаимодействовать с вкладками.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Отключение вкладок",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_DESCRIPTION_": "В этом примере показано, как использовать динамические слоты <strong lang=\"en\">slotTab</strong> и <strong lang=\"en\">slotContent</strong>, имена которых указаны в массиве <strong lang=\"en\">data</strong>. Если передано имя и соответствующий слот, они заменяют стандартное содержимое вкладок и контента. Аргументы слотов предоставляют доступ к <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_HEADER_": "Динамические слоты для вкладок и контента",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-boxed</strong>, чтобы определить, будет ли отображаться рамка вокруг активной вкладки. Первый пример с включенной рамкой, второй — без рамки.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Рамка для активной вкладки",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-change-outside</strong>. Если его значение установлено в <strong lang=\"en\">true</strong>, при нажатии на неактивную вкладку она не станет активной автоматически. Для изменения активной вкладки необходимо использовать событие <strong lang=\"en\">change</strong> и свойство <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "Вкладка меняется только через событие",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-vertical</strong>, чтобы располагать вкладки вертикально или горизонтально. Первые два примера показывают вертикальное расположение вкладок, а третий — горизонтальное.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Вертикальные вкладки",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-active</strong>, чтобы задать активную вкладку при инициализации компонента. Если в данных для вкладки указано поле <strong lang=\"en\">active</strong> со значением <strong lang=\"en\">true</strong>, эта вкладка станет активной при первом рендере.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Активная вкладка при инициализации",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-content</strong>, чтобы указать, какое поле данных будет использовано для отображения содержимого, связанного с каждой вкладкой. Вместо стандартного ключа <strong lang=\"en\">content</strong> используется <strong lang=\"en\">aloha</strong> для отображения содержимого, соответствующего каждой вкладке.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Ключ для отображения содержимого",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-disabled</strong>, чтобы отключить отдельные вкладки. Вкладки, у которых параметр <strong lang=\"en\">disabled</strong> установлен в <strong lang=\"en\">true</strong>, не будут доступны для взаимодействия.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Отключение отдельных вкладок",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-id</strong>, чтобы улучшить производительность при рендеринге вкладок. Использование уникального идентификатора для каждой вкладки позволяет быстрее определять активную вкладку. Если <strong lang=\"en\">key-id</strong> не указан, используется индекс вкладки.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Уникальный идентификатор для вкладок",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-label</strong>, чтобы указать альтернативное поле для меток вкладок. В данном случае используется ключ <strong lang=\"en\">name</strong> вместо <strong lang=\"en\">label</strong> для названий вкладок.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Ключ для меток вкладок",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-title</strong>, чтобы указать, какое поле данных будет использовано для отображения заголовка вкладок. Вместо стандартного заголовка, можно использовать другой ключ, например <strong lang=\"en\">label</strong>.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Ключ для заголовка вкладок",
  "_A_TABS_GROUP_STATIC_SLOTS_DESCRIPTION_": "В этом примере показано, как использовать статические слоты <strong lang=\"en\">tab</strong> и <strong lang=\"en\">content</strong> для кастомизации отображения вкладок и их содержимого. Аргументы слотов предоставляют доступ к <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_STATIC_SLOTS_HEADER_": "Статические слоты для вкладок и контента",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-title-html</strong>, чтобы разрешить отображение <strong lang=\"en\">HTML</strong>-контента в заголовках вкладок. Вместе с этим используется свойство <strong lang=\"en\">key-title</strong> для указания ключа, по которому будет взят <strong lang=\"en\">HTML</strong>-контент для заголовков вкладок.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> в заголовках вкладок",
  "_A_TABS_LABEL_ADD_TABS_": "Добавление вкладок",
  "_A_TABS_LABEL_DELETE_TABS_": "Удаление вкладок",
  "_A_TABS_LABEL_DISABLED_": "Отключение вкладок (<strong lang=\"en\">disabled</strong>)",
  "_A_TABS_LABEL_IS_BOXED_": "Рамка для активной вкладки (<strong lang=\"en\">isBoxed</strong>)",
  "_A_TABS_LABEL_IS_TITLE_HTML_": "<strong lang=\"en\">HTML</strong> в заголовках вкладок (<strong lang=\"en\">isTitleHtml</strong>)",
  "_A_TABS_LABEL_IS_VERTICAL_": "Вертикальные вкладки (<strong lang=\"en\">isVertical</strong>)",
  "_A_TABS_LABEL_TITLE_PLACEMENT_": "Расположение всплывающей подсказки относительно элемента (<strong lang=\"en\">titlePlacement</strong>)",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Определяет <strong lang=\"en\">ID</strong> или индекс активной вкладки. Если <strong lang=\"en\">key-id</strong> не установлен, используется индекс вкладки. Компонент отслеживает изменения этого значения для обновления активной вкладки.",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "Массив данных, описывающий вкладки. Каждый элемент массива представляет собой объект с параметрами для заголовка, контента и других свойств вкладок.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Отключает возможность взаимодействия с вкладками. Если значение <strong lang=\"en\">true</strong>, вкладки будут недоступны для переключения.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Определяет, будет ли активная вкладка окружен рамкой. Если установлено в <strong lang=\"en\">true</strong>, рамка будет отображаться.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Если установлено в <strong lang=\"en\">true</strong>, вкладка не меняется автоматически при нажатии. Для этого необходимо использовать событие <strong lang=\"en\">change</strong> и установить новое значение <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Определяет, будут ли вкладки располагаться вертикально или горизонтально. Если значение установлено в <strong lang=\"en\">true</strong>, вкладки будут отображаться вертикально.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Определяет ключ для активации вкладки при инициализации. Если значение поля, указанного в <strong lang=\"en\">key-active</strong>, установлено в <strong lang=\"en\">true</strong>, то соответствующая вкладка будет активирована.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Позволяет указать ключ для данных, которое будет отображаться как содержимое для каждой вкладки.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Ключ для отключения отдельных вкладок. Если у вкладки значение данного ключа установлено в <strong lang=\"en\">true</strong>, она будет отключена.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Уникальный идентификатор для вкладок. Если <strong lang=\"en\">key-id</strong> не указан, используется индекс для уникального  идентификатора вкладки.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Ключ для указания поля, которое будет использоваться для меток вкладок.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Позволяет указать ключ для данных, которые будут отображаться как заголовки вкладок.",
  "_A_TABS_SLOTS_CONTENT_DESCRIPTION_": "Статический слот для настройки отображения содержимого вкладки. Аргументы слота включают: <strong lang=\"en\">activeTabId</strong> — идентификатор активной вкладки, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> блока с контентом, <strong lang=\"en\">index</strong> — индекс вкладки, <strong lang=\"en\">isActive</strong> — флаг активности, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> всего компонента, <strong lang=\"en\">tab</strong> — элемент из массива <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> вкладки.",
  "_A_TABS_SLOTS_SLOT_CONTENT_DESCRIPTION_": "Динамический слот для настройки отображения содержимого вкладки. Имя слота указывается в массиве <strong lang=\"en\">data</strong> для каждого элемента. Аргументы слота включают: <strong lang=\"en\">activeTabId</strong> — идентификатор активной вкладки, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> блока с контентом, <strong lang=\"en\">index</strong> — индекс вкладки, <strong lang=\"en\">isActive</strong> — флаг активности, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> всего компонента, <strong lang=\"en\">tab</strong> — элемент из массива <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> вкладки.",
  "_A_TABS_SLOTS_SLOT_TAB_DESCRIPTION_": "Динамический слот для настройки отображения вкладки. Имя слота указывается в массиве <strong lang=\"en\">data</strong> для каждого элемента. Аргументы слота включают: <strong lang=\"en\">activeTabId</strong> — идентификатор активной вкладки, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> блока с контентом, <strong lang=\"en\">index</strong> — индекс вкладки, <strong lang=\"en\">isActive</strong> — флаг активности, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> всего компонента, <strong lang=\"en\">tab</strong> — элемент из массива <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> вкладки.",
  "_A_TABS_SLOTS_TAB_DESCRIPTION_": "Статический слот для настройки отображения вкладки. Аргументы слота включают: <strong lang=\"en\">activeTabId</strong> — идентификатор активной вкладки, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> блока с контентом, <strong lang=\"en\">index</strong> — индекс вкладки, <strong lang=\"en\">isActive</strong> — флаг активности, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> всего компонента, <strong lang=\"en\">tab</strong> — элемент из массива <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> вкладки.",
  "_A_TABS_TAB_": "Вкладка",
  "_A_TABS_TAB_1_": "Вкладка 1",
  "_A_TABS_TAB_2_": "Вкладка 2",
  "_A_TABS_TAB_3_": "Вкладка 3",
  "_A_TABS_TAB_4_": "Вкладка 4"
}
