{
  "_A_TABS_COMPONENT_NAME_": "",
  "_A_TABS_COMPONENT_DESCRIPTION_": "",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "Вкладка меняется только через событие",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-change-outside</strong>. Если его значение установлено в <strong lang=\"en\">true</strong>, при нажатии на неактивную вкладку она не станет активной автоматически. Для изменения активной вкладки необходимо использовать событие <strong lang=\"en\">change</strong> и свойство <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Если установлено в <strong lang=\"en\">true</strong>, вкладка не меняется автоматически при нажатии. Для этого необходимо использовать событие <strong lang=\"en\">change</strong> и установить новое значение <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Событие, которое срабатывает при нажатии на вкладку. Возвращает объект с аргументами: <strong lang=\"en\">$event</strong> — информация о событии, <strong lang=\"en\">tab</strong> — данные о вкладке, <strong lang=\"en\">tabId</strong> — уникальный идентификатор вкладки или индекс, <strong lang=\"en\">index</strong> — индекс вкладки в массиве данных.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Определение активной вкладки через <strong lang=\"en\">ID</strong> или индекс",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">active-tab-id</strong>, чтобы задать активную вкладку при рендеринге. Значение <strong lang=\"en\">active-tab-id</strong> может быть <strong lang=\"en\">ID</strong>, если используется <strong lang=\"en\">key-id</strong>, или индекс вкладки, если ключ <strong lang=\"en\">key-id</strong> не задан. Компонент автоматически отслеживает изменения этого свойства.",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Определяет <strong lang=\"en\">ID</strong> или индекс активной вкладки. Если <strong lang=\"en\">key-id</strong> не установлен, используется индекс вкладки. Компонент отслеживает изменения этого значения для обновления активной вкладки.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Активная вкладка при инициализации",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-active</strong>, чтобы задать активную вкладку при инициализации компонента. Если в данных для вкладки указано поле <strong lang=\"en\">active</strong> со значением <strong lang=\"en\">true</strong>, эта вкладка станет активной при первом рендере.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Определяет ключ для активации вкладки при инициализации. Если значение поля, указанного в <strong lang=\"en\">key-active</strong>, установлено в <strong lang=\"en\">true</strong>, то соответствующая вкладка будет активирована.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Уникальный идентификатор для вкладок",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-id</strong>, чтобы улучшить производительность при рендеринге вкладок. Использование уникального идентификатора для каждой вкладки позволяет быстрее определять активную вкладку. Если <strong lang=\"en\">key-id</strong> не указан, используется индекс вкладки.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Уникальный идентификатор для вкладок. Если <strong lang=\"en\">key-id</strong> не указан, используется индекс для уникального  идентификатора вкладки.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Вертикальные вкладки",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-vertical</strong>, чтобы располагать вкладки вертикально или горизонтально. Первые два примера показывают вертикальное расположение вкладок, а третий — горизонтальное.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Определяет, будут ли вкладки располагаться вертикально или горизонтально. Если значение установлено в <strong lang=\"en\">true</strong>, вкладки будут отображаться вертикально.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Рамка для активного таба",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-boxed</strong>, чтобы определить, будет ли отображаться рамка вокруг активного таба. Первый пример с включенной рамкой, второй — без рамки.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Определяет, будет ли активный таб окружен рамкой. Если установлено в <strong lang=\"en\">true</strong>, рамка будет отображаться.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> в заголовках вкладок",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">is-title-html</strong>, чтобы разрешить отображение <strong lang=\"en\">HTML</strong>-контента в заголовках вкладок. Вместе с этим используется свойство <strong lang=\"en\">key-title</strong> для указания ключа, по которому будет взят <strong lang=\"en\">HTML</strong>-контент для заголовков вкладок.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Ключ для заголовка вкладок",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-title</strong>, чтобы указать, какое поле данных будет использовано для отображения заголовка вкладок. Вместо стандартного заголовка, можно использовать другой ключ, например <strong lang=\"en\">label</strong>.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Позволяет указать ключ для данных, которые будут отображаться как заголовки вкладок.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Ключ для отображения содержимого",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-content</strong>, чтобы указать, какое поле данных будет использовано для отображения содержимого, связанного с каждой вкладкой. Вместо стандартного ключа <strong lang=\"en\">content</strong> используется <strong lang=\"en\">aloha</strong> для отображения содержимого, соответствующего каждой вкладке.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Позволяет указать ключ для данных, которое будет отображаться как содержимое для каждой вкладки.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Ключ для меток вкладок",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-label</strong>, чтобы указать альтернативное поле для меток вкладок. В данном случае используется ключ <strong lang=\"en\">name</strong> вместо <strong lang=\"en\">label</strong> для названий вкладок.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Ключ для указания поля, которое будет использоваться для меток вкладок.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Отключение отдельных вкладок",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">key-disabled</strong>, чтобы отключить отдельные вкладки. Вкладки, у которых параметр <strong lang=\"en\">disabled</strong> установлен в <strong lang=\"en\">true</strong>, не будут доступны для взаимодействия.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Ключ для отключения отдельных вкладок. Если у вкладки значение данного ключа установлено в <strong lang=\"en\">true</strong>, она будет отключена.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Отключение вкладок",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">disabled</strong> для отключения всех вкладок. Когда это свойство установлено в <strong lang=\"en\">true</strong>, пользователи не могут взаимодействовать с вкладками.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Отключает возможность взаимодействия с вкладками. Если значение <strong lang=\"en\">true</strong>, вкладки будут недоступны для переключения."
}
