{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "مكون AProgress هو شريط تقدم قابل للتخصيص لتطبيقات Vue.js. يتيح لك تمثيل تقدم العملية بصريًا.",
  "_A_PROGRESS_COMPONENT_NAME_": "شريط التقدم",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بألوان قابلة للتخصيص وتعديلها وفقًا لتصميم تطبيقك Vue.js. يمكنك تخصيص كل من لون الخلفية لشريط التقدم ولون عرض التقدم بشكل فردي.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "مجموعات ألوان قابلة للتخصيص لأشرطة التقدم",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بألوان مختلفة وتعديلها وفقًا لتصميم تطبيقك Vue.js. باستخدام مرونة الـ props، يمكنك تخصيص ألوان خلفيات أشرطة التقدم وعرض التقدم بصريًا. هذه الألوان القابلة للتخصيص توفر لك تكاملًا سهلاً في مشاريعك وتتيح لك تكوين شريط التقدم حسب احتياجات التطبيق.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بوظيفة تقوم بتوليد فئة الخلفية ديناميكيًا بناءً على قيمة التقدم. بدلاً من فئة خلفية ثابتة، يمكنك ربط prop <strong>class-progress-bar</strong> بوظيفة تُعيد قيمة الفئة المطلوبة.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "أشرطة تقدم قابلة للتخصيص ديناميكيًا بوظيفة للفئات",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "ألوان قابلة للتخصيص لأشرطة التقدم",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "يتيح لك مكون AProgress التحكم في مدة الرسوم المتحركة لأشرطة التقدم. باستخدام prop <strong>duration</strong>، يمكنك تحديد سرعة الرسوم المتحركة، مما يجعل شريط التقدم يتحرك ببطء أو بسرعة. تُحدد المدة بالثواني وتؤثر على السرعة التي يتحرك بها شريط التقدم في العرض المخطط أو غير المحدد.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "التحكم في مدة الرسوم المتحركة",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم غير محددة مع الرسوم المتحركة. باستخدام prop <strong>indeterminate</strong>، يمكنك إنشاء شريط تقدم لا يمثل التقدم بقيمة محددة. بدلاً من ذلك، يتم عرض حركة مستمرة متحركة للإشارة إلى أن عملية ما جارية دون معرفة مدة أو قيمة التقدم المحددة. هذا النوع من شريط التقدم مناسب بشكل خاص للحالات التي تستغرق فيها العملية وقتًا أطول ولا يمكن تحديد التقدم بشكل كمي.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "أشرطة تقدم غير محددة مع الرسوم المتحركة",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بحدود ديناميكية. يمكنك استخدام props min و max لتحديد الحد الأدنى والحد الأقصى لشريط التقدم. هذا يوفر لك مرونة تكوين شريط التقدم لسيناريوهات مختلفة وعرض التقدم بمقاييس مختلفة.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "حدود ديناميكية",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بعرض معكوس. عند تعيين prop <strong>reverse</strong> إلى true، يتم عرض التقدم من اليمين إلى اليسار بدلاً من اليسار إلى اليمين.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "عرض معكوس",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم مع عرض اختياري للقيمة. باستخدام prop <strong>showValue</strong>، يمكنك التحكم في ما إذا كانت قيمة التقدم ستعرض كنص داخل شريط التقدم.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "عرض اختياري للقيمة",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بأحجام مختلفة وتعديلها وفقًا لتصميم تطبيقك Vue.js.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "أحجام قابلة للتخصيص لأشرطة التقدم",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "يوفر لك مكون AProgress إمكانية تخصيص قيمة التقدم المعروضة باستخدام slot <strong>progressText</strong>. يتيح لك هذا slot إنشاء عرض مخصص لقيمة شريط التقدم، يتجاوز العرض الافتراضي للقيمة.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "عرض مخصص لقيمة التقدم باستخدام slot <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم مخططة. باستخدام prop <strong>striped</strong>، يمكنك تفعيل تخطيط شريط التقدم، مما يبرز شريط التقدم بصريًا. يمكن أن يساعد العرض المخطط لشريط التقدم في توجيه الانتباه إلى التقدم وتقديم ردود فعل بصرية أفضل للمستخدم.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم مخططة مع عرض متحرك. باستخدام prop <strong>striped-flow</strong>، يمكنك تفعيل حركة متدفقة لأشرطة التقدم المخططة. يضيف هذا الحركة تأثيرًا بصريًا ديناميكيًا لشريط التقدم ويمكن أن يساعد في عرض التقدم بطريقة جذابة.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "أشرطة تقدم مخططة مع الرسوم المتحركة",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "أشرطة تقدم مخططة",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "يتيح لك مكون AProgress تحديث أشرطة التقدم في الوقت الحقيقي عن طريق تغيير props value ديناميكيًا. بالتوازي مع حقل إدخال من نوع \"integerNonNegative\"، كما هو موضح في المثال، يمكن للمستخدمين التحكم في التقدم باستخدام مكون a-input-number. هذا يتيح لك تعديل شريط التقدم ديناميكيًا بناءً على إدخالات المستخدم أو الأحداث الأخرى وعرض التقدم الحالي بصريًا.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "أشرطة تقدم قابلة للتحديث ديناميكيًا",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "يتيح لك مكون AProgress إنشاء أشرطة تقدم بتنسيقات نصية مختلفة لقيمة التقدم. عند تعيين prop valueTextInteger إلى true، يتم عرض قيمة التقدم كنسبة مئوية صحيحة (مثل \"20 %\"). عند تعيين prop valueTextInteger إلى false أو عدم تعيينه، يتم عرض قيمة التقدم كنسبة مئوية بمرتين عشريتين (مثل \"20.00 %\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "عرض القيمة بشكل مختلف",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "يتيح لك هذا prop تحديد فئة أو أكثر لشريط التقدم لتعديل مظهره.",
  "_A_PROGRESS_PROPS_DURATION_": "يتحكم هذا prop في مدة الرسوم المتحركة لشريط التقدم.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "يفعل هذا prop عرض شريط التقدم غير المحدد. عند تعيين indeterminate إلى true، يتم تحريك شريط التقدم ويعرض حركة مستمرة وغير محددة.",
  "_A_PROGRESS_PROPS_MAX_": "القيمة القصوى لشريط التقدم",
  "_A_PROGRESS_PROPS_MIN_": "القيمة الدنيا لشريط التقدم",
  "_A_PROGRESS_PROPS_REVERSE_": "يشير هذا prop إلى ما إذا كان يجب عرض التقدم من اليمين إلى اليسار.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "يشير هذا prop إلى ما إذا كانت قيمة التقدم ستعرض كنص داخل شريط التقدم.",
  "_A_PROGRESS_PROPS_STRIPED_": "يفعل هذا prop عرض شريط التقدم المخطط.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "يفعل هذا prop عرض شريط التقدم المخطط مع الرسوم المتحركة.",
  "_A_PROGRESS_PROPS_VALUE_": "التقدم الحالي لشريط التقدم",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "يشير هذا prop إلى تنسيق النص المستخدم لقيمة التقدم. عند تعيين valueTextInteger إلى true، يتم عرض القيمة كنسبة مئوية صحيحة. عند تعيين valueTextInteger إلى false أو عدم تعيينه، يتم عرض القيمة كنسبة مئوية بمرتين عشريتين.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "يتيح لك هذا slot تخصيص عرض قيمة شريط التقدم. يمكنك الوصول إلى المتغير valuePercent في النطاق slot لعرض التقدم الحالي بالنسبة المئوية."
}
