{
  "_A_PROGRESS_COMPONENT_NAME_": "Fortschrittsbalken",
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "Die AProgress-Komponente ist ein anpassbarer Fortschrittsbalken für Vue.js-Anwendungen. Sie ermöglicht es Ihnen, den Fortschritt eines Vorgangs visuell darzustellen.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Anpassbare Farben für Fortschrittsbalken",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken in verschiedenen Farben zu erstellen und sie an das Design Ihrer Vue.js-Anwendung anzupassen. Mit der Flexibilität der Props können Sie die Hintergrundfarben der Fortschrittsbalken individuell gestalten und den Fortschritt visuell darstellen. Diese anpassbaren Farben bieten Ihnen eine einfache Integration in Ihre Projekte und ermöglichen es Ihnen, den Fortschrittsbalken je nach Anwendungsbedarf zu konfigurieren.",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Diese Prop ermöglicht es Ihnen, eine oder mehrere Klassen für den Fortschrittsbalken festzulegen, um dessen Aussehen anzupassen.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Anpassbare Größen für Fortschrittsbalken",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken in verschiedenen Größen zu erstellen und sie an das Design Ihrer Vue.js-Anwendung anzupassen.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Anpassbare Farbkombinationen für Fortschrittsbalken",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit anpassbaren Farbkombinationen zu erstellen und sie an das Design Ihrer Vue.js-Anwendung anzupassen. Sie können sowohl die Hintergrundfarbe des Fortschrittsbalkens als auch die Farbe der Fortschrittsanzeige individuell gestalten.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Dynamisch aktualisierbare Fortschrittsbalken",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken in Echtzeit zu aktualisieren, indem Sie die Props value dynamisch ändern. In Verbindung mit einem Eingabefeld vom Typ \"integer-non-negative\", wie im Beispiel gezeigt, können Benutzer den Fortschritt mithilfe des a-input-number-Komponente steuern. Dadurch können Sie den Fortschrittsbalken in Abhängigkeit von Benutzereingaben oder anderen Ereignissen dynamisch anpassen und den aktuellen Fortschritt visuell darstellen.",
  "_A_PROGRESS_PROPS_VALUE_": "Der aktuellen Fortschritt des Fortschrittsbalkens",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Dynamischen Grenzwerte",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit dynamischen Grenzwerten zu erstellen. Sie können die Props min und max verwenden, um die untere und obere Grenze des Fortschrittsbalkens festzulegen. Dadurch haben Sie die Flexibilität, den Fortschrittsbalken für unterschiedliche Szenarien zu konfigurieren und den Fortschritt in verschiedenen Skalen darzustellen.",
  "_A_PROGRESS_PROPS_MIN_": "Der minimale Wert des Fortschrittsbalkens",
  "_A_PROGRESS_PROPS_MAX_": "Der maximale Wert des Fortschrittsbalkens",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Optionale Wertanzeige",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit einer optionalen Wertanzeige zu erstellen. Mithilfe der Prop showValue können Sie steuern, ob der Fortschrittswert als Text innerhalb des Fortschrittsbalkens angezeigt werden soll.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Diese Prop gibt an, ob der Fortschrittswert als Text innerhalb des Fortschrittsbalkens angezeigt werden soll.",
  "_A_PROGRESS_GROUP_REVERS_HEADER_": "Umgekehrte Anzeige",
  "_A_PROGRESS_GROUP_REVERS_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit umgekehrter Anzeige zu erstellen. Wenn die Prop revers auf true gesetzt ist, wird die Fortschrittsanzeige von rechts nach links angezeigt, anstatt von links nach rechts.",
  "_A_PROGRESS_PROPS_REVERS_": "Diese Prop gibt an, ob die Fortschrittsanzeige von rechts nach links angezeigt werden soll.",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Unterschiedliche Wertanzeige",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit unterschiedlichen Textformaten für den Fortschrittswert zu erstellen. Wenn die Prop valueTextInteger auf true gesetzt ist, wird der Fortschrittswert als ganzzahliger Prozentsatz (z.B. \"20 %\") angezeigt. Wenn die Prop valueTextInteger auf false oder nicht gesetzt ist, wird der Fortschrittswert als Prozentsatz mit zwei Dezimalstellen (z.B. \"20,00 %\") angezeigt.",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Diese Prop gibt an, welches Textformat für den Fortschrittswert verwendet werden soll. Wenn valueTextInteger auf true gesetzt ist, wird der Wert als ganzzahliger Prozentsatz angezeigt. Wenn valueTextInteger auf false gesetzt ist oder nicht vorhanden ist, wird der Wert als Prozentsatz mit zwei Dezimalstellen angezeigt.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Dynamisch anpassbare Fortschrittsbalken mit Funktion für Klassen",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, Fortschrittsbalken mit einer Funktion zu erstellen, die dynamisch die Hintergrundklasse basierend auf dem Fortschrittswert generiert. Anstelle einer festen Hintergrundklasse können Sie die Prop <strong>class-progress-bar</strong> mit einer Funktion verknüpfen, die den gewünschten Klassenwert zurückgibt.",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Gestreifte Fortschrittsbalken",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, gestreifte Fortschrittsbalken zu erstellen. Durch die Verwendung der Prop <strong>striped</strong> können Sie die Gestreiftheit des Fortschrittsbalkens aktivieren, wodurch dieser visuell hervorgehoben wird. Die gestreifte Darstellung des Fortschrittsbalkens kann helfen, den Fokus auf den Fortschritt zu lenken und dem Benutzer eine bessere visuelle Rückmeldung zu geben.",
  "_A_PROGRESS_PROPS_STRIPED_": "Diese Prop aktiviert die gestreifte Darstellung des Fortschrittsbalkens.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Gestreifte Fortschrittsbalken mit Animation",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, gestreifte Fortschrittsbalken mit einer animierten Darstellung zu erstellen. Durch die Verwendung der Prop <strong>striped-flow</strong> können Sie eine fließende Animation für gestreifte Fortschrittsbalken aktivieren. Diese Animation verleiht dem Fortschrittsbalken eine dynamische visuelle Wirkung und kann dazu beitragen, den Fortschritt auf eine ansprechende Weise darzustellen.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Diese Prop aktiviert die animierte Darstellung für gestreifte Fortschrittsbalken.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Unbestimmte Fortschrittsbalken mit Animation",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, unbestimmte Fortschrittsbalken mit Animation zu erstellen. Durch die Verwendung der Prop <strong>indeterminate</strong> können Sie einen Fortschrittsbalken erstellen, bei dem der Fortschritt nicht durch einen spezifischen Wert repräsentiert wird. Stattdessen wird eine kontinuierliche, animierte Bewegung dargestellt, um anzuzeigen, dass ein Prozess im Gange ist, dessen genaue Dauer oder Fortschrittswert nicht bekannt ist. Diese Art von Fortschrittsbalken eignet sich besonders für Situationen, in denen ein Vorgang länger dauert und der Fortschritt nicht quantifiziert werden kann.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Diese Prop aktiviert die unbestimmte Darstellung des Fortschrittsbalkens. Wenn indeterminate auf true gesetzt ist, wird der Fortschrittsbalken animiert und zeigt eine kontinuierliche, unbestimmte Bewegung an.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Steuerung der Animationsdauer",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "Die AProgress-Komponente ermöglicht es Ihnen, die Animationsdauer für Fortschrittsbalken zu steuern. Durch die Verwendung der Prop <strong>duration</strong> können Sie die Geschwindigkeit der Animation festlegen, wodurch der Fortschrittsbalken langsamer oder schneller animiert wird. Die Dauer wird in Sekunden angegeben und beeinflusst die Geschwindigkeit, mit der sich der Fortschrittsbalken bei gestreifter oder unbestimmter Darstellung bewegt.",
  "_A_PROGRESS_PROPS_DURATION_": "Diese Prop steuert die Animationsdauer für den Fortschrittsbalken."
}