{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "AProgress komponenta je prilagodljiva traka napretka za Vue.js aplikacije. Omogućuje vizualni prikaz napretka aktivnosti ili procesa.",
  "_A_PROGRESS_COMPONENT_NAME_": "Traka napretka",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "Komponenta AProgress omogućuje kreiranje traka napretka s prilagodljivim kombinacijama boja usklađenih s temom vaše Vue.js aplikacije. Moguće je prilagoditi boju pozadine trake napretka kao i boju same trake napretka.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Prilagodljive kombinacije boja za traku napretka",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "Komponenta AProgress omogućuje prilagodbu trake napretka u različitim bojama koje odgovaraju temi vaše Vue.js aplikacije. Uz fleksibilnost prop-ova, možete prilagoditi pozadinske boje trake i vizualizirati napredak. Ove prilagodljive boje omogućuju vam jednostavnu integraciju u vaše projekte i jednostavnu konfiguraciju trake napretka na temelju potreba aplikacije.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "Komponenta AProgress omogućuje vam stvaranje traka napretka s funkcijom koja dinamički generira klasu pozadine na temelju vrijednosti napretka. Umjesto fiksne pozadinske klase, prop <strong>class-progress-bar</strong> možete pridružiti funkciji koja vraća željenu vrijednost klase.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Dinamički prilagodljive trake napretka s funkcijom koja određuje klasu.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Prilagodljive boje za traku napretka",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "Komponenta AProgress omogućuje vam kontrolu trajanja animacije trake napretka. Korišteći prop <strong>duration</strong> možete odrediti brzinu animacije, tako da se traka napretka kreće sporije ili brže. Trajanje je navedeno u sekundama i utječe na brzinu kojom se traka napretka pomiče za prugastu ili neodređenu traku napretka.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Kontrola trajanja animacije",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "Komponenta AProgress omogućuje stvaranje neodređenih traka napretka s animacijom. Korišteći prop <strong>indeterminate</strong>, možete se kreirati traka čiji napredak nije predstavljen određenom vrijednošću. Umjesto toga, prikazuje se neprekidno, animirano kretanje koje označava da je aktivnost u tijeku bez naznake očekivanog trajanja. Ova vrsta trake napretka posebno je korisna u situacijama kada proces traje dugo i kad se napredak ne može kvantificirati.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Neodređena traka napretka s animacijom",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "Komponenta AProgress omogućuje stvaranje traka napretka s dinamičkim granicama korišteći prop <strong>min</strong> i prop <strong>max</strong> za postavljanje donje i gornje granice trake napretka, respektivno. To vam daje fleksibilnost da konfigurirate traku napretka za različite scenarije i da prikažete napredak u različitim razmjerima.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Dinamičke granice",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "Komponenta AProgress omogućuje vam stvaranje traka napretka s obrnutim prikazom. Kada je prop <strong>reverse</strong> postavljen na vrijednost true, traka napretka se prikazuje s desna na lijevo umjesto slijeva na desno.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "Obrnuti prikaz",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "Komponenta AProgress omogućuje stvaranje traka napretka s opcionalnim prikazom vrijednosti. Slot <strong>showValue</strong> može se upotrijebiti za određivanje treba li vrijednost napretka biti prikazana kao tekst unutar trake napretka.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Opcionalni prikaz vrijednosti napretka",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "Komponenta AProgress omogućuje vam stvaranje traka napretka različite veličine kako bi se prilagodile temi vaše Vue.js aplikacije.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Prilagodljiva veličina trake napretka",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "Komponenta AProgress pruža mogućnost prilagođavanja prikaza vrijednosti napretka koristeći slot <strong>progressText</strong>. Ovaj slot omogućuje stvaranje prilagođenog prikaza vrijednosti trake napretka umjesto zadanog.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "Prilagođeni prikaz vrijednosti napretka korištenjem slot-a <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "Komponenta AProgress omogućuje stvaranje prugastih traka napretka. Korišteći <strong>striped</strong> prop omogućava se da traka napretka bude prugasta, što ju vizualno ističe. Prugasti izgled trake napretka može pomoći u fokusiranju na napredak i dati korisniku bolju vizualnu povratnu informaciju.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "Komponenta AProgress omogućuje stvaranje animiranih prugastih traka napretka. Korišteći <strong>striped-flow</strong> prop možete omogućiti pomičnu animaciju za prugaste trake napretka. Ovakva animacija traci napretka daje dinamičan vizualni dojam i može pomoći prikazati napredak na korisnički privlačan način.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Prugasta traka napretka s animacijom",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Prugasta traka napretka",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "Komponenta AProgress omogućuje ažuriranje trake napretka u stvarnom vremenu dinamičkom promjenom props-vrijednosti. U kombinaciji s poljem za unos cijelog broja koji nije negativan, kao što je prikazano u primjeru, korisnici mogu kontrolirati napredak pomoću komponente a-input-number. To omogućuje dinamičku prilagodbu trake napretka ovisno o korisničkom unosu ili drugim događajima i vizualno predstavljanje trenutnog napretka.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Dinamički ažurirana traka napretka",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "Komponenta AProgress omogućuje vam stvaranje traka napretka s različitim tekstualnim formatima za vrijednost napretka. Ako je prop valueTextInteger postavljen na true, vrijednost napretka prikazuje se kao cjelobrojni postotak (npr. \"20%\"). Ako je vrijednost prop-a valueTextInteger false ili ako nije postavljena, vrijednost napretka prikazuje se kao postotak s dvije decimale (npr. \"20,00%\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Različiti prikazi vrijednosti",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Jedna ili više klasa za traku napretka koje se mogu navesti za prilagodbu njenog izgleda.",
  "_A_PROGRESS_PROPS_DURATION_": "Ovaj prop određuje trajanje animacije trake napretka.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Omogućuje traku napretka u neodređenom načinu. Kada indeterminate ima vrijednost true, traka napretka je animirana, prikazujući kontinuirano, neodređeno kretanje.",
  "_A_PROGRESS_PROPS_MAX_": "Gornja granica, maksimalna vrijednost za traku napretka.",
  "_A_PROGRESS_PROPS_MIN_": "Donja granica, minimalna vrijednost za traku napretka.",
  "_A_PROGRESS_PROPS_REVERSE_": "Određuje treba li traka napretka biti prikazana s desna na lijevo.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Određuje treba li vrijednost napretka biti prikazana kao tekst unutar trake napretka.",
  "_A_PROGRESS_PROPS_STRIPED_": "Omogućuje prugastu traku napretka.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Omogućuje animirani prikaz prugastih traka napredovanja.",
  "_A_PROGRESS_PROPS_VALUE_": "Trenutačni napredak trake napretka.",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Određuje koji format teksta koristiti za vrijednost napretka. Ako valueTextInteger ima vrijednost true, tada se vrijednost trake napretka prikazuje kao cjelobrojni postotak. Ako je valueTextInteger false ili ga nema, vrijednost se prikazuje kao postotak s dvije decimale.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "Omogućuje prilagodbu načina na koji se prikazuje vrijednost trake napretka. Varijabli valuePercent može se pristupiti u opsegu slot-a za prikaz trenutnog postotka napretka po želji."
}