{
  "_A_INPUT_CURRENCY_COMPONENT_DESCRIPTION_": "Die Komponente <strong lang=\"en\">AInputCurrency</strong> bietet die Möglichkeit, Währungswerte einzugeben und zu formatieren. Die Komponente unterstützt verschiedene Optionen wie das Verwalten von Währungssymbolen, die Auswahl von Trennzeichen und das automatische Runden von Zahlen.",
  "_A_INPUT_CURRENCY_COMPONENT_NAME_": "Währungs-Eingabefeld",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">controls-type</strong> verwendet wird, um die Anzeige der Steuerungselemente im Eingabefeld zu konfigurieren. Im ersten Feld sind die Steuerungselemente deaktiviert, während im zweiten Feld die Tasten '+' und '-' zum Erhöhen oder Verringern des Wertes verwendet werden. Dies ermöglicht die Auswahl der am besten geeigneten Methode zur Steuerung des Wertes je nach den Anforderungen.",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_HEADER_": "Arten von Steuerungselementen",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">decimal-divider</strong> verwendet wird, um den Dezimaltrennzeichen im Eingabefeld zu konfigurieren. Im ersten Feld wird ein Komma <strong>','</strong> als Trennzeichen verwendet, während im zweiten Feld ein Punkt <strong>'.'</strong> verwendet wird. Dies ermöglicht die Auswahl des geeigneten Formats zur Anzeige von Dezimalwerten entsprechend den regionalen Einstellungen oder den Vorlieben des Benutzers. Wichtig: Das Dezimaltrennzeichen und das Tausendertrennzeichen müssen unterschiedlich sein.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_HEADER_": "Dezimaltrennzeichen",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">decimal-part-length</strong> verwendet wird, um die Anzahl der Stellen nach dem Dezimaltrennzeichen in der Komponente <strong lang=\"en\">AInputCurrency</strong> festzulegen. Im ersten Fall ist die Länge des Dezimalteils auf <strong>0</strong> eingestellt, was bedeutet, dass kein Dezimalteil angezeigt wird. Im zweiten Beispiel ist die Länge auf <strong>1</strong> eingestellt, wodurch eine Stelle nach dem Dezimalpunkt angezeigt wird. In den folgenden Beispielen ist die Länge des Dezimalteils auf <strong>2</strong> und <strong>4</strong> eingestellt, was eine genauere Anzeige von Dezimalwerten ermöglicht.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_HEADER_": "Länge des Dezimalteils",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">max</strong> und <strong lang=\"en\">min</strong> verwendet werden, um die Werte zu begrenzen, die in das Feld eingegeben werden können. Im ersten Feld ist die Eingabe auf einen Bereich von <strong>1</strong> bis <strong>20</strong> begrenzt, während sie im zweiten auf einen Bereich von <strong>-10.05</strong> bis <strong>19.05</strong> begrenzt ist. Diese Eigenschaften helfen, den zulässigen Bereich der eingegebenen Zahlen zu kontrollieren.",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_HEADER_": "Maximale und minimale Begrenzungen",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">model-type</strong> verwendet wird, um den Datentyp zu definieren, der im Modell gespeichert wird. Im ersten Fall wird der Wert als <strong lang=\"en\">number</strong> (Zahl) gespeichert, während er im zweiten Fall als <strong lang=\"en\">string</strong> (Zeichenkette) gespeichert wird. Diese Eigenschaft ermöglicht eine flexible Verwaltung des Datentyps im Modell entsprechend den Anforderungen der Anwendung.",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_HEADER_": "Modelltyp",
  "_A_INPUT_CURRENCY_GROUP_STEP_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">step</strong> verwendet wird, um den Schrittwert in der Komponente <strong lang=\"en\">AInputCurrency</strong> festzulegen. Im ersten Fall ist der Schritt auf <strong>2</strong> eingestellt, wodurch der Wert um <strong>2</strong> Einheiten pro Schritt erhöht oder verringert werden kann. Im zweiten Fall ist der Schritt auf <strong>0.01</strong> eingestellt, wodurch der Wert mit den Steuerungstasten genauer geregelt werden kann. Diese Eigenschaft ist nützlich, um die Genauigkeit der numerischen Dateneingabe zu steuern.",
  "_A_INPUT_CURRENCY_GROUP_STEP_HEADER_": "Schrittweite",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">currency-symbol</strong> und <strong lang=\"en\">currency-symbol-position</strong> verwendet werden, um das Währungssymbol im Eingabefeld anzuzeigen. Im ersten Feld wird das Symbol <strong>'%'</strong> rechts vom eingegebenen Wert angezeigt. In den zweiten und dritten Feldern wird das Symbol <strong>'$'</strong> links vom Wert angezeigt. Dies ermöglicht eine flexible Anpassung der Anzeige von Währungssymbolen je nach den Anforderungen.",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_HEADER_": "Währungssymbole und ihre Positionen",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_DESCRIPTION_": "Dieses Beispiel zeigt, wie die Eigenschaft <strong lang=\"en\">thousand-divider</strong> verwendet wird, um das Tausendertrennzeichen in der Komponente <strong lang=\"en\">AInputCurrency</strong> festzulegen. Im ersten Fall wird ein Komma <strong>','</strong> als Tausendertrennzeichen verwendet. Im zweiten Beispiel wird ein Punkt <strong>'.'</strong> als Trennzeichen verwendet. Im dritten Beispiel wird ein Leerzeichen <strong>' '</strong> als Trennzeichen verwendet, während im letzten Beispiel kein Trennzeichen vorhanden ist, sodass Zahlen ohne Tausendertrennung angezeigt werden. Wichtig: Das Dezimaltrennzeichen und das Tausendertrennzeichen müssen unterschiedlich sein.",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_HEADER_": "Tausendertrennzeichen",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">validation-on-change</strong> in der Komponente <strong lang=\"en\">AInputCurrency</strong> verwendet wird. Im ersten Beispiel wird die Validierung der Werte bei jeder Änderung nicht durchgeführt, da <strong lang=\"en\">validation-on-change</strong> auf <strong>false</strong> eingestellt ist. Im zweiten Beispiel werden bei aktivierter Option <strong lang=\"en\">validation-on-change</strong> die eingegebenen Werte sofort bei der Änderung überprüft.",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_HEADER_": "Validierung bei Änderung",
  "_A_INPUT_CURRENCY_PROPS_CONTROLS_TYPE_DESCRIPTION_": "Legt den Typ der Steuerelemente fest, die neben dem Eingabefeld angezeigt werden. Mögliche Werte: <strong lang=\"en\">plus-minus</strong> (Schaltflächen zum Erhöhen und Verringern), <strong lang=\"en\">arrows</strong> (Pfeile zum Ändern von Werten) oder <strong lang=\"en\">none</strong> (keine Steuerelemente).",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_DESCRIPTION_": "Legt das Währungssymbol fest, das im Eingabefeld angezeigt wird, wie z. B. <strong>$</strong>, <strong>€</strong> oder <strong>₽</strong>.",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_POSITION_DESCRIPTION_": "Bestimmt die Position des Währungssymbols relativ zum eingegebenen Wert. Mögliche Werte: <strong lang=\"en\">left</strong> (links vom Wert) oder <strong lang=\"en\">right</strong> (rechts vom Wert).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_DIVIDER_DESCRIPTION_": "Legt das Symbol fest, das als Dezimaltrennzeichen verwendet wird. Mögliche Werte sind <strong>.</strong> (Punkt) oder <strong>,</strong> (Komma).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_PART_LENGTH_DESCRIPTION_": "Bestimmt die Anzahl der Stellen nach dem Dezimaltrennzeichen, die im Wert angezeigt werden.",
  "_A_INPUT_CURRENCY_PROPS_INPUT_WIDTH_DESCRIPTION_": "Legt die Breite des Eingabefelds fest. Der Wert kann in Pixeln oder in Prozent angegeben werden.",
  "_A_INPUT_CURRENCY_PROPS_MAX_DESCRIPTION_": "Legt den maximalen Wert fest, der in das Feld eingegeben werden kann.",
  "_A_INPUT_CURRENCY_PROPS_MIN_DESCRIPTION_": "Legt den minimalen Wert fest, der in das Feld eingegeben werden kann.",
  "_A_INPUT_CURRENCY_PROPS_MODEL_TYPE_DESCRIPTION_": "Bestimmt den Datentyp, der im Modell gespeichert wird. Mögliche Werte sind <strong lang=\"en\">number</strong> (Zahlenwert) oder <strong lang=\"en\">string</strong> (Zeichenkettenwert).",
  "_A_INPUT_CURRENCY_PROPS_THOUSAND_DIVIDER_DESCRIPTION_": "Legt das Symbol fest, das zum Trennen von Tausenderstellen im Wert verwendet wird. Mögliche Werte sind <strong>.</strong> (Punkt), <strong>,</strong> (Komma) oder ein leerer String (kein Trennzeichen).",
  "_A_INPUT_CURRENCY_PROPS_VALIDATION_ON_CHANGE_DESCRIPTION_": "Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird bei jeder Änderung des Feldes eine Validierung des eingegebenen Wertes durchgeführt."
}