{
  "_A_INPUT_CURRENCY_COMPONENT_DESCRIPTION_": "Komponenta <strong lang=\"en\">AInputCurrency</strong> omogućuje unos i formatiranje vrijednosti valute. Komponenta podržava različite opcije poput upravljanja simbolima valute, odabira razdjelnika i automatskog zaokruživanja brojeva.",
  "_A_INPUT_CURRENCY_COMPONENT_NAME_": "Polje za unos valute",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">controls-type</strong> za konfiguriranje prikaza kontrolnih elemenata u polju za unos. U prvom polju kontrolni elementi su onemogućeni, dok se u drugom koriste tipke '+' i '-' za povećanje ili smanjenje vrijednosti. To omogućuje odabir najprikladnijeg načina za upravljanje vrijednošću ovisno o zahtjevima.",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_HEADER_": "Vrste kontrolnih elemenata",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">decimal-divider</strong> za konfiguriranje decimalnog razdjelnika u polju za unos. U prvom polju koristi se zarez <strong>','</strong> kao razdjelnik, dok se u drugom koristi točka <strong>'.'</strong>. To omogućuje odabir odgovarajućeg formata za prikaz decimalnih vrijednosti prema regionalnim postavkama ili preferencijama korisnika. Važno: Decimalni separator i tisućni separator moraju biti različiti.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_HEADER_": "Decimalni razdjelnik",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">decimal-part-length</strong> za postavljanje broja znamenki nakon decimalnog razdjelnika u komponenti <strong lang=\"en\">AInputCurrency</strong>. U prvom slučaju duljina decimalnog dijela postavljena je na <strong>0</strong>, što znači da nema prikazanog decimalnog dijela. U drugom primjeru duljina je postavljena na <strong>1</strong>, što omogućuje prikaz jedne znamenke nakon decimalne točke. U sljedećim primjerima duljina decimalnog dijela postavljena je na <strong>2</strong> i <strong>4</strong>, što omogućuje precizniji prikaz decimalnih vrijednosti.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_HEADER_": "Duljina decimalnog dijela",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">max</strong> i <strong lang=\"en\">min</strong> za ograničavanje vrijednosti koje se mogu unijeti u polje. U prvom polju unos je ograničen na raspon od <strong>1</strong> do <strong>20</strong>, dok je u drugom ograničen na raspon od <strong>-10.05</strong> do <strong>19.05</strong>. Ova svojstva pomažu u kontroli dopuštenog raspona unesenih brojeva.",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_HEADER_": "Maksimalna i minimalna ograničenja",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">model-type</strong> za definiranje vrste podataka koja će se pohraniti u modelu. U prvom slučaju vrijednost se pohranjuje kao <strong lang=\"en\">number</strong> (broj), dok se u drugom pohranjuje kao <strong lang=\"en\">string</strong> (niz). Ova svojstva omogućuju fleksibilno upravljanje vrstom podataka u modelu prema zahtjevima aplikacije.",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_HEADER_": "Vrsta modela",
  "_A_INPUT_CURRENCY_GROUP_STEP_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">step</strong> za postavljanje vrijednosti koraka u komponenti <strong lang=\"en\">AInputCurrency</strong>. U prvom slučaju korak je postavljen na <strong>2</strong>, što omogućuje povećanje ili smanjenje vrijednosti za <strong>2</strong> jedinice u jednom koraku. U drugom slučaju korak je postavljen na <strong>0.01</strong>, što omogućuje preciznije upravljanje vrijednošću pomoću kontrolnih tipki. Ova svojstva su korisna za podešavanje točnosti unosa numeričkih podataka.",
  "_A_INPUT_CURRENCY_GROUP_STEP_HEADER_": "Vrijednost koraka promjene",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">currency-symbol</strong> i <strong lang=\"en\">currency-symbol-position</strong> za prikaz simbola valute u polju za unos. U prvom polju simbol <strong>'%'</strong> prikazan je desno od unesene vrijednosti. U drugom i trećem polju simbol <strong>'$'</strong> prikazan je lijevo od vrijednosti. To omogućuje fleksibilno postavljanje prikaza simbola valute prema zahtjevima.",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_HEADER_": "Simboli valuta i njihove pozicije",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti svojstvo <strong lang=\"en\">thousand-divider</strong> za postavljanje razdjelnika tisućica u komponenti <strong lang=\"en\">AInputCurrency</strong>. U prvom slučaju kao razdjelnik tisućica koristi se zarez <strong>','</strong>. U drugom primjeru koristi se točka <strong>'.'</strong> kao razdjelnik. U trećem primjeru koristi se praznina <strong>' '</strong> kao razdjelnik, dok u zadnjem primjeru razdjelnik nije prisutan, što omogućuje prikaz brojeva bez razdvajanja tisućica. Važno: Decimalni separator i tisućni separator moraju biti različiti.",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_HEADER_": "Razdjelnik tisućica",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_DESCRIPTION_": "Ovaj primjer prikazuje kako koristiti <strong lang=\"en\">validation-on-change</strong> u komponenti <strong lang=\"en\">AInputCurrency</strong>. U prvom primjeru, validacija vrijednosti ne provodi se pri svakoj promjeni jer je <strong lang=\"en\">validation-on-change</strong> postavljen na <strong>false</strong>. U drugom primjeru, kada je <strong lang=\"en\">validation-on-change</strong> postavljen na <strong>true</strong>, unesene vrijednosti provjeravaju se odmah pri promjeni.",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_HEADER_": "Validacija pri promjeni",
  "_A_INPUT_CURRENCY_PROPS_CONTROLS_TYPE_DESCRIPTION_": "Definira vrstu kontrolnih elemenata koji će se prikazati uz polje za unos. Moguće vrijednosti: <strong lang=\"en\">plus-minus</strong> (tipke za povećanje i smanjenje), <strong lang=\"en\">arrows</strong> (strelice za promjenu vrijednosti) ili <strong lang=\"en\">none</strong> (bez kontrolnih elemenata).",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_DESCRIPTION_": "Definira simbol valute koji će se prikazati u polju za unos, kao što su <strong>$</strong>, <strong>€</strong> ili <strong>₽</strong>.",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_POSITION_DESCRIPTION_": "Određuje položaj simbola valute u odnosu na unesenu vrijednost. Moguće vrijednosti: <strong lang=\"en\">left</strong> (lijevo od vrijednosti) ili <strong lang=\"en\">right</strong> (desno od vrijednosti).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_DIVIDER_DESCRIPTION_": "Definira simbol koji će se koristiti kao decimalni razdjelnik. Moguće vrijednosti: <strong>.</strong> (točka) ili <strong>,</strong> (zarez).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_PART_LENGTH_DESCRIPTION_": "Određuje broj znamenki nakon decimalnog razdjelnika koji će biti prikazani u vrijednosti.",
  "_A_INPUT_CURRENCY_PROPS_INPUT_WIDTH_DESCRIPTION_": "Definira širinu polja za unos. Vrijednost se može navesti u pikselima ili u postotcima.",
  "_A_INPUT_CURRENCY_PROPS_INTEGER_PART_MAX_LENGTH_DESCRIPTION_": "Određuje maksimalnu duljinu cijelog broja vrijednosti, izraženu u broju znamenki.",
  "_A_INPUT_CURRENCY_PROPS_MAX_DESCRIPTION_": "Definira maksimalnu vrijednost koja se može unijeti u polje.",
  "_A_INPUT_CURRENCY_PROPS_MIN_DESCRIPTION_": "Definira minimalnu vrijednost koja se može unijeti u polje.",
  "_A_INPUT_CURRENCY_PROPS_MODEL_TYPE_DESCRIPTION_": "Definira vrstu podataka koja će se pohraniti u modelu. Moguće vrijednosti: <strong lang=\"en\">number</strong> (numerička vrijednost) ili <strong lang=\"en\">string</strong> (vrijednost niza).",
  "_A_INPUT_CURRENCY_PROPS_THOUSAND_DIVIDER_DESCRIPTION_": "Definira simbol koji se koristi za razdvajanje tisućica u vrijednosti. Moguće vrijednosti: <strong>.</strong> (točka), <strong>,</strong> (zarez) ili prazan niz (bez razdjelnika).",
  "_A_INPUT_CURRENCY_PROPS_VALIDATION_ON_CHANGE_DESCRIPTION_": "Ako je postavljeno na <strong lang=\"en\">true</strong>, validacija unesene vrijednosti provest će se pri svakoj promjeni polja."
}