{
  "_A_INPUT_CURRENCY_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">AInputCurrency</strong> offre la possibilità di inserire e formattare valori monetari. Il componente supporta diverse opzioni come la gestione dei simboli di valuta, la scelta dei separatori e l'arrotondamento automatico dei numeri.",
  "_A_INPUT_CURRENCY_COMPONENT_NAME_": "Campo di input valuta",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">controls-type</strong> per configurare la visualizzazione degli elementi di controllo nel campo di input. Nel primo campo, gli elementi di controllo sono disabilitati, mentre nel secondo vengono utilizzati i pulsanti '+' e '-' per aumentare o diminuire il valore. Questo consente di scegliere il metodo più adatto per controllare il valore in base alle esigenze.",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_HEADER_": "Tipi di elementi di controllo",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">decimal-divider</strong> per configurare il separatore decimale nel campo di input. Nel primo campo viene utilizzata una virgola <strong>','</strong> come separatore, mentre nel secondo viene utilizzato un punto <strong>'.'</strong>. Questo consente di scegliere il formato appropriato per visualizzare i valori decimali in base alle impostazioni regionali o alle preferenze dell'utente. Importante: Il separatore decimale e il separatore delle migliaia devono essere diversi.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_HEADER_": "Separatore decimale",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">decimal-part-length</strong> per definire il numero di cifre dopo il separatore decimale nel componente <strong lang=\"en\">AInputCurrency</strong>. Nel primo caso, la lunghezza della parte decimale è impostata su <strong>0</strong>, il che significa che non viene visualizzata alcuna parte decimale. Nel secondo esempio, la lunghezza è impostata su <strong>1</strong>, consentendo di visualizzare una cifra dopo il punto decimale. Nei seguenti esempi, la lunghezza della parte decimale è impostata su <strong>2</strong> e <strong>4</strong>, consentendo di visualizzare i valori decimali in modo più preciso.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_HEADER_": "Lunghezza della parte decimale",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">max</strong> e <strong lang=\"en\">min</strong> per limitare i valori che possono essere inseriti nel campo. Nel primo campo, l'input è limitato a un intervallo da <strong>1</strong> a <strong>20</strong>, mentre nel secondo è limitato a un intervallo da <strong>-10.05</strong> a <strong>19.05</strong>. Queste proprietà aiutano a controllare l'intervallo consentito di numeri inseriti.",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_HEADER_": "Limiti massimi e minimi",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">model-type</strong> per definire il tipo di dati che verranno memorizzati nel modello. Nel primo caso, il valore viene memorizzato come <strong lang=\"en\">number</strong> (numero), mentre nel secondo viene memorizzato come <strong lang=\"en\">string</strong> (stringa). Questa proprietà consente una gestione flessibile del tipo di dati nel modello in base alle esigenze dell'applicazione.",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_HEADER_": "Tipo di modello",
  "_A_INPUT_CURRENCY_GROUP_STEP_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">step</strong> per definire il valore del passo nel componente <strong lang=\"en\">AInputCurrency</strong>. Nel primo caso, il passo è impostato su <strong>2</strong>, consentendo di aumentare o diminuire il valore di <strong>2</strong> unità per volta. Nel secondo caso, il passo è impostato su <strong>0.01</strong>, consentendo un controllo più preciso del valore utilizzando i pulsanti di controllo. Questa proprietà è utile per regolare la precisione nell'inserimento dei dati numerici.",
  "_A_INPUT_CURRENCY_GROUP_STEP_HEADER_": "Valore del passo",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">currency-symbol</strong> e <strong lang=\"en\">currency-symbol-position</strong> per visualizzare il simbolo della valuta nel campo di input. Nel primo campo, il simbolo <strong>'%'</strong> viene visualizzato a destra del valore inserito. Nei secondo e terzo campi, il simbolo <strong>'$'</strong> viene visualizzato a sinistra del valore. Questo consente una configurazione flessibile della visualizzazione dei simboli di valuta in base alle esigenze.",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_HEADER_": "Simboli di valuta e loro posizioni",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_DESCRIPTION_": "Questo esempio mostra come utilizzare la proprietà <strong lang=\"en\">thousand-divider</strong> per definire il separatore delle migliaia nel componente <strong lang=\"en\">AInputCurrency</strong>. Nel primo caso, una virgola <strong>','</strong> viene utilizzata come separatore delle migliaia. Nel secondo esempio, un punto <strong>'.'</strong> viene utilizzato come separatore. Nel terzo esempio, viene utilizzato uno spazio <strong>' '</strong> come separatore, mentre nell'ultimo esempio non è presente alcun separatore, consentendo di visualizzare numeri senza separazione delle migliaia. Importante: Il separatore decimale e il separatore delle migliaia devono essere diversi.",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_HEADER_": "Separatore delle migliaia",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">validation-on-change</strong> nel componente <strong lang=\"en\">AInputCurrency</strong>. Nel primo esempio, la validazione dei valori non viene eseguita a ogni modifica, poiché <strong lang=\"en\">validation-on-change</strong> è impostato su <strong>false</strong>. Nel secondo esempio, quando <strong lang=\"en\">validation-on-change</strong> è impostato su <strong>true</strong>, i valori inseriti vengono convalidati immediatamente al momento della modifica.",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_HEADER_": "Validazione al cambiamento",
  "_A_INPUT_CURRENCY_PROPS_CONTROLS_TYPE_DESCRIPTION_": "Definisce il tipo di elementi di controllo che verranno visualizzati accanto al campo di input. Valori possibili: <strong lang=\"en\">plus-minus</strong> (pulsanti per aumentare e diminuire), <strong lang=\"en\">arrows</strong> (frecce per cambiare i valori) o <strong lang=\"en\">none</strong> (nessun elemento di controllo).",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_DESCRIPTION_": "Definisce il simbolo della valuta che verrà visualizzato nel campo di input, come <strong>$</strong>, <strong>€</strong> o <strong>₽</strong>.",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_POSITION_DESCRIPTION_": "Determina la posizione del simbolo della valuta rispetto al valore inserito. Valori possibili: <strong lang=\"en\">left</strong> (a sinistra del valore) o <strong lang=\"en\">right</strong> (a destra del valore).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_DIVIDER_DESCRIPTION_": "Definisce il simbolo che verrà utilizzato come separatore decimale. Valori possibili: <strong>.</strong> (punto) o <strong>,</strong> (virgola).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_PART_LENGTH_DESCRIPTION_": "Determina il numero di cifre dopo il separatore decimale che verranno visualizzate nel valore.",
  "_A_INPUT_CURRENCY_PROPS_INPUT_WIDTH_DESCRIPTION_": "Definisce la larghezza del campo di input. Il valore può essere specificato in pixel o in percentuale.",
  "_A_INPUT_CURRENCY_PROPS_INTEGER_PART_MAX_LENGTH_DESCRIPTION_": "Definisce la lunghezza massima della parte intera del valore, espressa in numero di cifre.",
  "_A_INPUT_CURRENCY_PROPS_MAX_DESCRIPTION_": "Definisce il valore massimo che può essere inserito nel campo.",
  "_A_INPUT_CURRENCY_PROPS_MIN_DESCRIPTION_": "Definisce il valore minimo che può essere inserito nel campo.",
  "_A_INPUT_CURRENCY_PROPS_MODEL_TYPE_DESCRIPTION_": "Definisce il tipo di dati che verrà memorizzato nel modello. Valori possibili: <strong lang=\"en\">number</strong> (valore numerico) o <strong lang=\"en\">string</strong> (valore stringa).",
  "_A_INPUT_CURRENCY_PROPS_THOUSAND_DIVIDER_DESCRIPTION_": "Definisce il simbolo utilizzato per separare le migliaia nel valore. Valori possibili: <strong>.</strong> (punto), <strong>,</strong> (virgola) o una stringa vuota (nessun separatore).",
  "_A_INPUT_CURRENCY_PROPS_VALIDATION_ON_CHANGE_DESCRIPTION_": "Se impostato su <strong lang=\"en\">true</strong>, la validazione del valore inserito verrà eseguita a ogni modifica del campo."
}