{
  "_A_WIZARD_BTN_ADD_STEP_": "Dodaj korak",
  "_A_WIZARD_BTN_DELETE_STEP_": "Ukloni korak",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Čarobnjak je sekvencijalno sučelje dizajnirano za vođenje korisnika kroz kompleksne zadatke ili procese korak po korak, razbijajući ih na jednostavnije cjeline. Uključuje jasne upute i obično pruža korisnicima mogućnost navigacije naprijed i natrag radi učinkovitog korisničkog iskustva.",
  "_A_WIZARD_COMPONENT_NAME_": "Čarobnjak",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Funkcija odgovorna za vraćanje korisnika na prethodni korak čarobnjaka i svaku dodatnu logiku relevantnu za prijelaz.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Funkcija odgovorna za premještanje korisnika na sljedeći korak čarobnjaka i svaku dodatnu logiku relevantnu za prijelaz.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Navigacijski gumbi omogućuju korisnicima kretanje naprijed ili natrag kroz korake čarobnjaka. Mogu se potpuno prilagoditi korištenjem navedenih propova.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Alternativni način navigacije kroz čarobnjak je izravno odabiranje koraka u zaglavlju, umjesto da se oslanja isključivo na gumbe za kretanje naprijed i natrag. Oba načina kretanja, naprijed ili natrag, i koraci u pregledu mogu se onemogućiti prema potrebi.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Onemogućavanje navigacijskih gumba",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Navigacijski gumbi",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "Vidljivost oba navigacijska gumba može se kontrolirati zasebno, uključujući vidljivost u prvom i posljednjem koraku, respektivno.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Skrivanje navigacijskih gumba",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "Demonstracijski primjer uporabe komponente <strong lang=\"en\">AWizard</strong>.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Demonstracijski prikaz",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "Pri prijelazu na drugi korak iz trenutnog u čarobnjaku, skok fokusa može se koristiti za usmjeravanje korisnika na relevantan sadržaj, za razliku od zadržavanja fokusa na gumbu za navigaciju s kojom je korisnik imao posljednju interakciju.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Skok fokusa",
  "_A_WIZARD_GROUP_ICON_DESCRIPTION_": "Ovaj primjer prikazuje različite vrste čarobnjaka gdje se koriste ikone ili brojevi za prikazivanje koraka.",
  "_A_WIZARD_GROUP_ICON_HEADER_": "Primjer s ikonama",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "Komponenta <strong lang=\"en\">AWizard</strong> omogućuje prikaz indikatora učitavanja unutar navigacijskih gumba. To može biti korisno za naznaku da se određena radnja obavlja u pozadini i da korisnik treba pričekati za završetak koraka.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Indikator učitavanja",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Eksterna navigacija koraka uključuje dinamičku kontrolu procesa čarobnjaka pomoću eksternih varijabli ili prilagođene logike, omogućujući napredak kroz korake prilagođen različitim potrebama i čimbenicima.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Eksterna navigacija koraka",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Brojevi se mogu sekvencijalno dodati koracima radi jasnoće redoslijeda koraka.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Numeracija koraka",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Poravnanje koraka u zaglavlju čarobnjaka može se prilagoditi da bude lijevo ili obostrano. Obostranim poravnanjem, oba ruba zaglavlja s koracima usklađena su s rubovima čarobnjaka, a koraci su ravnomjerno raspoređeni dostupnom širinom, neovisno o ukupnom broju koraka.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Obostrano poravnanje koraka",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "Položaj alatne trake s navigacijskim gumbima može se prilagoditi korištenjem jednog od dva propa. Podržane pozicije su vrh i dno.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Položaj alatne trake s navigacijskim gumbima",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Jedinstveni identifikacijski ključ za svaki korak. Koristi se za poboljšanje performansi. Ovo je ključ za svaki od objekata u prop <strong lang=\"en\">steps</strong>. Vrijednost ovog ključa bit će pronađena u objektu i korištena kao <strong lang=\"en\">key</strong> u petlji. Ako <strong lang=\"en\">key-id</strong> nije naveden, u petlji će se koristiti <strong lang=\"en\">index</strong>.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Jedinstveni identifikacijski ključ",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Prikazivanje samo aktivnog koraka ili svih koraka u čarobnjaku može se prilagoditi prema dizajnerskim odabirima, prostoru ekrana i prioritetima korisničkog iskustva.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Prikaz samo trenutno aktivnog koraka (prikaz na mobilnom uređaju)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "Slot <strong lang=\"en\">step</strong> može se definirati kako bi se prilagodio sadržaj unutar koraka čarobnjaka.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Prilagođeni sadržaj unutar jednog koraka",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "Slot <strong lang=\"en\">stepLabel</strong> može se koristiti za prilagodbu naziva svakog od koraka u zaglavlju čarobnjaka.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Prilagođeni nazivi koraka u zaglavlju",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "Slot <strong lang=\"en\">toolbar</strong> može se koristiti za prilagodbu alatne trake s kontrolama za navigaciju. Na primjer, može se dodati još jedan gumb.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Prilagođena alatna traka za navigaciju",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "Cijeli broj koji odgovara indeksu (počevši od 0) može se proslijediti kao prop kako bi se zadao početno aktivan korak u čarobnjaku.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Aktivan korak",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Svaki korak čarobnjaka može sadržavati logički atribut \"error\". Za vrijednost true, odgovarajući korak bit će istaknut kao pogrešan.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Greška koraka",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Svaki korak čarobnjaka može sadržavati logički atribut \"warning\". Za vrijednost true, odgovarajući korak bit će istaknut kao sumnjiv. To je korisno kada se sugerira da nešto u koraku odstupa od norme, bez nužnog ukazivanja na pogrešku.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Upozorenje koraka",
  "_A_WIZARD_GROUP_SUB_TYPE_DESCRIPTION_": "Ovi primjeri pokazuju kako koristiti različite podtipove za promjenu izgleda aktivnih koraka prilikom korištenja tipa <strong lang=\"en\">line</strong>.",
  "_A_WIZARD_GROUP_SUB_TYPE_HEADER_": "Podtipovi za tip <strong lang=\"en\">line</strong>",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Omogućuje odabir vizualnog prikaza koraka u zaglavlju. Pregled svih koraka prikazuje se na vrhu čarobnjaka. Prihvaćene vrijednosti su: <strong lang=\"en\">basic</strong>, <strong lang=\"en\">arrows</strong>, <strong lang=\"en\">line</strong> i <strong lang=\"en\">round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Tip",
  "_A_WIZARD_LABEL_STEPS_": "Koraci",
  "_A_WIZARD_LABEL_TYPE_": "Tip",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Prethodni",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Sljedeći",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "Prevodljiva ARIA oznaka glavnog elementa čarobnjaka",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "Prevodljiva ARIA oznaka bloka koji sadrži sve korake čarobnjaka",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Dodatni atributi za gumb natrag, a koji nisu eksplicitno definirani kao svojstva.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Jedna ili više dodatnih CSS klasa za gumb natrag.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Naziv ikone koja će se prikazati s lijeve strane oznake za gumb natrag.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Naziv ikone koja će se prikazati s desne strane oznake za gumb natrag.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Prilagođeni naziv za gumb natrag.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Prilagođeni naslov (tekst oblačića) za gumb natrag.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Dodatne vrijednosti koje se koriste u čarobnjaku.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Dodatni atributi za gumb naprijed, a koji nisu eksplicitno definirani kao svojstva.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Jedna ili više dodatnih CSS klasa za gumb naprijed.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Naziv ikone koja će se prikazati s lijeve strane oznake za gumb naprijed.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Naziv ikone koja će se prikazati s desne strane oznake za gumb naprijed.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Prilagođeni naziv za gumb naprijed.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Prilagođeni naslov (tekst oblačića) za gumb naprijed.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Koristi li se skok fokusa prilikom prijelaza na sljedeći korak u čarobnjaku.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Određuje jedinstveni ID čarobnjaka.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Određuje treba li gumb natrag biti onemogućen.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Određuje treba li gumb natrag biti skriven.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Određuje treba li gumb natrag biti skriven u prvom koraku čarobnjaka.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Određuje treba li prijelaz na jedan od prethodnih koraka klikom na njega u zaglavlju biti onemogućen.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Određuje je li gumbi u navigacijskoj traci učitavanju.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Određuje koristi li se eksterna logika za navigaciju koraka u čarobnjaku.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Određuje treba li gumb naprijed biti onemogućen.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Određuje treba li gumb naprijed biti skriven.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Određuje treba li gumb naprijed biti skriven u posljednjem koraku čarobnjaka.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Određuje treba li prijelaz na jedan od sljedećih koraka klikom na njega u zaglavlju biti onemogućen.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Prikazuje li se čarobnjak na mobilnom uređaju ili ne.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Određuje treba li koraci biti sekvencijalno numerirani u zaglavlju koraka.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Određuje treba li poravnanje koraka u zaglavlju biti obostrano ili lijevo. ",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Određuje treba li alatna traka s navigacijskim gumbima čarobnjaka biti smještena na dnu, ispod sadržaja trenutno aktivnog koraka. To je zadana pozicija, ako drukčije nije definirano.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Određuje treba li alatna traka s navigacijskim gumbima čarobnjaka biti smještena na vrhu, iznad sadržaja trenutno aktivnog koraka.",
  "_A_WIZARD_PROPS_KEY_ID_DESCRIPTION_": "Jedinstveni identifikacijski ključ za svaki korak. Koristi se za poboljšanje performansi.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Prikazuje li se samo trenutno aktivan korak u čarobnjaku.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Indeks trenutno aktivnog koraka u čarobnjaku.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Ikona koja će se prikazati u slučaju pogreške u nekom od koraka.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Tekst i naslov za čitač zaslona za ikonu pogreške.",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Ikona koja će se prikazati u slučaju upozorenja u koraku.",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Tekst i naslov za čitač zaslona za ikonu upozorenja.",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Tekst koji označava napredak korisnika unutar čarobnjaka. Dostupne varijable su <strong lang=\"en\">stepActive</strong> (trenutno aktivan korak), <strong lang=\"en\">stepsCount</strong> (ukupan broj koraka) i <strong lang=\"en\">stepActiveLabel</strong> (naziv trenutno aktivnog koraka).",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Niz objekata koji sadrže informacije o svakom koraku u čarobnjaku.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Predstavlja objekt gdje svaki ključ odgovara indeksu koraka, a povezana logička vrijednost označuje je li odgovarajući korak već posjećen ili ne.",
  "_A_WIZARD_PROPS_SUB_TYPE_DESCRIPTION_": "Svojstvo <strong lang=\"en\">sub-type</strong> koristi se za definiranje stila aktivnih koraka za linijski tip (<strong lang=\"en\">line</strong>). Omogućuje odabir između kvadratnih i okruglih oblika, s dodatnom obrubom ili bez njega.",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "Id za teleportaciju (dinamičko kretanje) navigacijske trake na dno čarobnjaka.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Prilagođava vizualni prikaz koraka u zaglavlju.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Slot koji sadrži korak u čarobnjaku.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Slot koji sadrži oznake koraka u zaglavlju čarobnjaka.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Slot koji sadrži alatnu traku s navigacijskim gumbima.",
  "_A_WIZARD_STEP_1_": "Korak 1",
  "_A_WIZARD_STEP_2_": "Korak 2",
  "_A_WIZARD_STEP_3_": "Korak 3",
  "_A_WIZARD_STEP_4_": "Korak 4",
  "_A_WIZARD_STEP_NAME_": "Naziv koraka",
  "_A_WIZARD_TYPE_ARROWS_": "Strelica",
  "_A_WIZARD_TYPE_BASIC_": "Osnovni",
  "_A_WIZARD_TYPE_LINE_": "Linija",
  "_A_WIZARD_TYPE_ROUND_": "Okrugli"
}
