{
  "_A_WIZARD_BTN_ADD_STEP_": "Добавить шаг",
  "_A_WIZARD_BTN_DELETE_STEP_": "Удалить шаг",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Мастер - это последовательный пошаговый интерфейс пользователя, предназначенный для проведения пользователей через сложные задачи или процессы, разбивая их на более мелкие шаги. Мастер содержит четкие инструкции и часто предоставляет пользователям возможность переходить вперед и назад, чтобы обеспечить эффективный и простой пользовательский опыт.",
  "_A_WIZARD_COMPONENT_NAME_": "Мастер",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Функция, отвечающая за перемещение пользователя на предыдущий шаг мастера, а также все дополнительные логические переходы.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Функция, отвечающая за перемещение пользователя на следующий шаг мастера, а также все дополнительные логические переходы.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Кнопки навигации позволяют пользователям переходить вперед или назад по шагам мастера. Их можно полностью настроить, используя перечисленные свойства.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Альтернативный способ навигации по мастеру - это выбор шага непосредственно в заголовке, а не полагаться исключительно на кнопки вперед и назад. Оба метода навигации могут быть отключены при необходимости.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Отключение кнопок навигации",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Кнопки навигации",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "Видимость обеих кнопок навигации можно контролировать отдельно, включая видимость на первом и последнем шаге.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Скрытие кнопок навигации",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "Демонстрационный пример компонента <strong lang=\"en\">AWizard</strong>.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Демонстрационный пример",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "При переходе к другому шагу в мастере можно использовать изменение фокуса, чтобы направить пользователя к соответствующему источнику контента, а не оставлять фокус на кнопке навигации.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Смена фокуса",
  "_A_WIZARD_GROUP_ICON_DESCRIPTION_": "В этом примере представлены различные типы мастера, где используются иконки или цифры для обозначения шагов.",
  "_A_WIZARD_GROUP_ICON_HEADER_": "Пример с иконками",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "Компонент <strong lang=\"en\">AWizard</strong> позволяет отображать индикатор загрузки внутри кнопок навигации. Это может быть полезно для указания, что определенная операция выполняется в фоновом режиме и пользователю нужно подождать завершения шага.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Индикатор загрузки",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Внешняя навигация по шагам включает динамическое управление многошаговым процессом мастера с использованием внешних переменных или пользовательской логики, что позволяет настроить прогрессию по шагам в зависимости от различных потребностей и факторов.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Внешняя навигация по шагам",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Номера могут быть присвоены шагам последовательно, чтобы четко обозначить порядок выполнения.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Нумерация шагов",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Выравнивание шагов в заголовке мастера можно настроить так, чтобы они были выровнены по левому краю или по ширине. При выравнивании по ширине обе границы заголовка совпадают с границами мастера, а шаги равномерно распределяются по доступной ширине, независимо от общего количества шагов.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Выравнивание шагов по ширине",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "Положение панели инструментов с кнопками навигации можно настроить, используя одно из двух свойств. Поддерживаемые позиции - верх и низ.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Позиционирование панели инструментов навигации",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Уникальный ключ идентификатора для каждого шага. Используется для повышения производительности. Это ключ для каждого из объектов в свойстве <strong lang=\"en\">steps</strong>. Значение этого ключа будет найдено в объекте и использовано в качестве <strong lang=\"en\">key</strong> в цикле. Если <strong lang=\"en\">key-id</strong> не задан, то будет использоваться <strong lang=\"en\">index</strong> в цикле.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Уникальный ключ идентификатора",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Можно настроить, основываясь на дизайнерских решениях, доступном месте на экране и приоритетах пользовательского опыта, будет ли отображаться только активный шаг или все шаги в мастере.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Показывать только активный шаг (мобильный)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "Можно определить слот <strong lang=\"en\">step</strong>, чтобы настроить содержимое на шаге мастера. Слот может использоваться одним или несколькими шагами.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Пользовательское содержимое на шаге",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "Можно использовать слот <strong lang=\"en\">stepLabel</strong>, чтобы настроить название каждого шага в заголовке мастера.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Пользовательские названия в заголовке",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "Можно использовать слот <strong lang=\"en\">toolbar</strong>, чтобы настроить панель инструментов с элементами управления навигацией. Например, можно добавить дополнительную кнопку.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Пользовательская панель инструментов навигации",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "Можно указать число, соответствующее индексу (начиная с 0), чтобы установить начальный активный шаг в мастере.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Активный шаг",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Каждый шаг мастера может содержать логическое свойство \"ошибка\". При значении true соответствующий шаг выделяется как ошибочный.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Ошибка шага",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Каждый шаг мастера может содержать логическое свойство \"предупреждение\". При значении true соответствующий шаг выделяется как шаг с предупреждением. Это полезно для указания, что что-то на шаге может отличаться от нормы, не указывая напрямую на ошибку.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Предупреждение шага",
  "_A_WIZARD_GROUP_SUB_TYPE_DESCRIPTION_": "Эти примеры показывают, как можно использовать различные подтипы для изменения внешнего вида активных шагов при использовании типа <strong lang=\"en\">line</strong>.",
  "_A_WIZARD_GROUP_SUB_TYPE_HEADER_": "Подтипы для типа <strong lang=\"en\">line</strong>",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Позволяет выбрать визуальное представление шагов в заголовке. Обзор всех шагов отображается в верхней части мастера. Поддерживаются следующие значения: <strong lang=\"en\">basic</strong>, <strong lang=\"en\">arrows</strong>, <strong lang=\"en\">line</strong> и <strong lang=\"en\">round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Тип",
  "_A_WIZARD_LABEL_STEPS_": "Шаги",
  "_A_WIZARD_LABEL_TYPE_": "Тип",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Назад",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Далее",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "Переводимый aria-label для основного элемента мастера",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "Переводимый aria-label для блока со всеми шагами мастера",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Дополнительные атрибуты для кнопки, которая перемещает на предыдущий шаг и не определены явно как свойства.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Один или несколько дополнительных классов CSS для кнопки, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Имя значка, который отображается слева от названия кнопки, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Имя значка, который отображается справа от названия кнопки, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Пользовательское название для кнопки, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Пользовательский заголовок для кнопки, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_CLASS_EXTRA_DESCRIPTION_": "Дополнительный <strong lang=\"en\">CSS</strong>-класс для мастера, который может использоваться для автоматизированных тестов или в качестве дополнительного селектора.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Дополнительные значения, используемые в мастере.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Дополнительные атрибуты для кнопки, которая перемещает на следующий шаг и не определены явно как свойства.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Один или несколько дополнительных классов CSS для кнопки, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Имя значка, который отображается слева от названия кнопки, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Имя значка, который отображается справа от названия кнопки, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Пользовательское название для кнопки, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Пользовательский заголовок для кнопки, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Используется ли смена фокуса при переходе на другой шаг в мастере.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Указывает уникальный идентификатор мастера.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Определяет, должна ли быть отключена кнопка, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Определяет, должна ли быть скрыта кнопка, которая перемещает на предыдущий шаг.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Определяет, должна ли быть скрыта кнопка, которая перемещает на предыдущий шаг, на первом шаге мастера.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Определяет, должно ли быть отключено перемещение к любому из предыдущих шагов, нажимая на них в заголовке.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Определяет, должны ли кнопки на панели навигации отображаться с индикатором загрузки.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Определяет, должна ли использоваться внешняя логика для навигации по шагам в мастере.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Определяет, должна ли быть отключена кнопка, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Определяет, должна ли быть скрыта кнопка, которая перемещает на следующий шаг.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Определяет, должна ли быть скрыта кнопка, которая перемещает на следующий шаг, на последнем шаге мастера.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Определяет, должно ли быть отключено перемещение к любому из следующих шагов, нажимая на них в заголовке.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Отображается ли мастер на мобильном устройстве или нет.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Определяет, должны ли шаги в заголовке быть пронумерованы последовательно.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Определяет, выровнены ли шаги.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Определяет, должна ли панель навигации мастера быть внизу, под содержимым текущего активного шага. Это размещение по умолчанию.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Определяет, должна ли панель навигации мастера быть наверху, над содержимым текущего активного шага.",
  "_A_WIZARD_PROPS_KEY_ID_DESCRIPTION_": "Уникальный ключ идентификатора для каждого шага. Используется для повышения производительности.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Отображает только текущий активный шаг в мастере.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Индекс текущего активного шага в мастере.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Иконка, отображаемая в случае ошибки на шаге",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Текст и заголовок для скринридера для иконки ошибки",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Иконка, отображаемая в случае предупреждения на шаге",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Текст и заголовок для скринридера для иконки предупреждения",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Текст, указывающий на прогресс пользователя в мастере. Переменные, доступные в плейсхолдере, включают <strong lang=\"en\">stepActive</strong> (текущий активный шаг), <strong lang=\"en\">stepsCount</strong> (общее количество шагов) и <strong lang=\"en\">stepActiveLabel</strong> (метка текущего активного шага).",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Массив объектов с информацией о каждом шаге в мастере.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Представляет объект, где каждый ключ соответствует индексу шага, а связанное логическое значение указывает, был ли посещен соответствующий шаг.",
  "_A_WIZARD_PROPS_SUB_TYPE_DESCRIPTION_": "Свойство <strong lang=\"en\">sub-type</strong> используется для определения стиля активных шагов в типе <strong lang=\"en\">line</strong>. Оно позволяет выбирать между квадратными и круглыми формами, с дополнительной рамкой или без неё.",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "Идентификатор для переноса панели навигации в нижнюю часть мастера.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Настраивает визуальное представление шагов в заголовке.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Слот, содержащий шаг в мастере.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Слот, содержащий названия шагов в заголовке мастера.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Слот, содержащий панель навигации с кнопками.",
  "_A_WIZARD_STEP_1_": "Шаг 1",
  "_A_WIZARD_STEP_2_": "Шаг 2",
  "_A_WIZARD_STEP_3_": "Шаг 3",
  "_A_WIZARD_STEP_4_": "Шаг 4",
  "_A_WIZARD_STEP_NAME_": "Название шага",
  "_A_WIZARD_TYPE_ARROWS_": "Стрелка",
  "_A_WIZARD_TYPE_BASIC_": "Основной",
  "_A_WIZARD_TYPE_LINE_": "Линейный",
  "_A_WIZARD_TYPE_ROUND_": "Круглый"
}