{
  "_A_CHECKBOX_COMPONENT_DESCRIPTION_": "Komponenta <strong lang=\"en\">ACheckbox</strong> pruža sučelje za stvaranje grupe potvrdnih okvira, omogućujući korisnicima da odaberu više opcija s popisa. Komponenta podržava različite postavke kao što su grupe koje se mogu skladištiti, prikaz gumba, funkcionalnost pretraživanja i mnoge druge.",
  "_A_CHECKBOX_COMPONENT_NAME_": "Potvrdni okviri",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Kada je ova opcija omogućena, prikazat će se dodatni kontrolni potvrdni okvir. Ovaj kontrolni potvrdni okvir omogućuje korisniku da odabere ili poništi sve potvrdne okvire odjednom.",
  "_A_CHECKBOX_GROUP_HAS_CONTROL_CHECKBOX_HEADER_": "Kontrolni potvrdni okvir",
  "_A_CHECKBOX_PROPS_COLLAPSIBLE_DESCRIPTION_": "Određuje može li se grupa potvrdnih okvira sažeti i proširiti. Ako je postavljeno na <strong lang=\"en\">true</strong>, korisnik može prebaciti grupu.",
  "_A_CHECKBOX_PROPS_HAS_CONTROL_CHECKBOX_DESCRIPTION_": "Dodaje kontrolni potvrdni okvir koji omogućuje odabir ili poništavanje svih potvrdnih okvira u grupi odjednom.",
  "_A_CHECKBOX_PROPS_INLINE_DESCRIPTION_": "Određuje treba li potvrdne okvire prikazati u redu. Ako je postavljeno na <strong lang=\"en\">true</strong>, potvrdni okviri će biti poravnati vodoravno.",
  "_A_CHECKBOX_PROPS_IS_BUTTON_GROUP_DESCRIPTION_": "Određuje treba li potvrdne okvire prikazati kao gumbe. Ako je postavljeno na <strong lang=\"en\">true</strong>, potvrdni okviri će se prikazati kao gumbi, što može pružiti vizualno privlačnije sučelje.",
  "_A_CHECKBOX_PROPS_IS_COLLAPSED_DESCRIPTION_": "Određuje početno stanje sažetka grupe potvrdnih okvira. Ako je postavljeno na <strong lang=\"en\">true</strong>, grupa će biti sažeta pri učitavanju stranice.",
  "_A_CHECKBOX_PROPS_IS_WIDTH_AUTO_DESCRIPTION_": "Određuje hoće li se širina grupe potvrdnih okvira automatski prilagoditi njenom sadržaju. Ako je postavljeno na <strong lang=\"en\">true</strong>, širina će se automatski prilagoditi.",
  "_A_CHECKBOX_PROPS_TEXTS_DESCRIPTION_": "Omogućuje izmjenu tekstualnih poruka za razne radnje u komponenti. Uključuje tekstove za sažimanje/proširivanje (<strong lang=\"en\">collapseClose</strong> i <strong lang=\"en\">collapseOpen</strong>), poruke kada nema elemenata tijekom pretraživanja (<strong lang=\"en\">notElementsWithSearch</strong>), i tekst za polje za pretraživanje (<strong lang=\"en\">search</strong>)."
}