{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "The ALinkCopy component is a Vue.js component that provides a user interface to present a link and offers a button to copy the link text to the clipboard. This allows for easy and convenient sharing of URLs or other references by the users of your application. By clicking on the \"Copy to clipboard\" button, the text of the link is copied to the user's clipboard for quick and easy sharing.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Copy Link",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "In this example, it is shown how the component can be used to customize the button that serves to copy the link. The <strong>button-options</strong> prop allows defining properties and HTML attributes for the button using the <a href='/#/button'>AButton</a> component.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Customizing the Button",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "The position of the button in the component can be adjusted with the <strong>button-position</strong> prop.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Button Position",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "In this example, the option to adjust the default grouping class <strong>class-default</strong> in the component is demonstrated. This class is typically used to style the outer grouping of the component. You can overwrite the default class as needed or leave it blank if you don't want to use the default grouping.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Customizing the Default Grouping Class in the Component",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "In this example, the use of the component with various CSS classes to customize its appearance is illustrated.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "CSS Classes",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "In this example, it's shown how the component can be used to disable both the link and the associated button. Disabling ensures that the link can no longer be clicked and the button can't be triggered.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Disabling Link and Button",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "In this example, it's demonstrated how the component can be used in conjunction with the <a href='/#/link'>ALink</a> component to set up links flexibly and copy their text to the clipboard. The <a href='/#/link'>ALink</a> component is used to create and define the link itself.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Customizing the Link",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "The 'button' slot allows you to define the text of the button according to your own ideas. The content of the 'button' slot is passed to the contained <a href='/#/button'>AButton</a> component.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Customizing the Button with the 'button' Slot",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "In this example, it's shown how you can customize the text of the link in the component using the 'link' slot. The content of the 'link' slot is passed to the contained <a href='/#/link'>ALink</a> component.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Customizing the Link with the 'link' Slot",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "In this example, it's shown how the component can be used to copy custom text instead of the default link text. The <strong>text-copy</strong> prop allows you to specify the text to be copied.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Copying Custom Text",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Define properties and HTML attributes for the button using the <a href='/#/button'>AButton</a> component.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Position of the button. You can use either <strong>right</strong> or <strong>left</strong>.",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "The default CSS class for the outer grouping",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "CSS Classes",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Disabling the component",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "The appearance and behavior of the link by defining all the properties and HTML attributes used within <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "The text that should be copied in place of the default link text.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "The text of the button. The content of this slot is forwarded as button text to the <a href='/#/button'>AButton</a> component.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "The text of the link. The content of this slot is forwarded as link text to the <a href='/#/link'>ALink</a> component."
}
