{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "El componente ALinkCopy es un componente de Vue.js que ofrece una interfaz de usuario para presentar un enlace y proporciona un botón para copiar el texto del enlace al portapapeles. Esto permite compartir de manera fácil y conveniente URLs u otras referencias por los usuarios de tu aplicación. Al hacer clic en el botón \"Copiar al portapapeles\", el texto del enlace se copia en el portapapeles del usuario para compartirlo rápidamente.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Copiar Enlace",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "En este ejemplo, se muestra cómo se puede usar el componente para personalizar el botón que sirve para copiar el enlace. La propiedad <strong>button-options</strong> permite definir propiedades y atributos HTML para el botón que utiliza el componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Personalización del Botón",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "La posición del botón en el componente se puede ajustar con la propiedad <strong>button-position</strong>.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Posición del Botón",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "En este ejemplo, se muestra la opción de ajustar la clase de agrupación por defecto <strong>class-default</strong> en el componente. Esta clase generalmente se usa para dar estilo al agrupamiento externo del componente. Puedes sobrescribir la clase por defecto según sea necesario o dejarla en blanco si no deseas usar la agrupación por defecto.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Personalización de la Clase de Agrupación Estándar en el Componente",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "En este ejemplo, se ilustra el uso del componente con varias clases CSS para personalizar su apariencia.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "Clases CSS",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "En este ejemplo, se muestra cómo se puede usar el componente para desactivar tanto el enlace como el botón asociado. Al desactivarlos, se asegura que el enlace ya no se pueda hacer clic y que el botón no pueda ser activado.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Desactivar Enlace y Botón",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "En este ejemplo, se demuestra cómo se puede usar el componente junto con el componente <a href='/#/link'>ALink</a> para configurar enlaces de manera flexible y copiar su texto al portapapeles. El componente <a href='/#/link'>ALink</a> se usa para crear y definir el enlace en sí.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Personalización del Enlace",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "El espacio 'button' te permite definir el texto del botón según tus propias ideas. El contenido del espacio 'button' se pasa al componente <a href='/#/button'>AButton</a> contenido.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Personalización del Botón con el espacio 'button'",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "En este ejemplo, se muestra cómo puedes personalizar el texto del enlace en el componente usando el espacio 'link'. El contenido del espacio 'link' se pasa al componente <a href='/#/link'>ALink</a> contenido.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Personalización del Enlace con el espacio 'link'",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "En este ejemplo, se muestra cómo se puede usar el componente para copiar un texto personalizado en lugar del texto de enlace por defecto. La propiedad <strong>text-copy</strong> te permite especificar el texto a copiar.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Copiar Texto Personalizado",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Definir propiedades y atributos HTML para el botón que utiliza el componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Posición del botón. Puedes usar <strong>right</strong> (derecha) o <strong>left</strong> (izquierda).",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "La clase CSS estándar para el agrupamiento externo",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "Clases CSS",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Desactivación del componente",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "La apariencia y comportamiento del enlace al definir todas las propiedades y atributos HTML usados dentro de <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "El texto que debe ser copiado en lugar del texto de enlace por defecto.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "El texto del botón. El contenido de este espacio se envía como texto del botón al componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "El texto del enlace. El contenido de este espacio se envía como texto del enlace al componente <a href='/#/link'>ALink</a>."
}
