{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "Il componente ALinkCopy è un componente di Vue.js che fornisce un'interfaccia utente per presentare un link e offre un pulsante per copiare il testo del link negli appunti. Ciò permette una condivisione semplice e pratica di URL o altri riferimenti da parte degli utenti della tua applicazione. Cliccando sul pulsante \"Copia negli appunti\", il testo del link viene copiato negli appunti dell'utente per una condivisione veloce.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Copia Link",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "In questo esempio, viene mostrato come il componente può essere utilizzato per personalizzare il pulsante utilizzato per copiare il link. La prop <strong>button-options</strong> consente di definire proprietà e attributi HTML per il pulsante che usa il componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Personalizzazione del Pulsante",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "La posizione del pulsante nel componente può essere regolata con la prop <strong>button-position</strong>.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Posizione del Pulsante",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "In questo esempio viene mostrato come si può personalizzare la classe di raggruppamento predefinita <strong>class-default</strong> nel componente. Questa classe viene normalmente utilizzata per stilizzare l'aggregazione esterna del componente. Puoi sovrascrivere la classe predefinita come necessario o lasciarla vuota se non desideri utilizzare l'aggregazione predefinita.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Personalizzazione della Classe di Raggruppamento Predefinita nel Componente",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "In questo esempio viene illustrato l'uso del componente con diverse classi CSS per personalizzare il suo aspetto.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "Classi CSS",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "In questo esempio viene mostrato come si può utilizzare il componente per disabilitare sia il link che il pulsante associato. Disabilitandoli, si impedisce che il link possa essere cliccato e che il pulsante possa essere attivato.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Disabilita Link e Pulsante",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "In questo esempio viene mostrato come il componente può essere utilizzato insieme al componente <a href='/#/link'>ALink</a> per configurare i link in modo flessibile e copiare il loro testo negli appunti. Il componente <a href='/#/link'>ALink</a> viene utilizzato per creare e definire il link stesso.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Personalizzazione del Link",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "Lo slot 'button' ti permette di definire il testo del pulsante secondo le tue preferenze. Il contenuto dello slot 'button' viene passato al componente <a href='/#/button'>AButton</a> contenuto.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Personalizzazione del Pulsante con lo slot 'button'",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "In questo esempio viene mostrato come puoi personalizzare il testo del link nel componente utilizzando lo slot 'link'. Il contenuto dello slot 'link' viene passato al componente <a href='/#/link'>ALink</a> contenuto.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Personalizzazione del Link con lo slot 'link'",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "In questo esempio viene mostrato come si può utilizzare il componente per copiare un testo personalizzato invece del testo del link predefinito. La prop <strong>text-copy</strong> ti permette di specificare il testo da copiare.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Copia Testo Personalizzato",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Definisci proprietà e attributi HTML per il pulsante che utilizza il componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Posizione del pulsante. Puoi usare <strong>right</strong> (destra) o <strong>left</strong> (sinistra).",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "La classe CSS predefinita per l'aggregazione esterna",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "Classi CSS",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Disabilitazione del componente",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "La rappresentazione e il comportamento del link, definendo tutte le proprietà e gli attributi HTML utilizzati in <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "Il testo da copiare al posto del testo del link predefinito.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "Il testo del pulsante. Il contenuto di questo slot viene inviato come testo del pulsante al componente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "Il testo del link. Il contenuto di questo slot viene inviato come testo del link al componente <a href='/#/link'>ALink</a>."
}
