{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "Компонент ALinkCopy - это компонент Vue.js, предоставляющий пользовательский интерфейс для отображения ссылки и предоставляющий кнопку для копирования текста ссылки в буфер обмена. Это позволяет пользователям вашего приложения легко и удобно обмениваться URL-адресами или другими ссылками. При нажатии кнопки \"Копировать в буфер обмена\" текст ссылки копируется в буфер обмена пользователя, чтобы можно было быстро и легко поделиться им.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Копировать ссылку",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "В этом примере показано, как использовать компонент для настройки кнопки, предназначенной для копирования ссылки. Свойство <strong>button-options</strong> позволяет устанавливать параметры и атрибуты HTML для кнопки, использующей компонент <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Настройка кнопки",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "Положение кнопки в компоненте можно регулировать с помощью свойства <strong>button-position</strong>.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Положение кнопки",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "В этом примере показано, как можно настроить стандартный класс группировки <strong>class-default</strong> в компоненте. Этот класс обычно используется для стилизации внешней группировки компонента. Вы можете переопределить стандартный класс по необходимости или оставить его пустым, если не хотите использовать стандартную группировку.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Настройка стандартного класса группировки в компоненте",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "В этом примере показано использование компонента с различными CSS-классами для настройки его внешнего вида.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "CSS-классы",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "В этом примере показано, как можно использовать компонент для отключения как ссылки, так и соответствующей кнопки. Отключение делает ссылку недоступной для нажатия, а кнопку нельзя будет активировать.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Отключение ссылки и кнопки",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "В этом примере показано, как можно использовать компонент в сочетании с компонентом <a href='/#/link'>ALink</a> для гибкой настройки ссылок и копирования их текста в буфер обмена. Компонент <a href='/#/link'>ALink</a> используется для создания и определения самой ссылки.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Настройка ссылки",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "Слот 'button' позволяет вам определить текст кнопки по вашему усмотрению. Содержимое слота 'button' передается в компонент <a href='/#/button'>AButton</a>, находящийся внутри него.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Настройка кнопки с помощью слота 'button'",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "В этом примере показано, как можно настроить текст ссылки в компоненте с помощью слота 'link'. Содержимое слота 'link' передается в компонент <a href='/#/link'>ALink</a>, находящийся внутри него.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Настройка ссылки с помощью слота 'link'",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "В этом примере показано, как можно использовать компонент для копирования пользовательского текста вместо стандартного текста ссылки. Свойство 'text-copy' позволяет установить текст, который нужно скопировать.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Копирование пользовательского текста",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Определение свойств и атрибутов HTML для кнопки, использующей компонент <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Положение кнопки. Вы можете использовать либо <strong>right</strong> (справа), либо <strong>left</strong> (слева).",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Стандартный CSS-класс для внешней группировки",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "CSS-классы",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Отключение компонента",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "Настройка отображения и поведения ссылки путем определения всех используемых в ней свойств и атрибутов HTML из компонента <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "Текст, который нужно скопировать вместо стандартного текста ссылки.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "Текст кнопки. Содержимое этого слота передается как текст кнопки в компонент <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "Текст ссылки. Содержимое этого слота передается как текст ссылки в компонент <a href='/#/link'>ALink</a>."
}