{
  "_A_TABS_COMPONENT_DESCRIPTION_": "Die <strong lang=\"en\">ATabs</strong>-Komponente wird verwendet, um Inhalte mithilfe von Tabs zu organisieren. Jeder Tab enthält einen Titel und den entsprechenden Inhalt, der beim Aktivieren des Tabs angezeigt wird. Verschiedene Einstellungen werden unterstützt, wie vertikale oder horizontale Anordnung, Deaktivierung von Tabs, die Möglichkeit, <strong lang=\"en\">HTML</strong> in Tab-Titeln zu verwenden, und die Konfiguration des Verhaltens des aktiven Tabs.",
  "_A_TABS_COMPONENT_NAME_": "Tabs",
  "_A_TABS_CONTENT_1_": "Inhalt 1",
  "_A_TABS_CONTENT_2_": "Inhalt 2",
  "_A_TABS_CONTENT_3_": "Inhalt 3",
  "_A_TABS_CONTENT_4_": "Inhalt 4",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn ein Tab angeklickt wird. Gibt ein Objekt mit den folgenden Argumenten zurück: <strong lang=\"en\">$event</strong> — Ereignisinformationen, <strong lang=\"en\">tab</strong> — Tab-Daten, <strong lang=\"en\">tabId</strong> — eindeutige Kennung des Tabs oder Index, <strong lang=\"en\">index</strong> — Index des Tabs im Datensatz.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">active-tab-id</strong> verwendet wird, um den aktiven Tab beim Rendern festzulegen. Der Wert von <strong lang=\"en\">active-tab-id</strong> kann eine <strong lang=\"en\">ID</strong> sein, wenn <strong lang=\"en\">key-id</strong> verwendet wird, oder der Tab-Index, wenn <strong lang=\"en\">key-id</strong> nicht festgelegt ist. Die Komponente verfolgt automatisch Änderungen dieser Eigenschaft.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Festlegen des aktiven Tabs über <strong lang=\"en\">ID</strong> oder Index",
  "_A_TABS_GROUP_COMPLEX_DESCRIPTION_": "Dieses Beispiel zeigt, wie die <strong lang=\"en\">a-tabs</strong>-Komponente mit verschiedenen Einstellungen und der Möglichkeit, Tabs hinzuzufügen und zu entfernen, verwendet wird. Im Formular können Parameter wie das Deaktivieren von Tabs, deren Layout (vertikal oder horizontal), das Ein- bzw. Ausschalten der Rahmen für aktive Tabs und die Verwendung von <strong lang=\"en\">HTML</strong> für Tab-Titel geändert werden. Zusätzlich ist die Möglichkeit implementiert, neue Tabs dynamisch hinzuzufügen und bestehende über eine Auswahl aus einer Liste zu entfernen.",
  "_A_TABS_GROUP_COMPLEX_HEADER_": "Beispiel mit Einstellungen und Tab-Verwaltung",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">disabled</strong> verwendet wird, um alle Tabs zu deaktivieren. Wenn diese Eigenschaft auf <strong lang=\"en\">true</strong> gesetzt ist, können Benutzer nicht mit den Tabs interagieren.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Tabs deaktivieren",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_DESCRIPTION_": "Dieses Beispiel zeigt, wie dynamische Slots <strong lang=\"en\">slotTab</strong> und <strong lang=\"en\">slotContent</strong> verwendet werden, deren Namen im <strong lang=\"en\">data</strong>-Array angegeben sind. Wenn ein Name und ein entsprechender Slot übergeben werden, ersetzen sie den Standardinhalt der Tabs und des Inhalts. Slot-Argumente ermöglichen den Zugriff auf <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong> und <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_HEADER_": "Dynamische Slots für Tabs und Inhalt",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">is-boxed</strong> verwendet wird, um zu bestimmen, ob ein Rahmen um den aktiven Tab angezeigt wird. Das erste Beispiel hat den Rahmen aktiviert, das zweite ohne Rahmen.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Rahmen für den aktiven Tab",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">is-change-outside</strong> verwendet wird. Wenn dessen Wert auf <strong lang=\"en\">true</strong> gesetzt ist, wird beim Klicken auf einen inaktiven Tab dieser nicht automatisch aktiviert. Um den aktiven Tab zu ändern, müssen das <strong lang=\"en\">change</strong>-Ereignis und die <strong lang=\"en\">active-tab-id</strong>-Eigenschaft verwendet werden.",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "Tab wechselt nur über Ereignis",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">is-vertical</strong> verwendet wird, um Tabs vertikal oder horizontal anzuordnen. Die ersten beiden Beispiele zeigen eine vertikale Anordnung der Tabs, das dritte eine horizontale.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Vertikale Tabs",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-active</strong> verwendet wird, um den aktiven Tab bei der Initialisierung der Komponente festzulegen. Wenn in den Tab-Daten das Feld <strong lang=\"en\">active</strong> mit dem Wert <strong lang=\"en\">true</strong> angegeben ist, wird dieser Tab beim ersten Rendern aktiviert.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Aktiver Tab bei der Initialisierung",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-content</strong> verwendet wird, um anzugeben, welches Datenfeld verwendet wird, um den Inhalt für jeden Tab anzuzeigen. Anstelle des Standard-<strong lang=\"en\">content</strong>-Schlüssels wird <strong lang=\"en\">aloha</strong> verwendet, um den Inhalt anzuzeigen, der jedem Tab entspricht.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Schlüssel zur Anzeige des Inhalts",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-disabled</strong> verwendet wird, um einzelne Tabs zu deaktivieren. Tabs, bei denen der Parameter <strong lang=\"en\">disabled</strong> auf <strong lang=\"en\">true</strong> gesetzt ist, sind nicht für die Interaktion verfügbar.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Einzelne Tabs deaktivieren",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-id</strong> verwendet wird, um die Leistung beim Rendern von Tabs zu verbessern. Die Verwendung einer eindeutigen Kennung für jeden Tab ermöglicht eine schnellere Bestimmung des aktiven Tabs. Wenn <strong lang=\"en\">key-id</strong> nicht angegeben ist, wird der Tab-Index verwendet.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Eindeutige Kennung für Tabs",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-label</strong> verwendet wird, um ein alternatives Feld für Tab-Beschriftungen anzugeben. In diesem Fall wird der Schlüssel <strong lang=\"en\">name</strong> anstelle von <strong lang=\"en\">label</strong> für Tab-Namen verwendet.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Schlüssel für Tab-Beschriftungen",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">key-title</strong> verwendet wird, um anzugeben, welches Datenfeld zur Anzeige der Tab-Titel verwendet wird. Anstelle des Standardtitels kann ein anderer Schlüssel wie <strong lang=\"en\">label</strong> verwendet werden.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Schlüssel für Tab-Titel",
  "_A_TABS_GROUP_STATIC_SLOTS_DESCRIPTION_": "Dieses Beispiel zeigt, wie statische Slots <strong lang=\"en\">tab</strong> und <strong lang=\"en\">content</strong> verwendet werden, um die Anzeige von Tabs und deren Inhalt anzupassen. Slot-Argumente ermöglichen den Zugriff auf <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong> und <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_STATIC_SLOTS_HEADER_": "Statische Slots für Tabs und Inhalt",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "Dieses Beispiel zeigt, wie <strong lang=\"en\">is-title-html</strong> verwendet wird, um die Anzeige von <strong lang=\"en\">HTML</strong>-Inhalten in Tab-Titeln zu erlauben. Zusätzlich wird die Eigenschaft <strong lang=\"en\">key-title</strong> verwendet, um den Schlüssel anzugeben, aus dem der <strong lang=\"en\">HTML</strong>-Inhalt für die Tab-Titel entnommen wird.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> in Tab-Titeln",
  "_A_TABS_LABEL_ADD_TABS_": "Tabs hinzufügen",
  "_A_TABS_LABEL_DELETE_TABS_": "Tabs löschen",
  "_A_TABS_LABEL_DISABLED_": "Tabs deaktivieren (<strong lang=\"en\">disabled</strong>)",
  "_A_TABS_LABEL_IS_BOXED_": "Rahmen für den aktiven Tab (<strong lang=\"en\">isBoxed</strong>)",
  "_A_TABS_LABEL_IS_TITLE_HTML_": "<strong lang=\"en\">HTML</strong> in Tab-Titeln (<strong lang=\"en\">isTitleHtml</strong>)",
  "_A_TABS_LABEL_IS_VERTICAL_": "Vertikale Tabs (<strong lang=\"en\">isVertical</strong>)",
  "_A_TABS_LABEL_TITLE_PLACEMENT_": "Tooltip-Position relativ zum Element (<strong lang=\"en\">titlePlacement</strong>)",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Definiert die <strong lang=\"en\">ID</strong> oder den Index des aktiven Tabs. Wenn <strong lang=\"en\">key-id</strong> nicht festgelegt ist, wird der Tab-Index verwendet. Die Komponente verfolgt Änderungen dieses Wertes, um den aktiven Tab zu aktualisieren.",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "Ein Datenarray, das die Tabs beschreibt. Jedes Element des Arrays ist ein Objekt mit Parametern für den Tab-Titel, den Inhalt und andere Tab-Eigenschaften.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Deaktiviert die Möglichkeit, mit den Tabs zu interagieren. Wenn auf <strong lang=\"en\">true</strong> gesetzt, sind die Tabs für das Wechseln nicht verfügbar.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Bestimmt, ob der aktive Tab von einem Rahmen umgeben ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird der Rahmen angezeigt.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Wenn auf <strong lang=\"en\">true</strong> gesetzt, ändert sich der Tab nicht automatisch beim Klicken. Um den aktiven Tab zu ändern, müssen Sie das <strong lang=\"en\">change</strong>-Ereignis verwenden und einen neuen Wert für <strong lang=\"en\">active-tab-id</strong> festlegen.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Bestimmt, ob die Tabs vertikal oder horizontal angeordnet sind. Wenn auf <strong lang=\"en\">true</strong> gesetzt, werden die Tabs vertikal angezeigt.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Definiert den Schlüssel zur Aktivierung eines Tabs bei der Initialisierung. Wenn der Wert des Feldes, das in <strong lang=\"en\">key-active</strong> angegeben ist, auf <strong lang=\"en\">true</strong> gesetzt ist, wird der entsprechende Tab aktiviert.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Ermöglicht die Angabe des Schlüssels für die Daten, die als Inhalt für jeden Tab angezeigt werden.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Schlüssel zum Deaktivieren einzelner Tabs. Wenn der Wert eines Tabs für diesen Schlüssel auf <strong lang=\"en\">true</strong> gesetzt ist, wird er deaktiviert.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Eindeutige Kennung für Tabs. Wenn <strong lang=\"en\">key-id</strong> nicht angegeben ist, wird der Tab-Index als eindeutige Kennung verwendet.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Schlüssel zur Angabe des Feldes, das für Tab-Beschriftungen verwendet wird.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Ermöglicht die Angabe des Schlüssels für die Daten, die als Tab-Titel angezeigt werden.",
  "_A_TABS_SLOTS_CONTENT_DESCRIPTION_": "Statischer Slot zur Anpassung der Anzeige von Tab-Inhalten. Slot-Argumente umfassen: <strong lang=\"en\">activeTabId</strong> — Kennung des aktiven Tabs, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> des Inhaltsblocks, <strong lang=\"en\">index</strong> — Index des Tabs, <strong lang=\"en\">isActive</strong> — Aktivierungsflagge, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> der gesamten Komponente, <strong lang=\"en\">tab</strong> — Element aus dem <strong lang=\"en\">data</strong>-Array, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> des Tabs.",
  "_A_TABS_SLOTS_SLOT_CONTENT_DESCRIPTION_": "Dynamischer Slot zur Anpassung der Anzeige von Tab-Inhalten. Der Slot-Name wird im <strong lang=\"en\">data</strong>-Array für jedes Element angegeben. Slot-Argumente umfassen: <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong> und <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_SLOTS_SLOT_TAB_DESCRIPTION_": "Dynamischer Slot zur Anpassung der Anzeige eines Tabs. Der Slot-Name wird im <strong lang=\"en\">data</strong>-Array für jedes Element angegeben. Slot-Argumente umfassen: <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong> und <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_SLOTS_TAB_DESCRIPTION_": "Statischer Slot zur Anpassung der Anzeige eines Tabs. Slot-Argumente umfassen: <strong lang=\"en\">activeTabId</strong> — Kennung des aktiven Tabs, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> des Inhaltsblocks, <strong lang=\"en\">index</strong> — Index des Tabs, <strong lang=\"en\">isActive</strong> — Aktivierungsflagge, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> der gesamten Komponente, <strong lang=\"en\">tab</strong> — Element aus dem <strong lang=\"en\">data</strong>-Array, und <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> des Tabs.",
  "_A_TABS_TAB_": "Tab",
  "_A_TABS_TAB_1_": "Tab 1",
  "_A_TABS_TAB_2_": "Tab 2",
  "_A_TABS_TAB_3_": "Tab 3",
  "_A_TABS_TAB_4_": "Tab 4"
}