{
  "_A_TABS_COMPONENT_DESCRIPTION_": "Komponenta <strong lang=\"en\">ATabs</strong> koristi se za organizaciju sadržaja pomoću kartica. Svaka kartica sadrži naslov i odgovarajući sadržaj koji se prikazuje prilikom aktivacije kartice. Podržane su različite postavke, kao što su vertikalni ili horizontalni raspored, onemogućavanje kartica, mogućnost korištenja <strong lang=\"en\">HTML</strong> u naslovima i podešavanje ponašanja aktivne kartice.",
  "_A_TABS_COMPONENT_NAME_": "Kartice",
  "_A_TABS_CONTENT_1_": "Sadržaj 1",
  "_A_TABS_CONTENT_2_": "Sadržaj 2",
  "_A_TABS_CONTENT_3_": "Sadržaj 3",
  "_A_TABS_CONTENT_4_": "Sadržaj 4",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Događaj koji se aktivira klikom na karticu. Vraća objekt s argumentima: <strong lang=\"en\">$event</strong> — informacije o događaju, <strong lang=\"en\">tab</strong> — podaci o kartici, <strong lang=\"en\">tabId</strong> — jedinstveni identifikator kartice ili indeks, <strong lang=\"en\">index</strong> — indeks kartice u nizu podataka.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">active-tab-id</strong> za postavljanje aktivne kartice prilikom renderiranja. Vrijednost <strong lang=\"en\">active-tab-id</strong> može biti <strong lang=\"en\">ID</strong> ako se koristi <strong lang=\"en\">key-id</strong>, ili indeks kartice ako ključ <strong lang=\"en\">key-id</strong> nije postavljen. Komponenta automatski prati promjene ovog svojstva.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Definicija aktivne kartice putem <strong lang=\"en\">ID</strong> ili indeksa",
  "_A_TABS_GROUP_COMPLEX_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti komponentu <strong lang=\"en\">a-tabs</strong> s različitim postavkama i mogućnošću dodavanja i uklanjanja kartica. U obrascu se mogu promijeniti parametri poput onemogućavanja kartica, njihovog rasporeda (vertikalno ili horizontalno), uključivanje/onemogućavanje okvira za aktivne kartice i korištenje <strong lang=\"en\">HTML</strong> za naslove kartica. Osim toga, implementirana je mogućnost dinamičkog dodavanja novih kartica i uklanjanja postojećih putem odabira u popisu.",
  "_A_TABS_GROUP_COMPLEX_HEADER_": "Primjer s postavkama i upravljanjem karticama",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">disabled</strong> za onemogućavanje svih kartica. Kada je ova svojstvo postavljeno na <strong lang=\"en\">true</strong>, korisnici ne mogu međusobno djelovati s karticama.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Onemogućavanje kartica",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti dinamičke slotove <strong lang=\"en\">slotTab</strong> i <strong lang=\"en\">slotContent</strong>, čije ime je navedeno u nizu <strong lang=\"en\">data</strong>. Ako se proslijedi ime i odgovarajući slot, oni zamjenjuju standardni sadržaj kartica i sadržaja. Argumenti slotova pružaju pristup <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_HEADER_": "Dinamički slotovi za kartice i sadržaj",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-boxed</strong> za određivanje prikazuje li se okvir oko aktivne kartice. Prvi primjer ima okvir uključen, drugi bez okvira.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Okvir za aktivnu karticu",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-change-outside</strong>. Ako je njegova vrijednost postavljena na <strong lang=\"en\">true</strong>, klikom na neaktivnu karticu ona se ne aktivira automatski. Za promjenu aktivne kartice potrebno je koristiti događaj <strong lang=\"en\">change</strong> i svojstvo <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "Kartica se mijenja samo putem događaja",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-vertical</strong> za raspoređivanje kartica vertikalno ili horizontalno. Prva dva primjera pokazuju vertikalni raspored kartica, a treći horizontalni.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Vertikalne kartice",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-active</strong> za postavljanje aktivne kartice prilikom inicijalizacije komponente. Ako u podacima za karticu postoji polje <strong lang=\"en\">active</strong> s vrijednošću <strong lang=\"en\">true</strong>, ta kartica će biti aktivirana pri prvom renderiranju.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Aktivna kartica pri inicijalizaciji",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-content</strong> za određivanje koje polje podataka će se koristiti za prikaz sadržaja povezanog sa svakom karticom. Umjesto standardnog ključa <strong lang=\"en\">content</strong>, koristi se <strong lang=\"en\">aloha</strong> za prikaz sadržaja koji odgovara svakoj kartici.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Ključ za prikaz sadržaja",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-disabled</strong> za onemogućavanje pojedinačnih kartica. Kartice koje imaju parametar <strong lang=\"en\">disabled</strong> postavljen na <strong lang=\"en\">true</strong> neće biti dostupne za interakciju.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Onemogućavanje pojedinačnih kartica",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-id</strong> za poboljšanje performansi pri renderiranju kartica. Korištenje jedinstvenog identifikatora za svaku karticu omogućava brže određivanje aktivne kartice. Ako <strong lang=\"en\">key-id</strong> nije naveden, koristi se indeks kartice.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Jedinstveni identifikator za kartice",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-label</strong> za određivanje alternativnog polja za oznake kartica. U ovom slučaju, koristi se ključ <strong lang=\"en\">name</strong> umjesto <strong lang=\"en\">label</strong> za nazive kartica.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Ključ za oznake kartica",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">key-title</strong> za određivanje koje polje podataka će se koristiti za prikaz naslova kartica. Umjesto standardnog naslova, može se koristiti drugi ključ, poput <strong lang=\"en\">label</strong>.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Ključ za naslove kartica",
  "_A_TABS_GROUP_STATIC_SLOTS_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti statične slotove <strong lang=\"en\">tab</strong> i <strong lang=\"en\">content</strong> za prilagodbu prikaza kartica i njihovog sadržaja. Argumenti slotova pružaju pristup <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_STATIC_SLOTS_HEADER_": "Statični slotovi za kartice i sadržaj",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti <strong lang=\"en\">is-title-html</strong> za omogućavanje prikaza <strong lang=\"en\">HTML</strong> sadržaja u naslovima kartica. Uz to, koristi se svojstvo <strong lang=\"en\">key-title</strong> za određivanje ključa iz kojeg će se uzeti <strong lang=\"en\">HTML</strong> sadržaj za naslove kartica.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> u naslovima kartica",
  "_A_TABS_LABEL_ADD_TABS_": "Dodavanje kartica",
  "_A_TABS_LABEL_DELETE_TABS_": "Brisanje kartica",
  "_A_TABS_LABEL_DISABLED_": "Onemogućavanje kartica (<strong lang=\"en\">disabled</strong>)",
  "_A_TABS_LABEL_IS_BOXED_": "Okvir za aktivnu karticu (<strong lang=\"en\">isBoxed</strong>)",
  "_A_TABS_LABEL_IS_TITLE_HTML_": "<strong lang=\"en\">HTML</strong> u naslovima kartica (<strong lang=\"en\">isTitleHtml</strong>)",
  "_A_TABS_LABEL_IS_VERTICAL_": "Vertikalne kartice (<strong lang=\"en\">isVertical</strong>)",
  "_A_TABS_LABEL_TITLE_PLACEMENT_": "Pozicioniranje tooltipa u odnosu na element (<strong lang=\"en\">titlePlacement</strong>)",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Definira <strong lang=\"en\">ID</strong> ili indeks aktivne kartice. Ako <strong lang=\"en\">key-id</strong> nije postavljen, koristi se indeks kartice. Komponenta prati promjene ove vrijednosti kako bi ažurirala aktivnu karticu.",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "Niz podataka koji opisuje kartice. Svaki element niza predstavlja objekt s parametrima za naslov, sadržaj i druge svojstva kartica.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Onemogućuje mogućnost interakcije s karticama. Ako je vrijednost <strong lang=\"en\">true</strong>, kartice neće biti dostupne za prebacivanje.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Određuje hoće li aktivna kartica biti okružena okvirom. Ako je postavljeno na <strong lang=\"en\">true</strong>, okvir će se prikazati.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Ako je postavljeno na <strong lang=\"en\">true</strong>, kartica se neće mijenjati automatski prilikom klika. Za to je potrebno koristiti događaj <strong lang=\"en\">change</strong> i postaviti novu vrijednost u <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Određuje hoće li kartice biti raspoređene vertikalno ili horizontalno. Ako je vrijednost postavljena na <strong lang=\"en\">true</strong>, kartice će se prikazivati vertikalno.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Određuje ključ za aktiviranje kartice prilikom inicijalizacije. Ako je vrijednost polja specificiranog u <strong lang=\"en\">key-active</strong> postavljena na <strong lang=\"en\">true</strong>, ta kartica će biti aktivirana.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Omogućuje određivanje ključa za podatke koji će se prikazivati kao sadržaj za svaku karticu.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Ključ za onemogućavanje pojedinačnih kartica. Ako je vrijednost ovog ključa u kartici postavljena na <strong lang=\"en\">true</strong>, kartica će biti onemogućena.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Jedinstveni identifikator za kartice. Ako <strong lang=\"en\">key-id</strong> nije specificiran, koristi se indeks kao jedinstveni identifikator kartice.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Ključ za određivanje polja koje će se koristiti za oznake kartica.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Omogućuje određivanje ključa za podatke koji će se prikazivati kao naslovi kartica.",
  "_A_TABS_SLOTS_CONTENT_DESCRIPTION_": "Statični slot za prilagodbu prikaza sadržaja kartice. Argumenti slotova uključuju: <strong lang=\"en\">activeTabId</strong> — identifikator aktivne kartice, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> bloka sa sadržajem, <strong lang=\"en\">index</strong> — indeks kartice, <strong lang=\"en\">isActive</strong> — zastavica aktivnosti, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> cijele komponente, <strong lang=\"en\">tab</strong> — element iz niza <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> kartice.",
  "_A_TABS_SLOTS_SLOT_CONTENT_DESCRIPTION_": "Dinamički slot za prilagodbu prikaza sadržaja kartice. Ime slot-a se specificira u nizu <strong lang=\"en\">data</strong> za svaki element. Argumenti slot-a uključuju: <strong lang=\"en\">activeTabId</strong> — identifikator aktivne kartice, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> bloka sa sadržajem, <strong lang=\"en\">index</strong> — indeks kartice, <strong lang=\"en\">isActive</strong> — zastavica aktivnosti, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> cijele komponente, <strong lang=\"en\">tab</strong> — element iz niza <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> kartice.",
  "_A_TABS_SLOTS_SLOT_TAB_DESCRIPTION_": "Dinamički slot za prilagodbu prikaza kartice. Ime slot-a se specificira u nizu <strong lang=\"en\">data</strong> za svaki element. Argumenti slot-a uključuju: <strong lang=\"en\">activeTabId</strong> — identifikator aktivne kartice, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> bloka sa sadržajem, <strong lang=\"en\">index</strong> — indeks kartice, <strong lang=\"en\">isActive</strong> — zastavica aktivnosti, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> cijele komponente, <strong lang=\"en\">tab</strong> — element iz niza <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> kartice.",
  "_A_TABS_SLOTS_TAB_DESCRIPTION_": "Statični slot za prilagodbu prikaza kartice. Argumenti slot-a uključuju: <strong lang=\"en\">activeTabId</strong> — identifikator aktivne kartice, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> bloka sa sadržajem, <strong lang=\"en\">index</strong> — indeks kartice, <strong lang=\"en\">isActive</strong> — zastavica aktivnosti, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> cijele komponente, <strong lang=\"en\">tab</strong> — element iz niza <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> kartice.",
  "_A_TABS_TAB_": "Kartica",
  "_A_TABS_TAB_1_": "Kartica 1",
  "_A_TABS_TAB_2_": "Kartica 2",
  "_A_TABS_TAB_3_": "Kartica 3",
  "_A_TABS_TAB_4_": "Kartica 4"
}