{
  "_A_TABS_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">ATabs</strong> viene utilizzato per organizzare il contenuto tramite schede. Ogni scheda contiene un titolo e il relativo contenuto, visualizzato quando la scheda viene attivata. Sono supportate diverse impostazioni, come disposizione verticale o orizzontale, disabilitazione delle schede, possibilità di utilizzare <strong lang=\"en\">HTML</strong> nei titoli e configurazione del comportamento della scheda attiva.",
  "_A_TABS_COMPONENT_NAME_": "Schede",
  "_A_TABS_CONTENT_1_": "Contenuto 1",
  "_A_TABS_CONTENT_2_": "Contenuto 2",
  "_A_TABS_CONTENT_3_": "Contenuto 3",
  "_A_TABS_CONTENT_4_": "Contenuto 4",
  "_A_TABS_EVENTS_CHANGE_DESCRIPTION_": "Evento che si attiva al clic su una scheda. Restituisce un oggetto con gli argomenti: <strong lang=\"en\">$event</strong> — informazioni sull'evento, <strong lang=\"en\">tab</strong> — dati sulla scheda, <strong lang=\"en\">tabId</strong> — identificatore univoco della scheda o indice, <strong lang=\"en\">index</strong> — indice della scheda nell'array dei dati.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">active-tab-id</strong> per impostare la scheda attiva durante il rendering. Il valore di <strong lang=\"en\">active-tab-id</strong> può essere un <strong lang=\"en\">ID</strong> se viene utilizzato <strong lang=\"en\">key-id</strong>, oppure l'indice della scheda se la chiave <strong lang=\"en\">key-id</strong> non è impostata. Il componente monitora automaticamente le modifiche di questa proprietà.",
  "_A_TABS_GROUP_ACTIVE_TAB_ID_HEADER_": "Definizione della scheda attiva tramite <strong lang=\"en\">ID</strong> o indice",
  "_A_TABS_GROUP_COMPLEX_DESCRIPTION_": "Questo esempio mostra come utilizzare il componente <strong lang=\"en\">a-tabs</strong> con diverse impostazioni e la possibilità di aggiungere e rimuovere schede. Nel modulo è possibile modificare parametri come disabilitazione delle schede, disposizione (verticale o orizzontale), abilitazione/disabilitazione del bordo per le schede attive e utilizzo di <strong lang=\"en\">HTML</strong> per i titoli delle schede. Inoltre, è implementata la possibilità di aggiungere dinamicamente nuove schede e rimuovere quelle esistenti tramite una selezione nell'elenco.",
  "_A_TABS_GROUP_COMPLEX_HEADER_": "Esempio con impostazioni e gestione delle schede",
  "_A_TABS_GROUP_DISABLED_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">disabled</strong> per disabilitare tutte le schede. Quando questa proprietà è impostata su <strong lang=\"en\">true</strong>, gli utenti non possono interagire con le schede.",
  "_A_TABS_GROUP_DISABLED_HEADER_": "Disabilitazione delle schede",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_DESCRIPTION_": "Questo esempio mostra come utilizzare slot dinamici <strong lang=\"en\">slotTab</strong> e <strong lang=\"en\">slotContent</strong>, i cui nomi sono specificati nell'array <strong lang=\"en\">data</strong>. Se viene fornito un nome e lo slot corrispondente, sostituiscono il contenuto standard delle schede e del contenuto. Gli argomenti degli slot forniscono accesso a <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_DYNAMIC_SLOTS_HEADER_": "Slot dinamici per schede e contenuto",
  "_A_TABS_GROUP_IS_BOXED_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-boxed</strong> per determinare se verrà visualizzato un bordo attorno alla scheda attiva. Il primo esempio ha il bordo abilitato, il secondo senza bordo.",
  "_A_TABS_GROUP_IS_BOXED_HEADER_": "Bordo per la scheda attiva",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-change-outside</strong>. Se il suo valore è impostato su <strong lang=\"en\">true</strong>, cliccando su una scheda non attiva non diventerà automaticamente attiva. Per cambiare la scheda attiva è necessario utilizzare l'evento <strong lang=\"en\">change</strong> e la proprietà <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_GROUP_IS_CHANGE_OUTSIDE_HEADER_": "La scheda cambia solo tramite evento",
  "_A_TABS_GROUP_IS_VERTICAL_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-vertical</strong> per disporre le schede verticalmente o orizzontalmente. I primi due esempi mostrano la disposizione verticale delle schede, mentre il terzo è orizzontale.",
  "_A_TABS_GROUP_IS_VERTICAL_HEADER_": "Schede verticali",
  "_A_TABS_GROUP_KEY_ACTIVE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-active</strong> per impostare la scheda attiva all'inizializzazione del componente. Se nei dati della scheda è specificato un campo <strong lang=\"en\">active</strong> con valore <strong lang=\"en\">true</strong>, quella scheda sarà attivata al primo rendering.",
  "_A_TABS_GROUP_KEY_ACTIVE_HEADER_": "Scheda attiva all'inizializzazione",
  "_A_TABS_GROUP_KEY_CONTENT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-content</strong> per specificare quale campo dei dati verrà utilizzato per mostrare il contenuto associato a ciascuna scheda. Invece di usare la chiave standard <strong lang=\"en\">content</strong>, viene utilizzato <strong lang=\"en\">aloha</strong> per mostrare il contenuto corrispondente a ciascuna scheda.",
  "_A_TABS_GROUP_KEY_CONTENT_HEADER_": "Chiave per mostrare il contenuto",
  "_A_TABS_GROUP_KEY_DISABLED_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-disabled</strong> per disabilitare singole schede. Le schede che hanno il parametro <strong lang=\"en\">disabled</strong> impostato su <strong lang=\"en\">true</strong> non saranno disponibili per l'interazione.",
  "_A_TABS_GROUP_KEY_DISABLED_HEADER_": "Disabilitazione di schede singole",
  "_A_TABS_GROUP_KEY_ID_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-id</strong> per migliorare le prestazioni durante il rendering delle schede. Utilizzare un identificatore univoco per ogni scheda consente di determinare più rapidamente la scheda attiva. Se <strong lang=\"en\">key-id</strong> non è specificato, viene utilizzato l'indice della scheda.",
  "_A_TABS_GROUP_KEY_ID_HEADER_": "Identificatore univoco per le schede",
  "_A_TABS_GROUP_KEY_LABEL_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-label</strong> per specificare un campo alternativo per le etichette delle schede. In questo caso, viene utilizzata la chiave <strong lang=\"en\">name</strong> invece di <strong lang=\"en\">label</strong> per i nomi delle schede.",
  "_A_TABS_GROUP_KEY_LABEL_HEADER_": "Chiave per le etichette delle schede",
  "_A_TABS_GROUP_KEY_TITLE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-title</strong> per specificare quale campo dei dati verrà utilizzato per mostrare il titolo delle schede. Invece del titolo standard, può essere utilizzata un'altra chiave, come <strong lang=\"en\">label</strong>.",
  "_A_TABS_GROUP_KEY_TITLE_HEADER_": "Chiave per i titoli delle schede",
  "_A_TABS_GROUP_STATIC_SLOTS_DESCRIPTION_": "Questo esempio mostra come utilizzare slot statici <strong lang=\"en\">tab</strong> e <strong lang=\"en\">content</strong> per personalizzare la visualizzazione delle schede e del loro contenuto. Gli argomenti degli slot forniscono accesso a <strong lang=\"en\">activeTabId</strong>, <strong lang=\"en\">contentId</strong>, <strong lang=\"en\">index</strong>, <strong lang=\"en\">isActive</strong>, <strong lang=\"en\">parentId</strong>, <strong lang=\"en\">tab</strong>, <strong lang=\"en\">tabId</strong>.",
  "_A_TABS_GROUP_STATIC_SLOTS_HEADER_": "Slot statici per schede e contenuto",
  "_A_TABS_GROUP_TITLE_HTML_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-title-html</strong> per consentire la visualizzazione di contenuto <strong lang=\"en\">HTML</strong> nei titoli delle schede. Insieme a ciò, viene utilizzata la proprietà <strong lang=\"en\">key-title</strong> per indicare la chiave da cui verrà prelevato il contenuto <strong lang=\"en\">HTML</strong> per i titoli delle schede.",
  "_A_TABS_GROUP_TITLE_HTML_HEADER_": "<strong lang=\"en\">HTML</strong> nei titoli delle schede",
  "_A_TABS_LABEL_ADD_TABS_": "Aggiungere schede",
  "_A_TABS_LABEL_DELETE_TABS_": "Eliminare schede",
  "_A_TABS_LABEL_DISABLED_": "Disabilitare le schede (<strong lang=\"en\">disabled</strong>)",
  "_A_TABS_LABEL_IS_BOXED_": "Bordo per la scheda attiva (<strong lang=\"en\">isBoxed</strong>)",
  "_A_TABS_LABEL_IS_TITLE_HTML_": "<strong lang=\"en\">HTML</strong> nei titoli delle schede (<strong lang=\"en\">isTitleHtml</strong>)",
  "_A_TABS_LABEL_IS_VERTICAL_": "Schede verticali (<strong lang=\"en\">isVertical</strong>)",
  "_A_TABS_LABEL_TITLE_PLACEMENT_": "Posizionamento del tooltip rispetto all'elemento (<strong lang=\"en\">titlePlacement</strong>)",
  "_A_TABS_PROPS_ACTIVE_TAB_ID_DESCRIPTION_": "Definisce l'<strong lang=\"en\">ID</strong> o l'indice della scheda attiva. Se <strong lang=\"en\">key-id</strong> non è impostato, viene utilizzato l'indice della scheda. Il componente monitora le modifiche a questo valore per aggiornare la scheda attiva.",
  "_A_TABS_PROPS_DATA_DESCRIPTION_": "Array di dati che descrive le schede. Ogni elemento dell'array rappresenta un oggetto con parametri per il titolo, il contenuto e altre proprietà delle schede.",
  "_A_TABS_PROPS_DISABLED_DESCRIPTION_": "Disabilita la possibilità di interagire con le schede. Se il valore è <strong lang=\"en\">true</strong>, le schede non saranno disponibili per il cambio.",
  "_A_TABS_PROPS_IS_BOXED_DESCRIPTION_": "Determina se la scheda attiva sarà circondata da un bordo. Se impostato su <strong lang=\"en\">true</strong>, verrà visualizzato il bordo.",
  "_A_TABS_PROPS_IS_CHANGE_OUTSIDE_DESCRIPTION_": "Se impostato su <strong lang=\"en\">true</strong>, la scheda non cambierà automaticamente al clic. Per questo è necessario utilizzare l'evento <strong lang=\"en\">change</strong> e impostare un nuovo valore in <strong lang=\"en\">active-tab-id</strong>.",
  "_A_TABS_PROPS_IS_VERTICAL_DESCRIPTION_": "Determina se le schede saranno disposte verticalmente o orizzontalmente. Se il valore è impostato su <strong lang=\"en\">true</strong>, le schede saranno visualizzate verticalmente.",
  "_A_TABS_PROPS_KEY_ACTIVE_DESCRIPTION_": "Determina la chiave per attivare una scheda all'inizializzazione. Se il valore del campo specificato in <strong lang=\"en\">key-active</strong> è impostato su <strong lang=\"en\">true</strong>, quella scheda sarà attivata.",
  "_A_TABS_PROPS_KEY_CONTENT_DESCRIPTION_": "Consente di specificare la chiave per i dati che saranno visualizzati come contenuto per ogni scheda.",
  "_A_TABS_PROPS_KEY_DISABLED_DESCRIPTION_": "Chiave per disabilitare schede individuali. Se il valore di questa chiave in una scheda è impostato su <strong lang=\"en\">true</strong>, la scheda sarà disabilitata.",
  "_A_TABS_PROPS_KEY_ID_DESCRIPTION_": "Identificatore univoco per le schede. Se <strong lang=\"en\">key-id</strong> non è specificato, viene utilizzato l'indice come identificatore univoco della scheda.",
  "_A_TABS_PROPS_KEY_LABEL_DESCRIPTION_": "Chiave per specificare il campo che verrà utilizzato per le etichette delle schede.",
  "_A_TABS_PROPS_KEY_TITLE_DESCRIPTION_": "Consente di specificare la chiave per i dati che saranno visualizzati come titoli delle schede.",
  "_A_TABS_SLOTS_CONTENT_DESCRIPTION_": "Slot statico per personalizzare la visualizzazione del contenuto della scheda. Gli argomenti dello slot includono: <strong lang=\"en\">activeTabId</strong> — identificatore della scheda attiva, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del blocco contenuto, <strong lang=\"en\">index</strong> — indice della scheda, <strong lang=\"en\">isActive</strong> — flag di attività, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> dell'intero componente, <strong lang=\"en\">tab</strong> — elemento dell'array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> della scheda.",
  "_A_TABS_SLOTS_SLOT_CONTENT_DESCRIPTION_": "Slot dinamico per personalizzare la visualizzazione del contenuto della scheda. Il nome dello slot è specificato nell'array <strong lang=\"en\">data</strong> per ogni elemento. Gli argomenti dello slot includono: <strong lang=\"en\">activeTabId</strong> — identificatore della scheda attiva, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del blocco contenuto, <strong lang=\"en\">index</strong> — indice della scheda, <strong lang=\"en\">isActive</strong> — flag di attività, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> dell'intero componente, <strong lang=\"en\">tab</strong> — elemento dell'array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> della scheda.",
  "_A_TABS_SLOTS_SLOT_TAB_DESCRIPTION_": "Slot dinamico per personalizzare la visualizzazione della scheda. Il nome dello slot è specificato nell'array <strong lang=\"en\">data</strong> per ogni elemento. Gli argomenti dello slot includono: <strong lang=\"en\">activeTabId</strong> — identificatore della scheda attiva, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del blocco contenuto, <strong lang=\"en\">index</strong> — indice della scheda, <strong lang=\"en\">isActive</strong> — flag di attività, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> dell'intero componente, <strong lang=\"en\">tab</strong> — elemento dell'array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> della scheda.",
  "_A_TABS_SLOTS_TAB_DESCRIPTION_": "Slot statico per personalizzare la visualizzazione della scheda. Gli argomenti dello slot includono: <strong lang=\"en\">activeTabId</strong> — identificatore della scheda attiva, <strong lang=\"en\">contentId</strong> — <strong lang=\"en\">HTML-ID</strong> del blocco contenuto, <strong lang=\"en\">index</strong> — indice della scheda, <strong lang=\"en\">isActive</strong> — flag di attività, <strong lang=\"en\">parentId</strong> — <strong lang=\"en\">ID</strong> dell'intero componente, <strong lang=\"en\">tab</strong> — elemento dell'array <strong lang=\"en\">data</strong>, <strong lang=\"en\">tabId</strong> — <strong lang=\"en\">ID</strong> della scheda.",
  "_A_TABS_TAB_": "Scheda",
  "_A_TABS_TAB_1_": "Scheda 1",
  "_A_TABS_TAB_2_": "Scheda 2",
  "_A_TABS_TAB_3_": "Scheda 3",
  "_A_TABS_TAB_4_": "Scheda 4"
}