{
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Der Wert oder das JavaScript-Objekt, das in eine JSON-Zeichenkette umgewandelt werden soll",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Eine Funktion, die das Verhalten des Umwandlungsprozesses beeinflusst, oder ein Array aus Zeichenketten und Zahlen, das Eigenschaften von value angibt, die in der Ausgabe enthalten sein sollen. Wenn replacer ein Array ist, werden alle Elemente in diesem Array, die keine Zeichenketten oder Zahlen sind (weder primitive Werte noch Wrapper-Objekte), einschließlich Symbol-Werte, vollständig ignoriert. Wenn replacer alles außer einer Funktion oder einem Array ist (z. B. null oder nicht angegeben), werden alle zeichenkettenbasierten Eigenschaften des Objekts in der resultierenden JSON-Zeichenkette aufgenommen",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Eine Zeichenkette oder eine Zahl, die für die Einfügung von Leerzeichen (einschließlich Einrückung, Zeilenumbruchzeichen usw.) in die Ausgabe-JSON-Zeichenkette zu Lesbarkeitszwecken verwendet wird. Wenn dies eine Zahl ist, gibt sie die Anzahl der Leerzeichen oder anderer Zeichen an, die als Einrückung verwendet werden sollen, auf maximal 10 begrenzt (dh jede Zahl größer als 10 wird so behandelt, als wäre sie 10). Werte kleiner als 1 zeigen an, dass kein Leerzeichen verwendet werden soll. Wenn dies eine Zeichenkette ist, wird die Zeichenkette (oder die ersten 10 Zeichen der Zeichenkette, wenn sie länger ist als das) vor jedem verschachtelten Objekt oder Array eingefügt. Wenn space alles außer einer Zeichenkette oder Zahl ist (kann entweder ein Primitiv oder ein Wrapper-Objekt sein) — z. B. null oder nicht angegeben — wird kein Leerzeichen verwendet",
  "_PAGE_FILTER_JSON_ARGUMENTS_": "# الحجج:  \nvalue (Any): القيمة أو كائن JavaScript الذي يجب تحويله إلى سلسلة JSON\n[replacer] (Function | Array): وظيفة تؤثر على سلوك عملية التحويل، أو مصفوفة من سلاسل النصوص والأرقام التي تحدد خصائص value التي يجب تضمينها في الناتج. إذا كان replacer مصفوفة، فسيتم تجاهل جميع العناصر في هذه المصفوفة التي ليست سلاسل نصوص أو أرقام (لا القيم البدائية ولا كائنات الغلاف)، بما في ذلك قيم الرموز، بالكامل. إذا كان replacer ليس وظيفة أو مصفوفة (مثل null أو غير محدد)، يتم تضمين جميع الخصائص القائمة على السلاسل النصية للكائن في السلسلة JSON الناتجة.\n[space=2] (Number | String): سلسلة نصية أو عدد يستخدم لإدخال المسافات (بما في ذلك الفراغات، والفواصل الخطية، إلخ) في سلسلة JSON الناتجة لأغراض القراءة. إذا كان هذا عددًا، فهو يشير إلى عدد المسافات أو الأحرف الأخرى التي يجب استخدامها كتعزيز، محدودًا بـ 10 كحد أقصى (أي أن أي عدد أكبر من 10 يعامل كما لو كان 10). تشير القيم أقل من 1 إلى عدم استخدام أي مسافة. إذا كانت سلسلة نصية، يتم إدراج السلسلة (أو أول 10 أحرف من السلسلة، إذا كانت أطول من ذلك) قبل كل كائن أو مصفوفة متداخلة. إذا كان space أي شيء غير سلسلة نصية أو عدد (يمكن أن يكون إما بدائيًا أو كائن غلاف) - مثل null أو غير محدد - لا يتم استخدام مسافة.",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "تقوم الوظيفة <strong>filterJson</strong> بتحويل كائن JavaScript أو قيمة إلى سلسلة JSON منسقة. تتيح تخصيص الـ replacer (وظيفة لتغيير سلوك التحويل) والمسافة البادئة (عدد المسافات أو الأحرف الأخرى للتعزيز)."
}
