{
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Der Wert oder das JavaScript-Objekt, das in eine JSON-Zeichenkette umgewandelt werden soll",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Eine Funktion, die das Verhalten des Umwandlungsprozesses beeinflusst, oder ein Array aus Zeichenketten und Zahlen, das Eigenschaften von value angibt, die in der Ausgabe enthalten sein sollen. Wenn replacer ein Array ist, werden alle Elemente in diesem Array, die keine Zeichenketten oder Zahlen sind (weder primitive Werte noch Wrapper-Objekte), einschließlich Symbol-Werte, vollständig ignoriert. Wenn replacer alles außer einer Funktion oder einem Array ist (z. B. null oder nicht angegeben), werden alle zeichenkettenbasierten Eigenschaften des Objekts in der resultierenden JSON-Zeichenkette aufgenommen",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Eine Zeichenkette oder eine Zahl, die für die Einfügung von Leerzeichen (einschließlich Einrückung, Zeilenumbruchzeichen usw.) in die Ausgabe-JSON-Zeichenkette zu Lesbarkeitszwecken verwendet wird. Wenn dies eine Zahl ist, gibt sie die Anzahl der Leerzeichen oder anderer Zeichen an, die als Einrückung verwendet werden sollen, auf maximal 10 begrenzt (dh jede Zahl größer als 10 wird so behandelt, als wäre sie 10). Werte kleiner als 1 zeigen an, dass kein Leerzeichen verwendet werden soll. Wenn dies eine Zeichenkette ist, wird die Zeichenkette (oder die ersten 10 Zeichen der Zeichenkette, wenn sie länger ist als das) vor jedem verschachtelten Objekt oder Array eingefügt. Wenn space alles außer einer Zeichenkette oder Zahl ist (kann entweder ein Primitiv oder ein Wrapper-Objekt sein) — z. B. null oder nicht angegeben — wird kein Leerzeichen verwendet",
  "_PAGE_FILTER_JSON_ARGUMENTS_": "# Argumenti:  \nvalue (proizvoljna vrijednnost): Vrijednost ili JavaScript objekt koji treba pretvoriti u JSON string\n[replacer] (funkcija | niz):  Funkcija koja utječe na ponašanje procesa pretvorbe ili niz stringova i brojeva koji specificiraju svojstva vrijednosti koja bi trebala biti uključena u rezultat. Ako je replacer niz, tada se sva svojstva u tom nizu koja nisu stringovi ili brojevi (niti primitivne vrijednosti niti wrapper objekti), uključujući i simbole, potpuno ignoriraju. Ako replacer nije ni funkcija ni niz (npr. null ili nije naveden), sva svojstva objekta bazirana na stringovima uključuju se u rezultirajući JSON string.\n[space=2] (cijeli broj | string): String ili broj koji se koristi za umetanje razmaka (uključujući uvlačenje, znakove za novi red itd.) u rezultirajući JSON string radi čitljivosti. Ako je ova vrijednost broj, ona označava broj razmaka ili drugih znakova koji će se koristiti za uvlačenje, ograničen na maksimalnih 10 (tj. bilo koji broj veći od 10 tretira se kao da je 10). Vrijednosti manje od 1 ukazuju da se ne koristi razmak. Ako je ova vrijednost string, taj string (ili njegovih prvih 10 znakova, ako je dulji od toga) umetnut će se prije svakog ugniježđenog objekta ili niza. Ako space nije ni string ni broj (može biti ili primitivna vrijednost ili wrapper objekt) — npr. null ili nije naveden — ne koristi se razmak.",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "Funkcija <strong>filterJson</strong> pretvara JavaScript objekt ili neku vrijednost u formatirani JSON string. Omogućuje prilagodbu replacera (funkcije koja mijenja ponašanje pretvorbe) i uvlačenja (broj razmaka ili drugih znakova za uvlačenje)."
}