{
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Der Wert oder das JavaScript-Objekt, das in eine JSON-Zeichenkette umgewandelt werden soll",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Eine Funktion, die das Verhalten des Umwandlungsprozesses beeinflusst, oder ein Array aus Zeichenketten und Zahlen, das Eigenschaften von value angibt, die in der Ausgabe enthalten sein sollen. Wenn replacer ein Array ist, werden alle Elemente in diesem Array, die keine Zeichenketten oder Zahlen sind (weder primitive Werte noch Wrapper-Objekte), einschließlich Symbol-Werte, vollständig ignoriert. Wenn replacer alles außer einer Funktion oder einem Array ist (z. B. null oder nicht angegeben), werden alle zeichenkettenbasierten Eigenschaften des Objekts in der resultierenden JSON-Zeichenkette aufgenommen",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Eine Zeichenkette oder eine Zahl, die für die Einfügung von Leerzeichen (einschließlich Einrückung, Zeilenumbruchzeichen usw.) in die Ausgabe-JSON-Zeichenkette zu Lesbarkeitszwecken verwendet wird. Wenn dies eine Zahl ist, gibt sie die Anzahl der Leerzeichen oder anderer Zeichen an, die als Einrückung verwendet werden sollen, auf maximal 10 begrenzt (dh jede Zahl größer als 10 wird so behandelt, als wäre sie 10). Werte kleiner als 1 zeigen an, dass kein Leerzeichen verwendet werden soll. Wenn dies eine Zeichenkette ist, wird die Zeichenkette (oder die ersten 10 Zeichen der Zeichenkette, wenn sie länger ist als das) vor jedem verschachtelten Objekt oder Array eingefügt. Wenn space alles außer einer Zeichenkette oder Zahl ist (kann entweder ein Primitiv oder ein Wrapper-Objekt sein) — z. B. null oder nicht angegeben — wird kein Leerzeichen verwendet",
  "_PAGE_FILTER_JSON_ARGUMENTS_": "# Argomenti:  \nvalue (Any): Il valore o l'oggetto JavaScript da convertire in una stringa JSON\n[replacer] (Function | Array): Una funzione che influenza il comportamento del processo di conversione, o un array di stringhe e numeri che specifica le proprietà di value da includere nel risultato. Se replacer è un array, tutti gli elementi in questo array che non sono né stringhe né numeri (né valori primitivi né oggetti wrapper), compresi i valori dei simboli, saranno completamente ignorati. Se replacer è qualcosa di diverso da una funzione o un array (ad esempio, null o non specificato), tutte le proprietà basate su stringhe dell'oggetto saranno incluse nella stringa JSON risultante.\n[space=2] (Number | String): Una stringa o un numero usato per inserire spazi (compresa l'indentazione, i caratteri di a capo, ecc.) nella stringa JSON di output per motivi di leggibilità. Se è un numero, indica il numero di spazi o altri caratteri da utilizzare per l'indentazione, limitato a un massimo di 10 (cioè, qualsiasi numero superiore a 10 sarà trattato come se fosse 10). Valori inferiori a 1 indicano che non devono essere utilizzati spazi. Se è una stringa, la stringa (o i primi 10 caratteri della stringa, se è più lunga di così) viene inserita prima di ogni oggetto o array annidato. Se space è qualcosa di diverso da una stringa o un numero (può essere sia un primitivo che un oggetto wrapper) — ad esempio, null o non specificato — nessuno spazio viene utilizzato.",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "La funzione <strong>filterJson</strong> converte un oggetto JavaScript o un valore in una stringa JSON formattata. Consente la personalizzazione del replacer (funzione che modifica il comportamento della conversione) e dell'indentazione (numero di spazi o altri caratteri per l'indentazione)."
}
