{
  "_A_INPUT_CURRENCY_COMPONENT_DESCRIPTION_": "يوفر المكون <strong lang=\"en\">AInputCurrency</strong> القدرة على إدخال وتنسيق قيم العملات. يدعم المكون خيارات متنوعة مثل إدارة رموز العملات، اختيار الفواصل، والقيام بتقريب الأرقام تلقائيًا.",
  "_A_INPUT_CURRENCY_COMPONENT_NAME_": "حقل إدخال العملة",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">controls-type</strong> لتكوين عرض عناصر التحكم في حقل الإدخال. في الحقل الأول، يتم تعطيل عناصر التحكم، بينما في الحقل الثاني، يتم استخدام أزرار '+' و '-' لزيادة أو تقليل القيمة. هذا يسمح باختيار الطريقة الأنسب للتحكم في القيمة حسب المتطلبات.",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_HEADER_": "أنواع عناصر التحكم",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">decimal-divider</strong> لتكوين فاصل الأجزاء العشرية في حقل الإدخال. في الحقل الأول، يتم استخدام الفاصلة <strong>','</strong> كفاصل، بينما في الثاني يتم استخدام النقطة <strong>'.'</strong>. يتيح هذا اختيار التنسيق المناسب لعرض القيم العشرية حسب الإعدادات الإقليمية أو تفضيلات المستخدم. \nمهم: يجب أن يكون الفاصل العشري وفاصل الآلاف مختلفين.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_HEADER_": "فاصل الأجزاء العشرية",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">decimal-part-length</strong> لتحديد عدد الأرقام بعد الفاصل العشري في المكون <strong lang=\"en\">AInputCurrency</strong>. في الحالة الأولى، يتم ضبط طول الجزء العشري على <strong>0</strong>، مما يعني عدم وجود جزء عشري. في المثال الثاني، يتم ضبط الطول على <strong>1</strong>، مما يتيح عرض رقم واحد بعد الفاصلة العشرية. في الأمثلة التالية، يتم ضبط طول الجزء العشري على <strong>2</strong> و <strong>4</strong>، مما يسمح بعرض القيم العشرية بدقة أكبر.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_HEADER_": "طول الجزء العشري",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">max</strong> و <strong lang=\"en\">min</strong> لتقييد القيم التي يمكن إدخالها في الحقل. في الحقل الأول، يكون الإدخال محدودًا بنطاق من <strong>1</strong> إلى <strong>20</strong>، بينما في الثاني، يكون النطاق محدودًا من <strong>-10.05</strong> إلى <strong>19.05</strong>. تساعد هذه الخصائص في التحكم في نطاق الأرقام المسموح بإدخالها.",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_HEADER_": "الحد الأقصى والأدنى",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">model-type</strong> لتحديد نوع البيانات التي سيتم تخزينها في النموذج. في الحالة الأولى، يتم تخزين القيمة كـ <strong lang=\"en\">number</strong>، بينما في الثانية يتم تخزينها كـ <strong lang=\"en\">string</strong>. تتيح هذه الخاصية إدارة نوع البيانات في النموذج بمرونة حسب متطلبات التطبيق.",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_HEADER_": "نوع النموذج",
  "_A_INPUT_CURRENCY_GROUP_STEP_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">step</strong> لتحديد قيمة الخطوة في المكون <strong lang=\"en\">AInputCurrency</strong>. في الحالة الأولى، يتم ضبط الخطوة على <strong>2</strong>، مما يسمح بزيادة أو تقليل القيمة بمقدار <strong>2</strong> وحدة في المرة الواحدة. في الحالة الثانية، يتم ضبط الخطوة على <strong>0.01</strong>، مما يسمح بالتحكم الدقيق في القيمة باستخدام أزرار التحكم. هذه الخاصية مفيدة لضبط دقة إدخال البيانات العددية.",
  "_A_INPUT_CURRENCY_GROUP_STEP_HEADER_": "قيمة خطوة التغيير",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">currency-symbol</strong> و <strong lang=\"en\">currency-symbol-position</strong> لعرض رمز العملة في حقل الإدخال. في الحقل الأول، يتم عرض رمز <strong>'%'</strong> إلى يمين القيمة المدخلة. في الحقلين الثاني والثالث، يتم عرض رمز <strong>'$'</strong> إلى يسار القيمة. يتيح ذلك تخصيص عرض رموز العملة بمرونة حسب المتطلبات.",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_HEADER_": "رموز العملات ومواقعها",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام خاصية <strong lang=\"en\">thousand-divider</strong> لتحديد فاصل الآلاف في المكون <strong lang=\"en\">AInputCurrency</strong>. في الحالة الأولى، يتم استخدام الفاصلة <strong>','</strong> كفاصل للآلاف. في المثال الثاني، يتم استخدام النقطة <strong>'.'</strong> كفاصل. في المثال الثالث، يتم استخدام المسافة <strong>' '</strong> كفاصل، بينما في المثال الأخير لا يوجد فاصل، مما يسمح بعرض الأرقام بدون فاصل الآلاف.مهم: يجب أن يكون الفاصل العشري وفاصل الآلاف مختلفين.",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_HEADER_": "فاصل الآلاف",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">validation-on-change</strong> في المكون <strong lang=\"en\">AInputCurrency</strong>. في المثال الأول، لا يتم التحقق من صحة القيم مع كل تغيير، حيث أن <strong lang=\"en\">validation-on-change</strong> تم تعيينه إلى <strong>false</strong>. في المثال الثاني، عندما يتم تعيين <strong lang=\"en\">validation-on-change</strong> إلى <strong>true</strong>، يتم التحقق من صحة القيم المدخلة فورًا عند التغيير.",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_HEADER_": "التحقق عند التغيير",
  "_A_INPUT_CURRENCY_PROPS_CONTROLS_TYPE_DESCRIPTION_": "تحدد نوع عناصر التحكم التي ستظهر بجانب حقل الإدخال. القيم المحتملة: <strong lang=\"en\">plus-minus</strong> (أزرار الزيادة والنقصان)، <strong lang=\"en\">arrows</strong> (الأسهم لتغيير القيم) أو <strong lang=\"en\">none</strong> (عدم وجود عناصر تحكم).",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_DESCRIPTION_": "يحدد رمز العملة الذي سيتم عرضه في حقل الإدخال، مثل <strong>$</strong>، <strong>€</strong> أو <strong>₽</strong>.",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_POSITION_DESCRIPTION_": "يحدد موقع رمز العملة بالنسبة للقيمة المدخلة. القيم المحتملة: <strong lang=\"en\">left</strong> (إلى يسار القيمة) أو <strong lang=\"en\">right</strong> (إلى يمين القيمة).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_DIVIDER_DESCRIPTION_": "يحدد الرمز الذي سيتم استخدامه كفاصل للأجزاء العشرية. القيم المحتملة <strong>.</strong> (نقطة) أو <strong>,</strong> (فاصلة).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_PART_LENGTH_DESCRIPTION_": "يحدد عدد الأرقام بعد الفاصل العشري التي سيتم عرضها في القيمة.",
  "_A_INPUT_CURRENCY_PROPS_INPUT_WIDTH_DESCRIPTION_": "يحدد عرض حقل الإدخال. يمكن تحديد القيمة بالبكسل أو بالنسبة المئوية.",
  "_A_INPUT_CURRENCY_PROPS_MAX_DESCRIPTION_": "يحدد القيمة القصوى التي يمكن إدخالها في الحقل.",
  "_A_INPUT_CURRENCY_PROPS_MIN_DESCRIPTION_": "يحدد القيمة الدنيا التي يمكن إدخالها في الحقل.",
  "_A_INPUT_CURRENCY_PROPS_MODEL_TYPE_DESCRIPTION_": "يحدد نوع البيانات التي سيتم تخزينها في النموذج. القيم المحتملة <strong lang=\"en\">number</strong> (قيمة عددية) أو <strong lang=\"en\">string</strong> (قيمة نصية).",
  "_A_INPUT_CURRENCY_PROPS_THOUSAND_DIVIDER_DESCRIPTION_": "يحدد الرمز المستخدم لفصل الآلاف في القيمة. القيم المحتملة <strong>.</strong> (نقطة)، <strong>,</strong> (فاصلة) أو سلسلة فارغة (بدون فاصل).",
  "_A_INPUT_CURRENCY_PROPS_VALIDATION_ON_CHANGE_DESCRIPTION_": "إذا تم تعيينه إلى <strong lang=\"en\">true</strong>، سيتم التحقق من صحة القيمة المدخلة مع كل تغيير في الحقل."
}