{
  "_A_INPUT_CURRENCY_COMPONENT_DESCRIPTION_": "Компонент <strong lang=\"en\">AInputCurrency</strong> предоставляет возможность ввода и форматирования валютных значений. Компонент поддерживает различные опции, такие как управление символами валюты, выбор разделителей, а также автоматическое округление чисел.",
  "_A_INPUT_CURRENCY_COMPONENT_NAME_": "Поле ввода валюты",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">controls-type</strong> для настройки отображения управляющих элементов в поле ввода. В первом поле управляющие элементы отключены, а во втором — используются кнопки '+' и '-' для увеличения или уменьшения значения. Это позволяет выбирать наиболее подходящий способ управления значением в зависимости от требований.",
  "_A_INPUT_CURRENCY_GROUP_CONTROLS_TYPE_HEADER_": "Типы управляющих элементов",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">decimal-divider</strong> для настройки разделителя дробной части в поле ввода. В первом поле в качестве разделителя используется запятая <strong>','</strong>, а во втором — точка <strong>'.'</strong>. Это позволяет выбрать подходящий формат отображения дробных значений в зависимости от региональных настроек или предпочтений пользователя.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_DIVIDER_HEADER_": "Разделитель дробной части",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">decimal-part-length</strong> для задания количества цифр после десятичного разделителя в компоненте <strong lang=\"en\">AInputCurrency</strong>. В первом случае длина десятичной части установлена на <strong>0</strong>, что означает отсутствие дробной части. Во втором примере длина установлена на <strong>1</strong>, что позволяет отображать одну цифру после десятичной запятой. В следующих примерах длина десятичной части установлена на <strong>2</strong> и <strong>4</strong>, что позволяет более точно отображать дробные значения.",
  "_A_INPUT_CURRENCY_GROUP_DECIMAL_PART_LENGTH_HEADER_": "Длина десятичной части",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">max</strong> и <strong lang=\"en\">min</strong> для ограничения значений, которые можно ввести в поле. В первом поле ввод ограничен диапазоном от <strong>1</strong> до <strong>20</strong>, а во втором — от <strong>-10.05</strong> до <strong>19.05</strong>. Эти свойства помогают контролировать допустимый диапазон вводимых чисел.",
  "_A_INPUT_CURRENCY_GROUP_MAX_MIN_HEADER_": "Ограничения по максимуму и минимуму",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">model-type</strong> для определения типа данных, которые будут сохраняться в модели. В первом случае значение сохраняется как <strong lang=\"en\">number</strong> (число), а во втором — как <strong lang=\"en\">string</strong> (строка). Это свойство позволяет гибко управлять типом данных в модели в зависимости от требований приложения.",
  "_A_INPUT_CURRENCY_GROUP_MODEL_TYPE_HEADER_": "Тип модели",
  "_A_INPUT_CURRENCY_GROUP_STEP_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">step</strong> для задания шага изменения значения в компоненте <strong lang=\"en\">AInputCurrency</strong>. В первом случае шаг изменения установлен на <strong>2</strong>, что позволяет увеличивать или уменьшать значение на <strong>2</strong> единицы за один раз. Во втором случае шаг установлен на <strong>0,01</strong>, что позволяет более точно регулировать значение с помощью кнопок управления. Это свойство полезно для настройки точности ввода числовых данных.",
  "_A_INPUT_CURRENCY_GROUP_STEP_HEADER_": "Шаг изменения значения",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">currency-symbol</strong> и <strong lang=\"en\">currency-symbol-position</strong> для отображения символа валюты в поле ввода. В первом поле символ <strong>'%'</strong> отображается справа от введенного значения. Во втором и третьем полях символ <strong>'$'</strong> отображается слева от значения. Это позволяет гибко настраивать отображение валютных символов в зависимости от требований.",
  "_A_INPUT_CURRENCY_GROUP_SYMBOL_HEADER_": "Символы валюты и их позиции",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_DESCRIPTION_": "В этом примере показано, как использовать свойство <strong lang=\"en\">thousand-divider</strong> для задания разделителя тысяч в компоненте <strong lang=\"en\">AInputCurrency</strong>. В первом случае разделителем тысяч является запятая <strong>','</strong>. Во втором примере используется точка <strong>'.'</strong> в качестве разделителя. В третьем примере разделителем является пробел <strong>' '</strong>, а в последнем примере разделитель отсутствует, что позволяет отображать числа без разделения тысяч.",
  "_A_INPUT_CURRENCY_GROUP_THOUSAND_DIVIDER_HEADER_": "Разделитель тысяч",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_DESCRIPTION_": "В этом примере показано, как использовать <strong lang=\"en\">validation-on-change</strong> в компоненте <strong lang=\"en\">AInputCurrency</strong>. В первом примере валидация значений не выполняется при каждом изменении, так как <strong lang=\"en\">validation-on-change</strong> установлено в <strong>false</strong>. Во втором примере, когда <strong lang=\"en\">validation-on-change</strong> установлено в <strong>true</strong>, вводимые значения проверяются на корректность сразу при изменении.",
  "_A_INPUT_CURRENCY_GROUP_VALIDATION_ON_CHANGE_HEADER_": "Валидация при изменении",
  "_A_INPUT_CURRENCY_PROPS_CONTROLS_TYPE_DESCRIPTION_": "Определяет тип элементов управления, которые будут отображаться рядом с полем ввода. Возможные значения: <strong lang=\"en\">plus-minus</strong> (кнопки увеличения и уменьшения), <strong lang=\"en\">arrows</strong> (стрелки для изменения значений) или <strong lang=\"en\">none</strong> (отсутствие элементов управления).",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_DESCRIPTION_": "Задает символ валюты, который будет отображаться в поле ввода. Например, <strong>$</strong>, <strong>€</strong> или <strong>₽</strong>.",
  "_A_INPUT_CURRENCY_PROPS_CURRENCY_SYMBOL_POSITION_DESCRIPTION_": "Определяет позицию символа валюты относительно введенного значения. Возможные значения: <strong lang=\"en\">left</strong> (слева от значения) или <strong lang=\"en\">right</strong> (справа от значения).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_DIVIDER_DESCRIPTION_": "Определяет символ, который будет использоваться в качестве разделителя десятичных дробей. Возможные значения: <strong>.</strong> (точка) или <strong>,</strong> (запятая).",
  "_A_INPUT_CURRENCY_PROPS_DECIMAL_PART_LENGTH_DESCRIPTION_": "Определяет количество символов после десятичного разделителя, которые будут отображаться в значении.",
  "_A_INPUT_CURRENCY_PROPS_INPUT_WIDTH_DESCRIPTION_": "Задает ширину поля ввода. Значение может быть указано в пикселях или в процентах.",
  "_A_INPUT_CURRENCY_PROPS_MAX_DESCRIPTION_": "Задает максимальное значение, которое может быть введено в поле.",
  "_A_INPUT_CURRENCY_PROPS_MIN_DESCRIPTION_": "Задает минимальное значение, которое может быть введено в поле.",
  "_A_INPUT_CURRENCY_PROPS_MODEL_TYPE_DESCRIPTION_": "Определяет тип данных, который будет сохранен в модели. Возможные значения: <strong lang=\"en\">number</strong> (числовое значение) или <strong lang=\"en\">string</strong> (строковое значение).",
  "_A_INPUT_CURRENCY_PROPS_THOUSAND_DIVIDER_DESCRIPTION_": "Определяет символ, используемый для разделения тысяч в значении. Возможные значения: <strong>.</strong> (точка), <strong>,</strong> (запятая) или пустая строка (без разделителя).",
  "_A_INPUT_CURRENCY_PROPS_VALIDATION_ON_CHANGE_DESCRIPTION_": "Если установлено в <strong lang=\"en\">true</strong>, проверка допустимости введенного значения будет выполняться при каждом изменении значения в поле."
}