{
  "_A_MODAL_COMPONENT_DESCRIPTION_": "AModal es un componente que permite la implementación de ventanas modales. Ofrece una multitud de opciones de personalización, incluyendo varios parámetros para el contenido, el comportamiento de los botones, controles de visibilidad y ajustes de tamaño. Con espacios personalizables para el encabezado, el cuerpo y el pie de página, permite un estilo flexible de ventanas modales para diversas situaciones de uso.",
  "_A_MODAL_COMPONENT_NAME_": "Ventana Modal",
  "_A_MODAL_GROUP_BODY_HTML_DESCRIPTION_": "La propiedad <strong>body-html</strong> se utiliza para mostrar contenido HTML personalizado en la ventana modal.",
  "_A_MODAL_GROUP_BODY_HTML_HEADER_": "Uso de <strong>body-html</strong>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_DESCRIPTION_": "<p>Este ejemplo demuestra diversas opciones para personalizar el botón de cierre.</p><p>Aquí, se utilizan las propiedades <strong>close-button-attributes</strong>, <strong>close-button-class</strong>, <strong>close-button-id</strong> y <strong>close-button-text</strong> para personalizar el botón de cierre. Se le asigna un texto personalizado, clases personalizadas y un ID personalizado, y el texto del botón se carga desde un archivo de traducción.</p>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_HEADER_": "Personalización del Botón de Cierre",
  "_A_MODAL_GROUP_FOOTER_STICKY_DESCRIPTION_": "Ejemplo de una ventana modal con un pie de página fijado en la parte inferior que permanece en su lugar mientras se desplaza el contenido.",
  "_A_MODAL_GROUP_FOOTER_STICKY_HEADER_": "Ventana Modal con Pie de Página Fijo",
  "_A_MODAL_GROUP_SAVE_BUTTON_DESCRIPTION_": "<p>Este ejemplo demuestra diversas opciones para personalizar el botón de guardar.</p><p>Aquí, se utilizan las propiedades <strong>save</strong>, <strong>save-button-attributes</strong>, <strong>save-button-class</strong> y <strong>save-button-id</strong> para personalizar el botón de guardar. Se le asigna un texto personalizado, clases personalizadas y un ID personalizado.</p>",
  "_A_MODAL_GROUP_SAVE_BUTTON_HEADER_": "Personalización del Botón de Guardar",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_DESCRIPTION_": "<p>Este ejemplo demuestra el uso de <strong>selector-close</strong> para establecer el enfoque en elementos específicos después de cerrar la ventana modal.</p><p>Se establece el enfoque en los elementos con los ID 'btn_aloha' y 'btn_open_modal' después de cerrar la ventana modal. Esto ayuda a mantener el enfoque en el navegador.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_HEADER_": "Uso de <strong>selector-close</strong> para el Enfoque",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_DESCRIPTION_": "<p>Este ejemplo demuestra el uso de <strong>selector-close-ids</strong> para establecer el enfoque en elementos específicos con IDs después de cerrar la ventana modal.</p><p>Se establece el enfoque en los elementos con los ID 'btn_aloha' y 'btn_open_modal_id' después de cerrar la ventana modal. Esto ayuda a mantener el enfoque en el navegador.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_HEADER_": "Uso de <strong>selector-close-ids</strong> para el Enfoque",
  "_A_MODAL_GROUP_SIZE_DESCRIPTION_": "<p>Este ejemplo demuestra el uso de la propiedad <strong>size</strong> para ajustar el tamaño de la ventana modal según sea necesario.</p><p>El tamaño de la ventana modal se basa en opciones como 'pequeño', 'grande', 'xl', 'xxl' y 'pantalla completa'.</p>",
  "_A_MODAL_GROUP_SIZE_HEADER_": "Uso de la Propiedad <strong>size</strong> para Controlar el Tamaño de la Ventana Modal",
  "_A_MODAL_GROUP_SLOTS_DESCRIPTION_": "Este ejemplo demuestra el uso de ranuras (slots) diversas para personalizar el contenido en la ventana modal.",
  "_A_MODAL_GROUP_SLOTS_HEADER_": "Uso de Ranuras para el Contenido de la Ventana Modal",
  "_A_MODAL_PAGE_BTN_CLOSE_": "Cerrar",
  "_A_MODAL_PAGE_BTN_OPEN_MODAL_": "Abrir Ventana Modal",
  "_A_MODAL_PROPS_BACKDROP_Z_INDEX_DESCRIPTION_": "Si se establece, esta propiedad especifica el z-index de CSS para el fondo de la ventana modal.",
  "_A_MODAL_PROPS_BODY_HTML_DESCRIPTION_": "El contenido HTML de la ventana modal.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Atributos para el botón de cierre de la ventana modal. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_CLASS_DESCRIPTION_": "La clase o clases del botón de cierre. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ID_DESCRIPTION_": "El ID del botón de cierre.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_TEXT_DESCRIPTION_": "El texto en el botón de cierre.",
  "_A_MODAL_PROPS_CLOSE_DESCRIPTION_": "La función que permite cerrar la ventana modal.",
  "_A_MODAL_PROPS_DISABLED_DESCRIPTION_": "Especifica si la ventana modal está deshabilitada.",
  "_A_MODAL_PROPS_DISABLED_SAVE_DESCRIPTION_": "Especifica si el botón de guardar en la ventana modal está deshabilitado.",
  "_A_MODAL_PROPS_EXTRA_DESCRIPTION_": "Un objeto con parámetros para las traducciones. <a href=\"/#/translation\">(ATranslation)</a>",
  "_A_MODAL_PROPS_HEADER_TAG_DESCRIPTION_": "La etiqueta HTML para el encabezado de la ventana modal.",
  "_A_MODAL_PROPS_HEADER_TEXT_DESCRIPTION_": "El texto en el encabezado de la ventana modal.",
  "_A_MODAL_PROPS_HIDE_FOOTER_DESCRIPTION_": "Especifica si se debe ocultar el pie de página en la ventana modal.",
  "_A_MODAL_PROPS_ID_DESCRIPTION_": "El ID de la ventana modal.",
  "_A_MODAL_PROPS_IS_CLOSE_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón de cierre es visible.",
  "_A_MODAL_PROPS_IS_CONFIRM_DESCRIPTION_": "Especifica si la ventana modal requiere confirmación. (Solo para <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_FOOTER_STICKY_DESCRIPTION_": "Determina si el pie de página está fijado en la parte inferior de la ventana modal.",
  "_A_MODAL_PROPS_IS_MODAL_HIDDEN_DESCRIPTION_": "Determina si la ventana modal está oculta. (Solo para <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_SAVE_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón de guardar es visible.",
  "_A_MODAL_PROPS_LOADING_DESCRIPTION_": "Especifica si la ventana modal está en estado de carga.",
  "_A_MODAL_PROPS_MODAL_CLASS_DESCRIPTION_": "La clase o clases de la ventana modal.",
  "_A_MODAL_PROPS_SAVE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Atributos para el botón de guardar en la ventana modal. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_CLASS_DESCRIPTION_": "La clase o clases del botón de guardar. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_ID_DESCRIPTION_": "El ID del botón de guardar.",
  "_A_MODAL_PROPS_SAVE_BUTTON_TEXT_DESCRIPTION_": "El texto en el botón de guardar.",
  "_A_MODAL_PROPS_SAVE_DESCRIPTION_": "La función que permite guardar en la ventana modal.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_DESCRIPTION_": "El selector de enfoque para asegurar que no se pierda el enfoque en el navegador al cerrar la ventana modal.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_IDS_DESCRIPTION_": "El ID o IDs para el enfoque para asegurar que no se pierda el enfoque en el navegador al cerrar la ventana modal.",
  "_A_MODAL_PROPS_SHOW_CLOSE_BUTTON_DESCRIPTION_": "Determina si se debe mostrar el botón de cerrar (\"x\") en el encabezado de la ventana modal.",
  "_A_MODAL_PROPS_SIZE_DESCRIPTION_": "El tamaño de la ventana modal (pequeño, grande, xl, xxl, pantalla completa).",
  "_A_MODAL_PROPS_STOP_DESCRIPTION_": "Añade un evento de clic con stopPropagation al elemento padre de la ventana modal para evitar que el evento se propague más.",
  "_A_MODAL_PROPS_USE_ESCAPE_DESCRIPTION_": "Especifica si la tecla Escape puede cerrar la ventana modal.",
  "_A_MODAL_PROPS_Z_INDEX_DESCRIPTION_": "Especifica el z-index de CSS para la ventana modal en sí.",
  "_A_MODAL_SLOTS_MODAL_BODY_DESCRIPTION_": "Una ranura que contiene el contenido principal de la ventana modal.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_APPEND_DESCRIPTION_": "Una ranura que se muestra después de los botones de guardar y cerrar en el pie de página de la ventana modal.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_PREPEND_DESCRIPTION_": "Una ranura que se muestra antes de los botones de guardar y cerrar en el pie de página de la ventana modal.",
  "_A_MODAL_SLOTS_MODAL_HEADER_DESCRIPTION_": "Una ranura que contiene el contenido del encabezado de la ventana modal."
}
