{
  "_A_MODAL_COMPONENT_DESCRIPTION_": "AModal est un composant qui permet la mise en œuvre de fenêtres modales. Il offre de nombreuses options de personnalisation, notamment divers paramètres pour le contenu, le comportement des boutons, les contrôles de visibilité et les ajustements de taille. Avec des emplacements personnalisables pour l'en-tête, le corps et le pied de page, il permet de styliser de manière flexible les fenêtres modales pour divers cas d'utilisation.",
  "_A_MODAL_COMPONENT_NAME_": "Fenêtre Modale",
  "_A_MODAL_GROUP_BODY_HTML_DESCRIPTION_": "La propriété <strong>body-html</strong> est utilisée pour afficher un contenu HTML personnalisé dans la fenêtre modale.",
  "_A_MODAL_GROUP_BODY_HTML_HEADER_": "Utilisation de <strong>body-html</strong>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_DESCRIPTION_": "<p>Cet exemple présente diverses options de personnalisation du bouton de fermeture.</p><p>Ici, les propriétés <strong>close-button-attributes</strong>, <strong>close-button-class</strong>, <strong>close-button-id</strong> et <strong>close-button-text</strong> sont utilisées pour personnaliser le bouton de fermeture. Le bouton de fermeture reçoit une étiquette de texte personnalisée, des classes personnalisées et un ID personnalisé, et le texte du bouton est chargé à partir d'un fichier de traduction.</p>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_HEADER_": "Personnalisation du Bouton de Fermeture",
  "_A_MODAL_GROUP_FOOTER_STICKY_DESCRIPTION_": "Exemple de fenêtre modale avec un pied de page fixé en bas qui reste en place lors du défilement du contenu.",
  "_A_MODAL_GROUP_FOOTER_STICKY_HEADER_": "Fenêtre modale avec pied de page fixe",
  "_A_MODAL_GROUP_SAVE_BUTTON_DESCRIPTION_": "<p>Cet exemple présente diverses options de personnalisation du bouton de sauvegarde.</p><p>Ici, les propriétés <strong>save</strong>, <strong>save-button-attributes</strong>, <strong>save-button-class</strong> et <strong>save-button-id</strong> sont utilisées pour personnaliser le bouton de sauvegarde. Le bouton de sauvegarde reçoit une étiquette de texte personnalisée, des classes personnalisées et un ID personnalisé.</p>",
  "_A_MODAL_GROUP_SAVE_BUTTON_HEADER_": "Personnalisation du Bouton de Sauvegarde",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_DESCRIPTION_": "<p>Cet exemple montre l'utilisation de <strong>selector-close</strong> pour définir le focus sur des éléments spécifiques après la fermeture de la fenêtre modale.</p><p>Le focus est défini sur les éléments ayant les ID 'btn_aloha' et 'btn_open_modal' après la fermeture de la fenêtre modale. Cela contribue à maintenir le focus dans le navigateur.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_HEADER_": "Utilisation de <strong>selector-close</strong> pour le Focus",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_DESCRIPTION_": "<p>Cet exemple montre l'utilisation de <strong>selector-close-ids</strong> pour définir le focus sur des éléments spécifiques ayant des IDs après la fermeture de la fenêtre modale.</p><p>Le focus est défini sur les éléments ayant les IDs 'btn_aloha' et 'btn_open_modal_id' après la fermeture de la fenêtre modale. Cela contribue à maintenir le focus dans le navigateur.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_HEADER_": "Utilisation de <strong>selector-close-ids</strong> pour le Focus",
  "_A_MODAL_GROUP_SIZE_DESCRIPTION_": "<p>Cet exemple montre l'utilisation de la propriété <strong>size</strong> pour ajuster la taille de la fenêtre modale selon les besoins.</p><p>La taille de la fenêtre modale est basée sur des options telles que 'petite', 'grande', 'xl', 'xxl' et 'plein écran'.</p>",
  "_A_MODAL_GROUP_SIZE_HEADER_": "Utilisation de la Propriété <strong>size</strong> pour Contrôler la Taille de la Fenêtre Modale",
  "_A_MODAL_GROUP_SLOTS_DESCRIPTION_": "Cet exemple montre l'utilisation de différents emplacements pour personnaliser le contenu de la fenêtre modale.",
  "_A_MODAL_GROUP_SLOTS_HEADER_": "Utilisation des Emplacements pour le Contenu de la Fenêtre Modale",
  "_A_MODAL_PAGE_BTN_CLOSE_": "Fermer",
  "_A_MODAL_PAGE_BTN_OPEN_MODAL_": "Ouvrir la Fenêtre Modale",
  "_A_MODAL_PROPS_BACKDROP_Z_INDEX_DESCRIPTION_": "Si défini, cette propriété spécifie le z-index CSS pour l'arrière-plan de la fenêtre modale.",
  "_A_MODAL_PROPS_BODY_HTML_DESCRIPTION_": "Le contenu HTML de la fenêtre modale.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributs pour le bouton de fermeture de la fenêtre modale. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_CLASS_DESCRIPTION_": "La classe ou les classes du bouton de fermeture. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ID_DESCRIPTION_": "L'ID du bouton de fermeture.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_TEXT_DESCRIPTION_": "Le texte sur le bouton de fermeture.",
  "_A_MODAL_PROPS_CLOSE_DESCRIPTION_": "La fonction qui permet de fermer la fenêtre modale.",
  "_A_MODAL_PROPS_DISABLED_DESCRIPTION_": "Spécifie si la fenêtre modale est désactivée.",
  "_A_MODAL_PROPS_DISABLED_SAVE_DESCRIPTION_": "Spécifie si le bouton de sauvegarde dans la fenêtre modale est désactivé.",
  "_A_MODAL_PROPS_EXTRA_DESCRIPTION_": "Un objet avec des paramètres pour les traductions. <a href=\"/#/translation\">(ATranslation)</a>",
  "_A_MODAL_PROPS_HEADER_TAG_DESCRIPTION_": "La balise HTML pour l'en-tête de la fenêtre modale.",
  "_A_MODAL_PROPS_HEADER_TEXT_DESCRIPTION_": "Le texte dans l'en-tête de la fenêtre modale.",
  "_A_MODAL_PROPS_HIDE_FOOTER_DESCRIPTION_": "Spécifie s'il faut masquer le pied de page dans la fenêtre modale.",
  "_A_MODAL_PROPS_ID_DESCRIPTION_": "L'ID de la fenêtre modale.",
  "_A_MODAL_PROPS_IS_CLOSE_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton de fermeture est visible.",
  "_A_MODAL_PROPS_IS_CONFIRM_DESCRIPTION_": "Spécifie si la fenêtre modale nécessite une confirmation. (Uniquement pour <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_FOOTER_STICKY_DESCRIPTION_": "Détermine si le pied de page est fixé en bas de la fenêtre modale.",
  "_A_MODAL_PROPS_IS_MODAL_HIDDEN_DESCRIPTION_": "Détermine si la fenêtre modale est masquée. (Uniquement pour <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_SAVE_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton de sauvegarde est visible.",
  "_A_MODAL_PROPS_LOADING_DESCRIPTION_": "Spécifie si la fenêtre modale est en cours de chargement.",
  "_A_MODAL_PROPS_MODAL_CLASS_DESCRIPTION_": "La classe ou les classes de la fenêtre modale.",
  "_A_MODAL_PROPS_MODAL_STYLE_DESCRIPTION_": "Le style ou les styles de la fenêtre modale.",
  "_A_MODAL_PROPS_SAVE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributs pour le bouton de sauvegarde dans la fenêtre modale. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_CLASS_DESCRIPTION_": "La classe ou les classes du bouton de sauvegarde. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_ID_DESCRIPTION_": "L'ID du bouton de sauvegarde.",
  "_A_MODAL_PROPS_SAVE_BUTTON_TEXT_DESCRIPTION_": "Le texte sur le bouton de sauvegarde.",
  "_A_MODAL_PROPS_SAVE_DESCRIPTION_": "La fonction qui permet de sauvegarder dans la fenêtre modale.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_DESCRIPTION_": "Le sélecteur de focus pour s'assurer que le focus n'est pas perdu dans le navigateur lors de la fermeture de la fenêtre modale.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_IDS_DESCRIPTION_": "L'ID ou les ID pour le focus afin de s'assurer que le focus n'est pas perdu dans le navigateur lors de la fermeture de la fenêtre modale.",
  "_A_MODAL_PROPS_SHOW_CLOSE_BUTTON_HEADER_DESCRIPTION_": "Détermine s'il faut afficher le bouton de fermeture (\"x\") dans l'en-tête de la fenêtre modale.",
  "_A_MODAL_PROPS_SIZE_DESCRIPTION_": "La taille de la fenêtre modale (petite, grande, xl, xxl, plein écran).",
  "_A_MODAL_PROPS_STOP_DESCRIPTION_": "Ajoute un événement de clic avec stopPropagation à l'élément parent de la fenêtre modale pour empêcher la propagation de l'événement.",
  "_A_MODAL_PROPS_USE_ESCAPE_DESCRIPTION_": "Spécifie si la touche Échap peut fermer la fenêtre modale.",
  "_A_MODAL_PROPS_Z_INDEX_DESCRIPTION_": "Spécifie le z-index CSS pour la fenêtre modale elle-même.",
  "_A_MODAL_SLOTS_MODAL_BODY_DESCRIPTION_": "Un emplacement contenant le contenu principal de la fenêtre modale.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_APPEND_DESCRIPTION_": "Un emplacement affiché après les boutons de sauvegarde et de fermeture dans le pied de page de la fenêtre modale.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_PREPEND_DESCRIPTION_": "Un emplacement affiché avant les boutons de sauvegarde et de fermeture dans le pied de page de la fenêtre modale.",
  "_A_MODAL_SLOTS_MODAL_HEADER_DESCRIPTION_": "Un emplacement contenant le contenu de l'en-tête de la fenêtre modale."
}
