{
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "The ADropdown component is a dropdown component for Vue.js that allows you to display a list of actions in a dropdown menu. This documentation provides information on how to use the component and describes the available props.",
  "_A_DROPDOWN_COMPONENT_NAME_": "Dropdown",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "The class of the dropdown button can be customized using the <strong>button-class</strong> prop.",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Customizable Button Class",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_DESCRIPTION_": "Icons before and after the text of the dropdown button can be customized using the props <strong>button-icon-left</strong> and <strong>button-icon-right</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_HEADER_": "Customizable Button Icons",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_DESCRIPTION_": "The loading state of the dropdown button can be customized using the props <strong>button-loading</strong> and <strong>button-loading-align</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_HEADER_": "Dropdown Button Loading State",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "This documentation describes the <strong>button-text</strong> prop, which allows you to customize the text of the dropdown button.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Customizable Button Text",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "The dropdown's caret icon can be customized.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Customizable Caret Icon",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "The ADropdown component for Vue.js allows you to customize the display of the caret icon. This documentation describes the <strong>has-caret</strong> prop, which controls whether the caret icon is displayed or not.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Customizable Caret Icon Display",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "The <strong>in-body</strong> prop controls whether the dropdown content should be rendered in the body or directly after the dropdown button.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Dropdown Content in Body or Directly After Dropdown Button",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "The ADropdown component for Vue.js provides the ability to customize the triggers for the dropdown. This documentation describes the <strong>triggers</strong> prop, which defines the array of triggers.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Customizable Dropdown Triggers",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "This prop allows you to customize the class of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_": "These props enable you to display the icon before the text of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_": "These props enable you to display the icon after the text of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_": "This prop allows you to control the loading state of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_": "This prop allows you to adjust the position of the loading state within the button.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "This prop allows you to customize the text of the dropdown button.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "This prop allows you to customize the caret icon of the dropdown.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "This prop allows you to specify whether the caret icon should be displayed in the dropdown component.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "This prop allows you to control whether the dropdown content should be rendered in the body or directly after the dropdown button.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "Allows setting triggers that display the dropdown menu.",
  "_A_DROPDOWN_PROPS_ACTIONS_DESCRIPTION_": "A list of actions to choose from.",
  "_A_DROPDOWN_PROPS_BUTTON_ATTRIBUTES_DESCRIPTION_": "Additional attributes for customizing the dropdown button. The attributes are passed as an object containing the names of the desired attributes and their corresponding values.",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_DESCRIPTION_": "Specifies an additional class for the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_ATTRIBUTES_DESCRIPTION_": "Additional attributes for the dropdown button icon. The attributes are passed as an object containing the names of the desired attributes and their corresponding values.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_CLASS_DESCRIPTION_": "Specifies an additional class for the dropdown button icon.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_DESCRIPTION_": "Defines the icon on the left side of the dropdown button. The icon name is passed as a string, or different icons for different devices can be defined as an object.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_DESCRIPTION_": "Defines the icon on the right side of the dropdown button. The icon name is passed as a string, or different icons for different devices can be defined as an object.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_TAG_DESCRIPTION_": "Specifies a custom HTML tag for the dropdown button icon.",
  "_A_DROPDOWN_PROPS_BUTTON_IS_TITLE_HTML_DESCRIPTION_": "Determines whether the tooltip displayed on mouse hover over the link will be in plain text or HTML format.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_DESCRIPTION_": "Displays a loading indicator on the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_DESCRIPTION_": "CSS positioning of the loading indicator on the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_CLASS_DESCRIPTION_": "CSS class for the dropdown button loading indicator.",
  "_A_DROPDOWN_PROPS_BUTTON_PREVENT_DESCRIPTION_": "Determines whether the default behavior of event handlers for the dropdown button will be prevented.",
  "_A_DROPDOWN_PROPS_BUTTON_STOP_DESCRIPTION_": "Specifies whether further event propagation for the dropdown button will be stopped.",
  "_A_DROPDOWN_PROPS_BUTTON_TAG_DESCRIPTION_": "Specifies the HTML tag to be used for the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_DESCRIPTION_": "A string or object containing the dropdown button text for different devices. The keys 'mobile' and 'desktop' are used to define the appropriate text for each device.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Determines whether the dropdown button text will be hidden from screen readers.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_CLASS_DESCRIPTION_": "CSS class for the dropdown button text.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_SCREEN_READER_DESCRIPTION_": "Dropdown button text for screen readers.",
  "_A_DROPDOWN_PROPS_BUTTON_TITLE_DESCRIPTION_": "One or more additional pieces of information that will be displayed when hovering over the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_TITLE_PLACEMENT_DESCRIPTION_": "The position relative to the dropdown button where the tooltip will be displayed. It only works if is-title-html is set to true.",
  "_A_DROPDOWN_PROPS_CARET_ICON_DESCRIPTION_": "Caret icon next to the dropdown button. The default is a downward arrow.",
  "_A_DROPDOWN_PROPS_CLASS_DESCRIPTION_": "Additional CSS class for the dropdown menu.",
  "_A_DROPDOWN_PROPS_DISABLED_DESCRIPTION_": "Indicator of a disabled state.",
  "_A_DROPDOWN_PROPS_DROPDOWN_ATTRIBUTES_DESCRIPTION_": "Additional dropdown attributes that are not defined as props.",
  "_A_DROPDOWN_PROPS_DROPDOWN_CLASS_DESCRIPTION_": "Additional CSS class for the dropdown menu.",
  "_A_DROPDOWN_PROPS_DROPDOWN_RENDER_DEFAULT_DESCRIPTION_": "Determines whether the dropdown menu will initially be open. The default value is false.",
  "_A_DROPDOWN_PROPS_DROPDOWN_TAG_DESCRIPTION_": "Specifies the HTML tag to be used for dropdown menu elements. The default value is ul.",
  "_A_DROPDOWN_PROPS_ELEMENTS_FOR_ARROWS_DESCRIPTION_": "Defines the elements that can be navigated with the arrows within the drop-down menu.",
  "_A_DROPDOWN_PROPS_EXTRA_DESCRIPTION_": "Additional values used for insertion into translations.",
  "_A_DROPDOWN_PROPS_FLOATING_FLIP_DESCRIPTION_": "Configuration for the flip function. It optimizes the visibility of the dropdown menu by changing its position along the x-axis to keep it in view when the preferred position is out of bounds.",
  "_A_DROPDOWN_PROPS_FLOATING_SHIFT_DESCRIPTION_": "Configuration for the shift function. It optimizes the visibility of the dropdown menu by changing its position along the y-axis to keep it in view when the preferred position is out of bounds.",
  "_A_DROPDOWN_PROPS_HAS_CARET_DESCRIPTION_": "Determines whether there is an icon next to the dropdown button. The default value is true.",
  "_A_DROPDOWN_PROPS_ID_DESCRIPTION_": "Specifies a unique ID for the HTML element corresponding to the dropdown menu.",
  "_A_DROPDOWN_PROPS_IN_BODY_DESCRIPTION_": "Determines whether the content of the dropdown menu is generated in the body or immediately after the dropdown button.",
  "_A_DROPDOWN_PROPS_IS_CLOSE_BY_CLICK_INSIDE_DESCRIPTION_": "Determines whether the component will close when the user clicks inside it.",
  "_A_DROPDOWN_PROPS_IS_CLOSE_BY_CLICK_OUTSIDE_DESCRIPTION_": "Determines whether the component will close when the user clicks outside it.",
  "_A_DROPDOWN_PROPS_IS_HIDE_WITHOUT_ACTION_AND_SLOT_DESCRIPTION_": "Determines whether the dropdown menu will exist at all if there are no selectable options or defined slots.",
  "_A_DROPDOWN_PROPS_IS_LIST_WIDTH_SAME_WITH_BUTTON_DESCRIPTION_": "Determines whether the width of the dropdown button is the same as the width of the selection list.",
  "_A_DROPDOWN_PROPS_LOCK_ARROWS_NAVIGATION_DESCRIPTION_": "Determines whether arrow key navigation within the dropdown menu is allowed.",
  "_A_DROPDOWN_PROPS_LOCK_TAB_NAVIGATION_DESCRIPTION_": "Determines whether Tab key navigation within the dropdown menu is allowed.",
  "_A_DROPDOWN_PROPS_PERSIST_DESCRIPTION_": "Determines whether the dropdown menu will remain open after the user interacts with other elements until explicitly closed.",
  "_A_DROPDOWN_PROPS_PLACEMENT_DESCRIPTION_": "The position at which the dropdown menu will open.",
  "_A_DROPDOWN_PROPS_POPPER_CONTAINER_ID_DESCRIPTION_": "ID of the container element that holds the dropdown menu options.",
  "_A_DROPDOWN_PROPS_TRIGGERS_DESCRIPTION_": "A list of events that trigger the opening or closing of the dropdown menu.",
  "_A_DROPDOWN_PROPS_USE_ESCAPE_DESCRIPTION_": "Determines whether the Esc key can be used to close the dropdown menu."
}
