{
  "_A_SWITCH_COMPONENT_DESCRIPTION_": "El componente <strong lang=\"en\">ASwitch</strong> es un interruptor con soporte para varios estados que puede vincularse a un modelo de datos. El componente admite modos de dos y tres estados, así como la visualización de etiquetas personalizadas.",
  "_A_SWITCH_COMPONENT_NAME_": "Interruptor",
  "_A_SWITCH_GROUP_THREE_STATE_DESCRIPTION_": "Este ejemplo muestra cómo usar un interruptor en modo de tres estados usando <strong lang=\"en\">is-three-state</strong>, <strong lang=\"en\">default-value</strong> y <strong lang=\"en\">default-label</strong>. Cuando el interruptor está en un estado intermedio, el valor del modelo se establece en <strong lang=\"en\">default-value</strong> (en este caso, <strong lang=\"en\">null</strong>), y se muestra la etiqueta <strong lang=\"en\">Default</strong>. Este modo permite que el interruptor tenga tres estados: <strong lang=\"en\">true</strong>, <strong lang=\"en\">false</strong> y un estado predeterminado.",
  "_A_SWITCH_GROUP_THREE_STATE_HEADER_": "Modo de tres estados",
  "_A_SWITCH_GROUP_TITLE_DESCRIPTION_": "Este ejemplo muestra cómo usar las propiedades <strong lang=\"en\">title</strong> y <strong lang=\"en\">is-title-html</strong> en el componente de interruptor. En el primer interruptor, la información sobre herramientas se muestra con interpretación HTML, ya que <strong lang=\"en\">is-title-html</strong> está configurado en <strong lang=\"en\">true</strong>. En el segundo ejemplo, el código HTML en la información sobre herramientas no se interpreta porque <strong lang=\"en\">is-title-html</strong> está configurado en <strong lang=\"en\">false</strong>. Ambos interruptores muestran una información sobre herramientas con el texto <strong lang=\"en\">Aloha</strong> al pasar el cursor.",
  "_A_SWITCH_GROUP_TITLE_HEADER_": "Uso de las propiedades <strong lang=\"en\">title</strong> y <strong lang=\"en\">is-title-html</strong>",
  "_A_SWITCH_GROUP_TRUE_FALSE_LABEL_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">true-label</strong> y <strong lang=\"en\">false-label</strong> para configurar las etiquetas que se muestran en el interruptor. Cuando el valor del modelo corresponde al estado <strong lang=\"en\">true</strong>, el interruptor muestra la etiqueta <strong>1</strong>, y cuando está en el estado <strong lang=\"en\">false</strong>, muestra la etiqueta <strong>0</strong>.",
  "_A_SWITCH_GROUP_TRUE_FALSE_LABEL_HEADER_": "Uso de <strong lang=\"en\">true-label</strong> y <strong lang=\"en\">false-label</strong>",
  "_A_SWITCH_GROUP_TRUE_FALSE_VALUE_DESCRIPTION_": "Este ejemplo muestra cómo usar <strong lang=\"en\">true-value</strong> y <strong lang=\"en\">false-value</strong> para configurar los valores que se asignan al modelo al cambiar. Cuando el interruptor está en el estado <strong lang=\"en\">true</strong>, el valor del modelo se convierte en '1'. En el estado <strong lang=\"en\">false</strong>, el valor del modelo se convierte en '0'.",
  "_A_SWITCH_GROUP_TRUE_FALSE_VALUE_HEADER_": "Uso de <strong lang=\"en\">true-value</strong> y <strong lang=\"en\">false-value</strong>",
  "_A_SWITCH_PROPS_DEFAULT_LABEL_DESCRIPTION_": "Si el valor del modelo no coincide con <strong lang=\"en\">falseValue</strong> y <strong lang=\"en\">trueValue</strong>, se muestra esta etiqueta.",
  "_A_SWITCH_PROPS_DEFAULT_VALUE_DESCRIPTION_": "Se utiliza solo cuando <strong lang=\"en\">isThreeState</strong> está configurado en <strong lang=\"en\">true</strong>, para representar el tercer estado del modelo.",
  "_A_SWITCH_PROPS_FALSE_LABEL_DESCRIPTION_": "La etiqueta que se muestra cuando el interruptor está en el estado <strong lang=\"en\">false</strong>.",
  "_A_SWITCH_PROPS_FALSE_VALUE_DESCRIPTION_": "El valor que se asigna al modelo cuando el interruptor está en el estado <strong lang=\"en\">false</strong>.",
  "_A_SWITCH_PROPS_FULL_WIDTH_DESCRIPTION_": "Si se establece en <strong lang=\"en\">true</strong>, el interruptor ocupa todo el ancho disponible.",
  "_A_SWITCH_PROPS_IS_THREE_STATE_DESCRIPTION_": "Se utiliza para un interruptor de tres estados: <strong lang=\"en\">trueValue</strong>, <strong lang=\"en\">falseValue</strong> y <strong lang=\"en\">defaultValue</strong>.",
  "_A_SWITCH_PROPS_TRUE_LABEL_DESCRIPTION_": "La etiqueta que se muestra cuando el interruptor está en el estado <strong lang=\"en\">true</strong>.",
  "_A_SWITCH_PROPS_TRUE_VALUE_DESCRIPTION_": "El valor que se asigna al modelo cuando el interruptor está en el estado <strong lang=\"en\">true</strong>."
}