{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "Die ALinkCopy-Komponente ist eine Vue.js-Komponente, die eine Benutzeroberfläche zur Verfügung stellt, um einen Link zu präsentieren und einen Button anbietet, um den Linktext in die Zwischenablage zu kopieren. Dies ermöglicht den einfachen und bequemen Austausch von URLs oder anderen Verweisen durch die Benutzer Ihrer Anwendung. Durch Klicken auf den \"In die Zwischenablage kopieren\" Button wird der Text des Links in die Zwischenablage des Benutzers kopiert, um ihn schnell und einfach teilen zu können.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Link-Kopieren",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie die Komponente verwendet werden kann, um den Button anzupassen, der zum Kopieren des Links dient. Die <strong>button-options</strong>-Prop ermöglicht es, Eigenschaften und HTML-Attribute für den Button festzulegen, der die <a href='/#/button'>AButton</a>-Komponente verwendet.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Anpassung des Buttons",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "Die Position des Buttons in der Komponente mit dem Prop <strong>button-position</strong> angepasst sein kann.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Button-Position",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "In diesem Beispiel wird die Möglichkeit gezeigt, die Standardgruppierung-Klasse <strong>class-default</strong> in der Komponente anzupassen. Diese Klasse wird normalerweise verwendet, um die äußere Gruppierung der Komponente zu stylen. Sie können die Standardklasse nach Bedarf überschreiben oder leer lassen, wenn Sie die Standardgruppierung nicht verwenden möchten.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Anpassung der Standardgruppierung-Klasse in der Komponente",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "In diesem Beispiel wird die Verwendung der Komponente mit verschiedenen CSS-Klassen zur Anpassung des Erscheinungsbilds veranschaulicht.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "CSS-Klassen",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie die Komponente verwendet werden kann, um sowohl den Link als auch den zugehörigen Button zu deaktivieren. Die Deaktivierung bewirkt, dass der Link nicht mehr angeklickt werden kann und der Button nicht mehr auslösbar ist.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Deaktivieren von Link und Button",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie die Komponente in Verbindung mit der <a href='/#/link'>ALink</a>-Komponente verwendet werden kann, um Links auf flexible Weise einzurichten und deren Text in die Zwischenablage zu kopieren. Die <a href='/#/link'>ALink</a>-Komponente wird genutzt, um den Link selbst zu erstellen und zu definieren.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Anpassung des Links",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "Der 'button'-Slot ermöglicht es Ihnen, den Text des Buttons nach Ihren eigenen Vorstellungen zu definieren. Der Inhalt des 'button'-Slots wird an die darin enthaltene <a href='/#/button'>AButton</a>-Komponente weitergegeben.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Anpassen des Button mit dem 'button'-Slot",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie den Text des Links in der Komponente mithilfe des 'link'-Slots anpassen können. Der Inhalt des 'link'-Slots wird an die darin enthaltene <a href='/#/link'>ALink</a>-Komponente weitergegeben.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Anpassung des Link mit dem 'link'-Slot",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie die Komponente verwendet werden kann, um benutzerdefinierten Text anstelle des Standard-Link-Textes zu kopieren. Die <strong>text-copy</strong>-Prop ermöglicht es Ihnen, den zu kopierenden Text festzulegen.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Kopieren von benutzerdefiniertem Text",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Eigenschaften und HTML-Attribute für den Button definieren, der die <a href='/#/button'>AButton</a>-Komponente nutzt.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Position des Buttons. Sie können entweder <strong>right</strong> (rechts) oder <strong>left</strong> (links) verwenden.",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Die Standard-CSS-Klasse für die äußere Gruppierung",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "CSS-Klassen",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Die Deaktivierung der Komponente",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "Die Darstellung und das Verhalten des Links, indem Sie alle darin verwendeten Eigenschaften und HTML-Attribute von <a href='/#/link'>ALink</a> definieren.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "Den Text, der anstelle des Standard-Link-Textes kopiert werden soll.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "Der Text des Button. Der Inhalt dieses Slots wird als Button-Text in die <a href='/#/button'>AButton</a>-Komponente weitergeleitet.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "Der Text des Links. Der Inhalt dieses Slots wird als Link-Text in die <a href='/#/link'>ALink</a>-Komponente weitergeleitet."
}