{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "Le composant ALinkCopy est un composant Vue.js qui fournit une interface utilisateur pour présenter un lien et propose un bouton pour copier le texte du lien dans le presse-papiers. Cela permet un partage facile et pratique des URL ou d'autres références par les utilisateurs de votre application. En cliquant sur le bouton \"Copier dans le presse-papiers\", le texte du lien est copié dans le presse-papiers de l'utilisateur pour un partage rapide.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Copie de Lien",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "Cet exemple montre comment le composant peut être utilisé pour personnaliser le bouton servant à copier le lien. La prop <strong>button-options</strong> permet de définir des propriétés et des attributs HTML pour le bouton qui utilise le composant <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Personnalisation du Bouton",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "La position du bouton dans le composant peut être ajustée avec la prop <strong>button-position</strong>.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Position du Bouton",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "Cet exemple montre comment ajuster la classe de groupement par défaut <strong>class-default</strong> dans le composant. Cette classe est généralement utilisée pour styliser le groupement externe du composant. Vous pouvez écraser la classe par défaut selon vos besoins ou la laisser vide si vous ne souhaitez pas utiliser le groupement par défaut.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Personnalisation de la Classe de Groupement par Défaut dans le Composant",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "Cet exemple illustre l'utilisation du composant avec différentes classes CSS pour personnaliser son apparence.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "Classes CSS",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "Cet exemple montre comment le composant peut être utilisé pour désactiver à la fois le lien et le bouton associé. La désactivation empêche le lien d'être cliqué et le bouton d'être activé.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Désactiver le Lien et le Bouton",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "Cet exemple montre comment le composant peut être utilisé en conjonction avec le composant <a href='/#/link'>ALink</a> pour configurer des liens de manière flexible et copier leur texte dans le presse-papiers. Le composant <a href='/#/link'>ALink</a> est utilisé pour créer et définir le lien lui-même.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Personnalisation du Lien",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "L'emplacement 'button' vous permet de définir le texte du bouton selon vos préférences. Le contenu de l'emplacement 'button' est transmis au composant <a href='/#/button'>AButton</a> qu'il contient.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Personnaliser le Bouton avec l'emplacement 'button'",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "Cet exemple montre comment vous pouvez personnaliser le texte du lien dans le composant en utilisant l'emplacement 'link'. Le contenu de l'emplacement 'link' est transmis au composant <a href='/#/link'>ALink</a> qu'il contient.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Personnalisation du Lien avec l'emplacement 'link'",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "Cet exemple montre comment le composant peut être utilisé pour copier un texte personnalisé à la place du texte du lien par défaut. La prop <strong>text-copy</strong> vous permet de spécifier le texte à copier.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Copie de Texte Personnalisé",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Définir les propriétés et les attributs HTML pour le bouton qui utilise le composant <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Position du bouton. Vous pouvez utiliser soit <strong>right</strong> (droite) soit <strong>left</strong> (gauche).",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "La classe CSS par défaut pour le groupement externe",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "Classes CSS",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "La désactivation du composant",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "La représentation et le comportement du lien, en définissant toutes les propriétés et les attributs HTML utilisés dans <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "Le texte à copier à la place du texte du lien par défaut.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "Le texte du bouton. Le contenu de cet emplacement est transmis comme texte du bouton au composant <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "Le texte du lien. Le contenu de cet emplacement est transmis comme texte du lien au composant <a href='/#/link'>ALink</a>."
}
