{
  "_A_LINK_COPY_COMPONENT_DESCRIPTION_": "ALinkCopy je Vue.js komponenta koja pruža korisničko sučelje za prikazivanje veze i nudi gumb za kopiranje teksta veze u međuspremnik. Služi za jednostavnu i praktičnu razmjenu URL-ova ili drugih referenci od strane korisnika aplikacije. Klikom na gumb 'Kopiraj u međuspremnik' tekst veze kopira se u međuspremnik korisnika kako bi se brzo i jednostavno mogao podijeliti.",
  "_A_LINK_COPY_COMPONENT_NAME_": "Kopiraj vezu",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_DESCRIPTION_": "U ovom primjeru prikazano je kako se može prilagoditi gumb za kopiranje veze. Prop <strong>button-options</strong> omogućava proslijeđivanje prop-ova i HTML atributa za gumb koji koristi komponentu <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_GROUP_BUTTON_OPTIONS_HEADER_": "Prilagodba gumba",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_DESCRIPTION_": "Položaj gumba u odnosu na vezu može se prilagoditi pomoću prop-a <strong>button-position</strong>.",
  "_A_LINK_COPY_GROUP_BUTTON_POSITION_HEADER_": "Položaj gumba",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_DESCRIPTION_": "U ovom primjeru prikazana je mogućnost prilagodbe zadane klase za grupiranje <strong>class-default</strong> u komponenti. Ova klasa obično se koristi za stiliziranje vanjskog grupiranja komponente. Možete prebrisati zadani razred po potrebi ili ga ostaviti praznim ako ne želite koristiti zadano grupiranje.",
  "_A_LINK_COPY_GROUP_CLASS_DEFAULT_HEADER_": "Prilagodba zadane klase za grupiranje u komponenti",
  "_A_LINK_COPY_GROUP_CLASS_DESCRIPTION_": "U ovom primjeru prikazano je korištenje komponente s različitim CSS klasama za prilagodbu izgleda.",
  "_A_LINK_COPY_GROUP_CLASS_HEADER_": "CSS klase",
  "_A_LINK_COPY_GROUP_DISABLED_DESCRIPTION_": "U ovom primjeru prikazano je kako se veza i pripadajući gumb mogu onemogućiti. Kao rezultat, interakcija više nije moguća ni s vezom ni s gumbom.",
  "_A_LINK_COPY_GROUP_DISABLED_HEADER_": "Onemogućavanje veze i gumba",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_DESCRIPTION_": "U ovom primjeru prikazano je kako se komponenta može koristiti zajedno s komponentom <a href='/#/link'>ALink</a> za fleksibilno postavljanje veza i kopiranje njihovog teksta u međuspremnik. Komponenta <a href='/#/link'>ALink</a> koristi se za stvaranje i definiranje same veze.",
  "_A_LINK_COPY_GROUP_LINK_OPTIONS_HEADER_": "Prilagodba veze",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_DESCRIPTION_": "Slot 'button' omogućava definiranje proizvoljnog teksta gumba. Sadržaj slot-a 'button' proslijeđuje se komponenti <a href='/#/button'>AButton</a> koja se nalazi unutar njega.",
  "_A_LINK_COPY_GROUP_SLOT_BUTTON_HEADER_": "Prilagodba gumba pomoću slot-a 'button'",
  "_A_LINK_COPY_GROUP_SLOT_LINK_DESCRIPTION_": "U ovom primjeru prikazano je kako se tekst veze može prilagoditi pomoću slot-a 'link'. Sadržaj slot-a 'link' proslijeđuje se komponenti <a href='/#/link'>ALink</a> koja se nalazi unutar njega.",
  "_A_LINK_COPY_GROUP_SLOT_LINK_HEADER_": "Prilagodba veze pomoću slot-a 'link'",
  "_A_LINK_COPY_GROUP_TEXT_COPY_DESCRIPTION_": "U ovom primjeru prikazano je kako se komponenta može koristiti za kopiranje prilagođenog teksta umjesto zadanih tekstova veza. Prop <strong>text-copy</strong> omogućava postavljanje teksta koji će se kopirati.",
  "_A_LINK_COPY_GROUP_TEXT_COPY_HEADER_": "Kopiranje prilagođenog teksta",
  "_A_LINK_COPY_PROPS_BUTTON_OPTIONS_": "Definiranje prop-ova i HTML atributa za gumb koji se koriste u komponenti <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_PROPS_BUTTON_POSITION_DESCRIPTION_": "Položaj gumba. Može se koristiti <strong>right</strong> (desno) ili <strong>left</strong> (lijevo).",
  "_A_LINK_COPY_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Zadana CSS klasa za vanjsko grupiranje.",
  "_A_LINK_COPY_PROPS_CLASS_DESCRIPTION_": "CSS klase.",
  "_A_LINK_COPY_PROPS_DISABLED_DESCRIPTION_": "Onemogućavanje komponente.",
  "_A_LINK_COPY_PROPS_LINK_OPTIONS_DESCRIPTION_": "Izgled i ponašanje veze postavljanjem svih prop-ova i HTML atributa koji se koriste u komponenti <a href='/#/link'>ALink</a>.",
  "_A_LINK_COPY_PROPS_TEXT_COPY_DESCRIPTION_": "Tekst koji će se kopirati umjesto zadanih tekstova veze.",
  "_A_LINK_COPY_SLOT_BUTTON_DESCRIPTION_": "Tekst gumba. Sadržaj ovog slota postaje tekst gumba unutar komponente <a href='/#/button'>AButton</a>.",
  "_A_LINK_COPY_SLOT_LINK_DESCRIPTION_": "Tekst veze. Sadržaj ovog slota postaje tekst veze unutar komponente <a href='/#/link'>ALink</a>."
}