{
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "Übersetzbares aria-label für das Hauptelement des Wizards",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "Übersetzbares aria-label für den Block mit allen Schritten des Wizards",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Icon, das im Falle eines Fehlers im Schritt angezeigt wird",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Text und Titel für den Screenreader für das Fehler-Icon",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Icon, das im Falle einer Warnung im Schritt angezeigt wird",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Text und Titel für den Screenreader für das Warn-Icon",
  "_A_WIZARD_BTN_ADD_STEP_": "Schritt hinzufügen",
  "_A_WIZARD_BTN_DELETE_STEP_": "Schritt entfernen",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Ein Wizard ist eine sequenzielle, schrittweise Benutzerschnittstelle, die entwickelt wurde, um Benutzer durch komplexe Aufgaben oder Prozesse zu führen, indem sie in kleinere Schritte unterteilt werden. Assistent enthält klare Anweisungen und bietet Benutzern oft die Möglichkeit, weiter und zurück zu gehen, um eine effiziente und unkomplizierte Benutzererfahrung zu ermöglichen.",
  "_A_WIZARD_COMPONENT_NAME_": "Wizard",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Eine Funktion, die dafür verantwortlich ist, den Benutzer zum vorherigen Schritt des Assistenten zu bewegen, und alle zusätzlichen logischen Übergänge.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Eine Funktion, die dafür verantwortlich ist, den Benutzer zum nächsten Schritt des Assistenten zu bewegen, und alle zusätzlichen logischen Übergänge.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Navigationstasten ermöglichen es Benutzern, weiter oder zurück durch die Schritte des Assistenten zu navigieren. Diese können vollständig angepasst werden, indem man die aufgeführten Eigenschaften verwendet.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Eine alternative Möglichkeit, den Assistenten zu navigieren, besteht darin, den Schritt direkt im Header auszuwählen, anstatt sich ausschließlich auf weiter- und zurücktasten zu verlassen. Beide Navigationsmethoden zum weiter- oder zurückbewegen sowie Schritte in der Übersicht können bei Bedarf deaktiviert werden.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Deaktivieren der Navigationstasten",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Navigationstasten",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "Die Sichtbarkeit beider Navigationstasten kann separat gesteuert werden, einschließlich der Sichtbarkeit im ersten und letzten Schritt.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Ausblenden der Navigationstasten",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "Das Demonstrationsbeispiel eines AWizard-Komponenten.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Demonstrationsbeispiel",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "Beim Übergang zu einem anderen Schritt in einem Assistenten kann ein Fokuswechsel verwendet werden, um den Benutzer zur relevanten Inhaltsquelle zu leiten, im Gegensatz dazu, den Fokus auf der interagierten Navigationstaste zu belassen.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Fokuswechsel",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "Die AWizard-Komponente ermöglicht das Anzeigen des Ladeindikators innerhalb der Navigationstasten. Dies kann nützlich sein, um anzuzeigen, dass ein bestimmter Vorgang im Hintergrund ausgeführt wird und der Benutzer auf den Abschluss des Schritts warten muss.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Ladeindikator",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Die externe Schrittnavigation beinhaltet die dynamische Steuerung eines mehrstufigen Prozesses eines Assistenten unter Verwendung externer Variablen oder benutzerdefinierter Logik, die eine maßgeschneiderte Progression durch die Schritte basierend auf unterschiedlichen Bedürfnissen und Faktoren ermöglicht.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Externe Schrittnavigation",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Die Ausrichtung der Schritte im Kopfbereich des Assistenten kann so angepasst werden, dass sie linksbündig oder im Blocksatz ausgerichet werden. Bei der ausrichtung im Blocksatz sind beide Ränder des Headers mit beiden Rändern des Assistenten ausgerichtet, und die Schritte sind gleichmäßig über die verfügbare Breite verteilt, unabhängig von der Gesamtanzahl der Schritte.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Schritte im Blocksatz ausrichten",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Nummern können den Schritten sequenziell angehängt werden, um die Reihenfolge der Ausführung klar darzustellen.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Nummerierung der Schritte",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "Die Position der Toolbar mit den Navigationstasten kann durch Verwendung einer der beiden Eigenschaften angepasst werden. Unterstützte Positionen sind oben und unten.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Positionierung der Navigationstasten-Toolbar",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Die Schlüssel-ID ist eine eindeutige Kennung, die jedem Schritt zugeordnet ist. Sie wird typischerweise verwendet, um zwischen einzelnen Schritten im Assistenten zu unterscheiden.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Schlüssel-ID",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "Ein Slot <strong>step</strong> kann definiert werden, um den Inhalt in einem Assistentenschritt anzupassen. Der Slot kann von einem einzelnen Schritt oder von mehreren verwendet werden.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Benutzerdefinierter Inhalt in einem Schritt",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "Ein Slot <strong>stepLabel</strong> kann verwendet werden, um den Namen für jeden der Schritte im Header des Assistenten anzupassen.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Benutzerdefinierte Namen im Header",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "Ein Slot <strong>toolbar</strong> kann verwendet werden, um die Toolbar mit Navigationssteuerung anzupassen. Zum Beispiel kann eine zusätzliche Schaltfläche bereitgestellt werden.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Benutzerdefinierte Navigationssteuerung Toolbar",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Es kann basierend auf Designentscheidungen, Bildschirmplatz und Benutzererfahrungsprioritäten angepasst werden, ob nur der aktive Schritt oder alle Schritte in einem Assistenten angezeigt werden sollen.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Nur den aktuell aktiven Schritt anzeigen (Mobil)",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Jeder Schritt des Assistenten kann die boolesche Eigenschaft \"error\" enthalten. Für den Wert true wird der entsprechende Schritt als fehlerhaft hervorgehoben.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Schrittfehler",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Jeder Schritt des Assistenten kann die boolesche Eigenschaft \"warning\" enthalten. Für den Wert true wird der entsprechende Schritt als fragwürdig hervorgehoben. Dies ist nützlich, wenn darauf hingewiesen werden soll, dass etwas in einem Schritt möglicherweise von der Norm abweicht, ohne direkt einen Fehler anzuzeigen.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Schrittwarnung",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "Eine Zahl, die dem Index (beginnend bei 0) entspricht, kann angegeben werden, um den initial aktiven Schritt im Assistenten festzulegen.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Aktiver Schritt",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Ermöglicht die Auswahl der visuellen Darstellung von Schritten im Header. Eine Übersicht aller Schritte wird oben im Assistenten angezeigt. Die folgenden Werte werden akzeptiert: <strong>basic</strong>, <strong>arrows</strong>, <strong>square</strong> und <strong>round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Typ",
  "_A_WIZARD_LABEL_STEPS_": "Schritte",
  "_A_WIZARD_LABEL_TYPE_": "Typ",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Zurück",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Weiter",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Zusätzliche Attribute für die Schaltfläche, die zum vorherigen Schritt navigiert und nicht explizit als Eigenschaften definiert sind.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Eine oder mehrere zusätzliche CSS-Klassen für die Schaltfläche, die zum vorherigen Schritt navigiert.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Name des Icons, das links vom Namen für die Schaltfläche, die zum vorherigen Schritt navigiert, angezeigt werden soll.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Name des Icons, das rechts vom Namen für die Schaltfläche, die zum vorherigen Schritt navigiert, angezeigt werden soll.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Benutzerdefinierter Name für die Schaltfläche, die zum vorherigen Schritt navigiert.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Benutzerdefinierter Titel für die Schaltfläche, die zum vorherigen Schritt navigiert.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Zusätzliche Werte, die im Assistenten verwendet werden.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Zusätzliche Attribute für die Schaltfläche, die zum nächsten Schritt navigiert und nicht explizit als Eigenschaften definiert sind.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Eine oder mehrere zusätzliche CSS-Klassen für die Schaltfläche, die zum nächsten Schritt navigiert.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Name des Icons, das links vom Namen für die Schaltfläche, die zum nächsten Schritt navigiert, angezeigt werden soll.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Name des Icons, das rechts vom Namen für die Schaltfläche, die zum nächsten Schritt navigiert, angezeigt werden soll.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Benutzerdefinierter Name für die Schaltfläche, die zum nächsten Schritt navigiert.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Benutzerdefinierter Titel für die Schaltfläche, die zum nächsten Schritt navigiert.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Wird der Fokuswechsel verwendet, wenn zu einem anderen Schritt in einem Assistenten übergegangen wird.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Gibt eine eindeutige ID des Assistenten an.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum vorherigen Schritt deaktiviert sein soll.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum vorherigen Schritt ausgeblendet sein soll.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum vorherigen Schritt im ersten Schritt des Assistenten ausgeblendet sein soll.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Legt fest, ob der Übergang zu einem der vorherigen Schritte durch Klicken darauf im Header deaktiviert ist.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Legt fest, ob die Schaltflächen in der Navigationsleiste mit einem Ladeindikator dargestellt werden.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Legt fest, ob die externe Logik für die Schrittnavigation im Assistenten verwendet wird.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum nächsten Schritt deaktiviert sein soll.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum nächsten Schritt ausgeblendet sein soll.",
 "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Legt fest, ob die Schaltfläche zum nächsten Schritt im letzten Schritt des Assistenten ausgeblendet sein soll.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Legt fest, ob der Übergang zu einem der nächsten Schritte durch Klicken darauf im Header deaktiviert ist.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Anzeige, ob der Assistent auf einem Mobilgerät angezeigt wird oder nicht.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Legt fest, ob die Ausrichtung der Schritte justiert ist.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Legt fest, ob die Schritte im Header sequenziell nummeriert sind.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Legt fest, ob die Navigationsleiste des Assistenten am unteren Rand, unter dem Inhalt des derzeit aktiven Schritts, platziert wird. Dies ist die Standardplatzierung.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Legt fest, ob die Navigationsleiste des Assistenten oben, über dem Inhalt des derzeit aktiven Schritts, platziert wird.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Zeigt nur den aktuell aktiven Schritt in einem Assistenten an.",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Ein Array von Objekten mit Informationen zu jedem Schritt in einem Assistenten.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Stellt ein Objekt dar, bei dem jeder Schlüssel einem Schrittindex entspricht und der zugehörige boolesche Wert angibt, ob der jeweilige Schritt besucht wurde oder nicht.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Index des derzeit aktiven Schritts im Assistenten.",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Text, der den Fortschritt des Benutzers im Assistenten angibt. Variablen, die innerhalb des Platzhalters verfügbar sind, sind stepActive (derzeit aktiver Schritt), stepsCount (Gesamtanzahl der Schritte) und stepActiveLabel (Bezeichnung des derzeit aktiven Schritts).",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "ID für das Teleportieren der Navigationsleiste zum unteren Rand des Assistenten.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Passt die visuelle Darstellung der Schritte im Header an.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Ein Slot, der einen Schritt im Assistenten enthält.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Ein Slot, der die Namen der Schritte im Header des Assistenten enthält.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Ein Slot, der die Navigationsleiste mit den Schaltflächen enthält.",
  "_A_WIZARD_STEP_1_": "Schritt 1",
  "_A_WIZARD_STEP_2_": "Schritt 2",
  "_A_WIZARD_STEP_3_": "Schritt 3",
  "_A_WIZARD_STEP_4_": "Schritt 4",
  "_A_WIZARD_STEP_NAME_": "Name des Schritts",
  "_A_WIZARD_TYPE_ARROWS_": "Pfeil",
  "_A_WIZARD_TYPE_BASIC_": "Grundlegend",
  "_A_WIZARD_TYPE_ROUND_": "Rund",
  "_A_WIZARD_TYPE_SQUARE_": "Quadratisch"
}
