{
  "_A_WIZARD_BTN_ADD_STEP_": "Add step",
  "_A_WIZARD_BTN_DELETE_STEP_": "Remove step",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "A wizard is a sequential, step-by-step interface designed to guide users through complex tasks or processes by breaking them into manageable steps. It includes clear instructions and often provides users with the ability to navigate forward and backward for a efficient and straightforward user experience.",
  "_A_WIZARD_COMPONENT_NAME_": "Wizard",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "A function responsible for moving the user back to the previous step of the wizard and any additional logic relevant to transition.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "A function responsible for moving the user to the next step of the wizard and any additional logic relevant to transition.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Navigation buttons allow users to move forward or backward through the steps of the wizard. They can be fully customized by using the listed props.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "An alternative way of navigating the wizard is by directly selecting the step in header, rather than relying solely on forward and backward buttons. Both navigations for moving forward or backward and steps in the overview can be disabled when necessary.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Disabling navigation buttons",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Navigation buttons",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "Visibility of both navigation buttons can be controlled separately, including visibility in first and last step, respectively.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Hiding navigation buttons",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "A showcase example of an AWizard component.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Showcase example",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "When transitioning to different step from the current one in a wizard, a focus jump can be used to direct the user to the relevant content, in contrast to the keeping focus on the navigation button that was interacted with.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Focus jump",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "The AWizard component allows for displaying the loading indicator inside navigation buttons. This can be useful to indicate that a specific operation is running in the background and the user needs to wait for completion of the step.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Loading indicator",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "External step navigation involves the dynamic control of multi-step process of a wizard using external variables or custom logic, enabling customized progression through the steps based on different needs and factors.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "External step navigation",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Numbers can be sequentially appended to the steps for the purpose of providing clarity in the order of execution.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Enumeration of the steps",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Alignment of the steps in the wizard header can be customized to be left or justified. By justifying, the both edges of the header are aligned with both edges of wizard, and the steps are evenly distributed across the available width, regardless of the total number of steps.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Steps justification",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "The position of the toolbar containing navigation buttons can be customized by using one of the two props. Supported positions are top and bottom.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Positioning of navigation buttons toolbar",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Key ID is a unique identifier associated with each step. It is typically used to differentiate between individual steps in the  wizard.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Key ID",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Showing only the active step or all steps in a wizard can be customized based on design choices, screen space, and user experience priorities.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Show only currently active step (mobile)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "A slot <strong>step</strong> can be defined in order to customize content inside a wizard step. slot can be used by a single step or by multiple ones.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Custom content inside step",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "A slot <strong>stepLabel</strong> can be used to customize label for each of the steps in wizard header.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Custom labels in steps header",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "A slot <strong>toolbar</strong> can be used to customize toolbar with navigations control. For example, an additional button can be provided.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Custom navigation control toolbar",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "An integer corresponding to the index (starting at 0) can be provided to set the initially active step in the wizard.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Active step",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Each step of the wizard can contain boolean property \"error\". For value true, the corresponding step will be highlighted as erroneous.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Step error",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Each step of the wizard can contain boolean property \"warning\". For value true, the corresponding step will be highlighted as questionable. This is useful when suggesting that something in a step might be deviating from the norm, without necessarily indicating an error.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Step warning",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Allows for the selection of the visual representation of steps in header. An overview of all the steps is shown at the top of the wizard. The following values are accepted: <strong>basic</strong>, <strong>arrows</strong>, <strong>square</strong> and <strong>round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Type",
  "_A_WIZARD_LABEL_STEPS_": "Steps",
  "_A_WIZARD_LABEL_TYPE_": "Type",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Previous",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Next",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "Translatable aria-label for the main element of the Wizard",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "Translatable aria-label for the block with all steps of the Wizard",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Additional attributes for the button navigating to the previous step that are not explicitly defined as props.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "One or more additional CSS-classes for the button navigating to the previous step.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Name of the icon to be shown to the left of the label for the button navigating to the previous step.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Name of the icon to be shown to the right of the label for the button navigating to the previous step.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Custom label for the button navigating to the previous step.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Custom title for the button navigating to the previous step.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Extra values used in wizard.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Additional attributes for the button navigating to the next step that are not explicitly defined as props.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "One or more additional CSS-classes for the button navigating to the next step.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Name of the icon to be shown to the left of the label for the button navigating to the next step.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Name of the icon to be shown to the right of the label for the button navigating to the next step.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Custom label for the button navigating to the next step.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Custom title for the button navigating to the next step.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Is focus jump used when transitioning to a different step in a wizard.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Specifies a unique ID of the wizard.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Specifies whether the button navigating to the previous step should be disabled.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Specifies whether the button navigating to the previous step should be hidden.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Specifies whether the button navigating to the previous step should be hidden in the first step of the wizard.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Specifies whether the transition to one of the previous steps by clicking on it in header is disabled.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Specifies whether the buttons in the navigation toolbar are in the loading state.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Specifies weather the external logic is for step navigation in wizard.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Specifies whether the button navigating to the next step should be disabled.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Specifies whether the button navigating to the next step should be hidden.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Specifies whether the button navigating to the next step should be hidden in the last step of the wizard.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Specifies whether the transition to one of the next steps by clicking on it in header is disabled.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Indicator whether the wizard is being displayed on a mobile device or not.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Specifies weather the steps are sequentially enumerated in steps header.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Specifies weather the alignment of the steps is justified.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Specifies weather the wizard navigation toolbar will be placed at the bottom, under the content of the currently active step. This is the default placement.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Specifies weather the wizard navigation toolbar will be placed at the top, above the content of the currently active step.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Show only the currently active step in a wizard.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Index of the currently active step in the wizard.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Icon displayed in case of an error in the step",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Text and title for the screen reader for the error icon",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Icon displayed in case of a warning in the step",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Text and title for the screen reader for the warning icon",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Text indicating the user's progress within the wizard. Variables available inside placeholder are stepActive (currently active step), stepsCount (total number of steps) stepActiveLabel (label of the currently active step).",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "An array of objects containing information about each step in a wizard.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Represents an object where each key corresponds to a step index, and the associated boolean value indicates whether the respective step has been visited or not.",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "Id for teleport  (dynamic movement) of the navigation toolbar to the bottom of the wizard.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Customizes visual representation of steps in header.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "A slot containing a step in wizard.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "A slot containing the labels of the steps in wizard header.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "A slot containing navigation buttons toolbar.",
  "_A_WIZARD_STEP_1_": "Step 1",
  "_A_WIZARD_STEP_2_": "Step 2",
  "_A_WIZARD_STEP_3_": "Step 3",
  "_A_WIZARD_STEP_4_": "Step 4",
  "_A_WIZARD_STEP_NAME_": "Name of the step",
  "_A_WIZARD_TYPE_ARROWS_": "Arrow",
  "_A_WIZARD_TYPE_BASIC_": "Basic",
  "_A_WIZARD_TYPE_ROUND_": "Round",
  "_A_WIZARD_TYPE_SQUARE_": "Square"
}
