{
  "_A_WIZARD_BTN_ADD_STEP_": "Agregar paso",
  "_A_WIZARD_BTN_DELETE_STEP_": "Eliminar paso",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Un Asistente es una interfaz de usuario secuencial, paso a paso, diseñada para guiar a los usuarios a través de tareas o procesos complejos dividiéndolos en pasos más pequeños. El Asistente contiene instrucciones claras y a menudo ofrece a los usuarios la posibilidad de avanzar y retroceder para proporcionar una experiencia de usuario eficiente y sencilla.",
  "_A_WIZARD_COMPONENT_NAME_": "Asistente",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Una función responsable de mover al usuario al paso anterior del Asistente y para todas las transiciones lógicas adicionales.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Una función responsable de mover al usuario al siguiente paso del Asistente y para todas las transiciones lógicas adicionales.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Los botones de navegación permiten a los usuarios avanzar o retroceder a través de los pasos del Asistente. Pueden personalizarse completamente utilizando las propiedades listadas.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Una alternativa para navegar en el Asistente es seleccionar el paso directamente en el encabezado, en lugar de depender únicamente de los botones de navegación hacia adelante y hacia atrás. Ambos métodos de navegación pueden desactivarse según sea necesario.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Desactivar los botones de navegación",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Botones de navegación",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "La visibilidad de ambos botones de navegación puede controlarse por separado, incluida la visibilidad en el primer y último paso.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Ocultar los botones de navegación",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "El ejemplo de demostración de un componente AWizard.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Ejemplo de demostración",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "Al pasar a otro paso en un Asistente, se puede utilizar el cambio de enfoque para dirigir al usuario a la fuente de contenido relevante, en lugar de dejar el enfoque en el botón de navegación.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Cambio de enfoque",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "El componente AWizard permite mostrar el indicador de carga dentro de los botones de navegación. Esto puede ser útil para indicar que una operación específica está en curso en segundo plano y que el usuario debe esperar a que se complete el paso.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Indicador de carga",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "La navegación externa de pasos incluye el control dinámico de un proceso de varios pasos de un Asistente utilizando variables externas o lógica personalizada, lo que permite una progresión personalizada a través de los pasos según diferentes necesidades y factores.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Navegación externa de pasos",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Los números pueden añadirse secuencialmente a los pasos para representar claramente el orden de ejecución.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Numeración de pasos",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "La alineación de los pasos en el encabezado del Asistente puede ajustarse para que estén alineados a la izquierda o justificados. En la alineación justificada, ambos bordes del encabezado están alineados con los bordes del Asistente, y los pasos se distribuyen uniformemente en todo el ancho disponible, independientemente del número total de pasos.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Alinear los pasos justificados",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "La posición de la barra de herramientas con los botones de navegación puede ajustarse utilizando una de las dos propiedades. Las posiciones admitidas son arriba y abajo.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Posicionamiento de la barra de herramientas de navegación",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Una clave de identificador único para cada paso. Se utiliza para mejorar el rendimiento. Esta es la clave para cada uno de los objetos en el prop <strong>steps</strong>. El valor de esta clave se encontrará en el objeto y se usará como <strong>key</strong> en el bucle. Si no se especifica <strong>key-id</strong>, se utilizará <strong>index</strong> en el bucle.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Clave de identificador único",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Puede ajustarse en función de las decisiones de diseño, el espacio disponible en la pantalla y las prioridades de la experiencia del usuario, si se debe mostrar solo el paso activo o todos los pasos en un Asistente.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Mostrar solo el paso activo (móvil)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "Se puede definir una ranura <strong>step</strong> para personalizar el contenido en un paso del Asistente. La ranura puede ser utilizada por un solo paso o por varios pasos.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Contenido personalizado en un paso",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "Se puede utilizar una ranura <strong>stepLabel</strong> para personalizar el nombre de cada uno de los pasos en el encabezado del Asistente.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Nombres personalizados en el encabezado",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "Se puede utilizar una ranura <strong>toolbar</strong> para personalizar la barra de herramientas con los controles de navegación. Por ejemplo, se puede proporcionar un botón adicional.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Barra de herramientas de navegación personalizada",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "Se puede especificar un número correspondiente al índice (comenzando desde 0) para establecer el paso activo inicial en el Asistente.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Paso activo",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Cada paso del Asistente puede contener la propiedad booleana \"error\". Para el valor verdadero, el paso correspondiente se resalta como erróneo.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Error del paso",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Cada paso del Asistente puede contener la propiedad booleana \"advertencia\". Para el valor verdadero, el paso correspondiente se resalta como paso de advertencia. Esto es útil para indicar que algo en un paso puede diferir de lo normal, sin indicar directamente un error.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Advertencia del paso",
  "_A_WIZARD_GROUP_SUB_TYPE_DESCRIPTION_": "Estos ejemplos muestran cómo usar varios subtipos para alterar la apariencia de los pasos activos cuando se utiliza el tipo <strong lang=\"en\">line</strong>.",
  "_A_WIZARD_GROUP_SUB_TYPE_HEADER_": "Subtipos para el tipo <strong lang=\"en\">line</strong>",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Permite elegir la representación visual de los pasos en el encabezado. Se muestra una descripción general de todos los pasos en la parte superior del Asistente. Se aceptan los siguientes valores: <strong>basic</strong>, <strong>arrows</strong>, <strong>line</strong> y <strong>round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Tipo",
  "_A_WIZARD_LABEL_STEPS_": "Pasos",
  "_A_WIZARD_LABEL_TYPE_": "Tipo",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Atrás",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Siguiente",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "aria-label traducible para el elemento principal del Asistente",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "aria-label traducible para el bloque que contiene todos los pasos del Asistente",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Atributos adicionales para el botón que pasa al paso anterior y que no están definidos explícitamente como propiedades.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Una o más clases CSS adicionales para el botón que pasa al paso anterior.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Nombre del icono que se muestra a la izquierda del nombre del botón que pasa al paso anterior.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nombre del icono que se muestra a la derecha del nombre del botón que pasa al paso anterior.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Nombre personalizado para el botón que pasa al paso anterior.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Título personalizado para el botón que pasa al paso anterior.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Valores adicionales utilizados en el Asistente.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Atributos adicionales para el botón que pasa al siguiente paso y que no están definidos explícitamente como propiedades.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Una o más clases CSS adicionales para el botón que pasa al siguiente paso.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Nombre del icono que se muestra a la izquierda del nombre del botón que pasa al siguiente paso.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nombre del icono que se muestra a la derecha del nombre del botón que pasa al siguiente paso.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Nombre personalizado para el botón que pasa al siguiente paso.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Título personalizado para el botón que pasa al siguiente paso.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Si se utiliza el cambio de enfoque al pasar a otro paso en un Asistente.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Indica un identificador único del Asistente.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Determina si el botón que pasa al paso anterior debe estar deshabilitado.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón que pasa al paso anterior debe estar oculto.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón que pasa al paso anterior debe estar oculto en el primer paso del Asistente.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Determina si el paso a cualquiera de los pasos anteriores haciendo clic en ellos en el encabezado está deshabilitado.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Determina si los botones en la barra de navegación deben mostrarse con un indicador de carga.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Determina si se utiliza la lógica de control externo para la navegación de los pasos en el Asistente.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Determina si el botón que pasa al siguiente paso debe estar deshabilitado.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón que pasa al siguiente paso debe estar oculto.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Determina si el botón que pasa al siguiente paso debe estar oculto en el último paso del Asistente.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Determina si el paso a cualquiera de los siguientes pasos haciendo clic en ellos en el encabezado está deshabilitado.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Muestra si el Asistente se muestra en un dispositivo móvil o no.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Determina si los pasos en el encabezado están numerados secuencialmente.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Determina si los pasos están justificados.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Determina si la barra de navegación del Asistente debe estar en la parte inferior, debajo del contenido del paso activo actual. Esta es la posición predeterminada.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Determina si la barra de navegación del Asistente debe estar en la parte superior, sobre el contenido del paso activo actual.",
  "_A_WIZARD_PROPS_KEY_ID_DESCRIPTION_": "Una clave identificadora única para cada paso. Se utiliza para mejorar el rendimiento.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Muestra solo el paso activo actual en un Asistente.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Índice del paso activo actual en el Asistente.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Icono que se muestra en caso de error en el paso",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Texto y título para el lector de pantalla para el icono de error",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Icono que se muestra en caso de advertencia en el paso",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Texto y título para el lector de pantalla para el icono de advertencia",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Texto que indica el progreso del usuario en el Asistente. Las variables disponibles dentro del marcador de posición son stepActive (paso activo actual), stepsCount (número total de pasos) y stepActiveLabel (etiqueta del paso activo actual).",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Una matriz de objetos con información sobre cada paso en un Asistente.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Representa un objeto donde cada clave corresponde a un índice de paso y el valor booleano asociado indica si el paso correspondiente ha sido visitado o no.",
  "_A_WIZARD_PROPS_SUB_TYPE_DESCRIPTION_": "La propiedad `subType` se utiliza para definir el estilo de los pasos activos en el tipo <strong lang=\"en\">line</strong>. Permite elegir entre formas cuadradas y redondas, con o sin borde adicional.",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "ID para teletransportar la barra de navegación a la parte inferior del Asistente.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Ajusta la representación visual de los pasos en el encabezado.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Una ranura que contiene un paso en el Asistente.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Una ranura que contiene los nombres de los pasos en el encabezado del Asistente.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Una ranura que contiene la barra de navegación con los botones.",
  "_A_WIZARD_STEP_1_": "Paso 1",
  "_A_WIZARD_STEP_2_": "Paso 2",
  "_A_WIZARD_STEP_3_": "Paso 3",
  "_A_WIZARD_STEP_4_": "Paso 4",
  "_A_WIZARD_STEP_NAME_": "Nombre del paso",
  "_A_WIZARD_TYPE_ARROWS_": "Flecha",
  "_A_WIZARD_TYPE_BASIC_": "Básico",
  "_A_WIZARD_TYPE_LINE_": "Lineal",
  "_A_WIZARD_TYPE_ROUND_": "Redondo"
}