{
  "_A_WIZARD_BTN_ADD_STEP_": "Ajouter une étape",
  "_A_WIZARD_BTN_DELETE_STEP_": "Supprimer une étape",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Un Assistant est une interface utilisateur séquentielle, étape par étape, conçue pour guider les utilisateurs à travers des tâches ou des processus complexes en les divisant en étapes plus petites. L'Assistant contient des instructions claires et offre souvent aux utilisateurs la possibilité d'aller et venir pour fournir une expérience utilisateur efficace et simple.",
  "_A_WIZARD_COMPONENT_NAME_": "Assistant",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Une fonction responsable de déplacer l'utilisateur à l'étape précédente de l'Assistant et pour toutes les transitions logiques supplémentaires.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Une fonction responsable de déplacer l'utilisateur à l'étape suivante de l'Assistant et pour toutes les transitions logiques supplémentaires.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "Les boutons de navigation permettent aux utilisateurs d'avancer ou de reculer à travers les étapes de l'Assistant. Ils peuvent être entièrement personnalisés en utilisant les propriétés listées.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Une alternative pour naviguer dans l'Assistant consiste à sélectionner l'étape directement dans l'en-tête, au lieu de s'appuyer uniquement sur les boutons de navigation avant et arrière. Les deux méthodes de navigation peuvent être désactivées selon les besoins.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Désactiver les boutons de navigation",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Boutons de navigation",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "La visibilité des deux boutons de navigation peut être contrôlée séparément, y compris la visibilité lors de la première et de la dernière étape.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Masquer les boutons de navigation",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "L'exemple de démonstration d'un composant AWizard.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Exemple de démonstration",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "Lors du passage à une autre étape dans un Assistant, un changement de focus peut être utilisé pour orienter l'utilisateur vers la source de contenu pertinente, au lieu de laisser le focus sur le bouton de navigation.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Changement de focus",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "Le composant AWizard permet d'afficher l'indicateur de chargement à l'intérieur des boutons de navigation. Cela peut être utile pour indiquer qu'une opération spécifique est en cours d'exécution en arrière-plan et que l'utilisateur doit attendre la fin de l'étape.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Indicateur de chargement",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "La navigation externe des étapes comprend le contrôle dynamique d'un processus en plusieurs étapes d'un Assistant en utilisant des variables externes ou une logique personnalisée, ce qui permet une progression personnalisée à travers les étapes en fonction de différents besoins et facteurs.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Navigation externe des étapes",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Les numéros peuvent être ajoutés séquentiellement aux étapes pour représenter clairement l'ordre d'exécution.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Numérotation des étapes",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "L'alignement des étapes dans l'en-tête de l'Assistant peut être ajusté pour être aligné à gauche ou justifié. Dans l'alignement justifié, les deux bords de l'en-tête sont alignés avec les bords de l'Assistant, et les étapes sont réparties uniformément sur la largeur disponible, indépendamment du nombre total d'étapes.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Aligner les étapes justifiées",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "La position de la barre d'outils avec les boutons de navigation peut être ajustée en utilisant l'une des deux propriétés. Les positions supportées sont en haut et en bas.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Positionnement de la barre d'outils de navigation",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "L'ID clé est un identifiant unique attribué à chaque étape. Il est généralement utilisé pour distinguer les étapes individuelles dans l'Assistant.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "ID clé",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Il peut être ajusté en fonction des décisions de conception, de l'espace disponible sur l'écran et des priorités de l'expérience utilisateur, si seule l'étape active ou toutes les étapes doivent être affichées dans un Assistant.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Afficher uniquement l'étape active (mobile)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "Un slot <strong>step</strong> peut être défini pour personnaliser le contenu dans une étape de l'Assistant. Le slot peut être utilisé par une ou plusieurs étapes.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Contenu personnalisé dans une étape",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "Un slot <strong>stepLabel</strong> peut être utilisé pour personnaliser le nom de chaque étape dans l'en-tête de l'Assistant.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Noms personnalisés dans l'en-tête",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "Un slot <strong>toolbar</strong> peut être utilisé pour personnaliser la barre d'outils avec les contrôles de navigation. Par exemple, un bouton supplémentaire peut être fourni.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Barre d'outils de navigation personnalisée",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "Un nombre correspondant à l'index (commençant à 0) peut être spécifié pour définir l'étape active initiale dans l'Assistant.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Étape active",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Chaque étape de l'Assistant peut contenir la propriété booléenne \"erreur\". Pour la valeur true, l'étape correspondante est mise en évidence comme erronée.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Erreur de l'étape",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Chaque étape de l'Assistant peut contenir la propriété booléenne \"avertissement\". Pour la valeur true, l'étape correspondante est mise en évidence comme étape d'avertissement. Cela est utile pour indiquer que quelque chose dans une étape peut différer de la norme, sans indiquer directement une erreur.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Avertissement de l'étape",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Permet de choisir la représentation visuelle des étapes dans l'en-tête. Un aperçu de toutes les étapes est affiché en haut de l'Assistant. Les valeurs suivantes sont acceptées : <strong>basic</strong>, <strong>arrows</strong>, <strong>square</strong> et <strong>round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Type",
  "_A_WIZARD_LABEL_STEPS_": "Étapes",
  "_A_WIZARD_LABEL_TYPE_": "Type",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Retour",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Suivant",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "aria-label traduisible pour l'élément principal de l'Assistant",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "aria-label traduisible pour le bloc contenant toutes les étapes de l'Assistant",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributs supplémentaires pour le bouton qui passe à l'étape précédente et qui ne sont pas explicitement définis comme des propriétés.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Une ou plusieurs classes CSS supplémentaires pour le bouton qui passe à l'étape précédente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Nom de l'icône qui est affichée à gauche du nom du bouton qui passe à l'étape précédente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nom de l'icône qui est affichée à droite du nom du bouton qui passe à l'étape précédente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Nom personnalisé pour le bouton qui passe à l'étape précédente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Titre personnalisé pour le bouton qui passe à l'étape précédente.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Valeurs supplémentaires utilisées dans l'Assistant.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributs supplémentaires pour le bouton qui passe à l'étape suivante et qui ne sont pas explicitement définis comme des propriétés.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Une ou plusieurs classes CSS supplémentaires pour le bouton qui passe à l'étape suivante.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Nom de l'icône qui est affichée à gauche du nom du bouton qui passe à l'étape suivante.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nom de l'icône qui est affichée à droite du nom du bouton qui passe à l'étape suivante.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Nom personnalisé pour le bouton qui passe à l'étape suivante.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Titre personnalisé pour le bouton qui passe à l'étape suivante.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Si le changement de focus est utilisé lors du passage à une autre étape dans un Assistant.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Indique un identifiant unique de l'Assistant.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape précédente doit être désactivé.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape précédente doit être masqué.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape précédente doit être masqué lors de la première étape de l'Assistant.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Détermine si le passage à l'une des étapes précédentes en cliquant dessus dans l'en-tête est désactivé.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Détermine si les boutons de la barre de navigation doivent être affichés avec un indicateur de chargement.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Détermine si la logique de contrôle externe pour la navigation des étapes dans l'Assistant est utilisée.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape suivante doit être désactivé.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape suivante doit être masqué.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Détermine si le bouton qui passe à l'étape suivante doit être masqué lors de la dernière étape de l'Assistant.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Détermine si le passage à l'une des étapes suivantes en cliquant dessus dans l'en-tête est désactivé.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Affiche si l'Assistant est affiché sur un appareil mobile ou non.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Détermine si les étapes sont justifiées.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Détermine si les étapes dans l'en-tête sont numérotées de manière séquentielle.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Détermine si la barre de navigation de l'Assistant doit être en bas, sous le contenu de l'étape active actuelle. Ceci est le positionnement par défaut.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Détermine si la barre de navigation de l'Assistant doit être en haut, au-dessus du contenu de l'étape active actuelle.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Affiche uniquement l'étape active actuelle dans un Assistant.",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Un tableau d'objets avec des informations sur chaque étape dans un Assistant.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Représente un objet où chaque clé correspond à un index d'étape et la valeur booléenne associée indique si l'étape correspondante a été visitée ou non.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Index de l'étape active actuelle dans l'Assistant.",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Texte indiquant la progression de l'utilisateur dans l'Assistant. Les variables disponibles dans l'espace réservé sont stepActive (étape active actuelle), stepsCount (nombre total d'étapes) et stepActiveLabel (étiquette de l'étape active actuelle).",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "ID pour téléporter la barre de navigation en bas de l'Assistant.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Ajuste la représentation visuelle des étapes dans l'en-tête.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Un slot contenant une étape dans l'Assistant.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Un slot contenant les noms des étapes dans l'en-tête de l'Assistant.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Un slot contenant la barre de navigation avec les boutons.",
  "_A_WIZARD_STEP_1_": "Étape 1",
  "_A_WIZARD_STEP_2_": "Étape 2",
  "_A_WIZARD_STEP_3_": "Étape 3",
  "_A_WIZARD_STEP_4_": "Étape 4",
  "_A_WIZARD_STEP_NAME_": "Nom de l'étape",
  "_A_WIZARD_TYPE_ARROWS_": "Flèche",
  "_A_WIZARD_TYPE_BASIC_": "Basique",
  "_A_WIZARD_TYPE_ROUND_": "Rond",
  "_A_WIZARD_TYPE_SQUARE_": "Carré",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Icône affichée en cas d'erreur dans l'étape",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Texte et titre pour le lecteur d'écran pour l'icône d'erreur",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Icône affichée en cas d'avertissement dans l'étape",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Texte et titre pour le lecteur d'écran pour l'icône d'avertissement"
}