{
  "_A_WIZARD_BTN_ADD_STEP_": "Aggiungi passaggio",
  "_A_WIZARD_BTN_DELETE_STEP_": "Elimina passaggio",
  "_A_WIZARD_COMPONENT_DESCRIPTION_": "Un Wizard è un'interfaccia utente sequenziale, passo dopo passo, progettata per guidare gli utenti attraverso compiti o processi complessi suddividendoli in passaggi più piccoli. Il Wizard contiene istruzioni chiare e spesso offre agli utenti la possibilità di andare avanti e indietro per fornire un'esperienza utente efficiente e semplice.",
  "_A_WIZARD_COMPONENT_NAME_": "Wizard",
  "_A_WIZARD_EVENTS_GO_STEP_BACK_DESCRIPTION_": "Una funzione responsabile per spostare l'utente al passaggio precedente del Wizard e per tutte le transizioni logiche aggiuntive.",
  "_A_WIZARD_EVENTS_GO_STEP_FORWARD_DESCRIPTION_": "Una funzione responsabile per spostare l'utente al passaggio successivo del Wizard e per tutte le transizioni logiche aggiuntive.",
  "_A_WIZARD_GROUP_BUTTONS_DESCRIPTION_": "I pulsanti di navigazione consentono agli utenti di andare avanti o indietro attraverso i passaggi del Wizard. Possono essere completamente personalizzati utilizzando le proprietà elencate.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_DESCRIPTION_": "Un modo alternativo per navigare nel Wizard è selezionare il passaggio direttamente nell'intestazione, invece di affidarsi esclusivamente ai pulsanti avanti e indietro. Entrambi i metodi di navigazione possono essere disabilitati secondo necessità.",
  "_A_WIZARD_GROUP_BUTTONS_DISABLED_HEADER_": "Disabilitare i pulsanti di navigazione",
  "_A_WIZARD_GROUP_BUTTONS_HEADER_": "Pulsanti di navigazione",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_DESCRIPTION_": "La visibilità di entrambi i pulsanti di navigazione può essere controllata separatamente, inclusa la visibilità nel primo e nell'ultimo passaggio.",
  "_A_WIZARD_GROUP_BUTTONS_HIDE_HEADER_": "Nascondere i pulsanti di navigazione",
  "_A_WIZARD_GROUP_DEMO_DESCRIPTION_": "L'esempio dimostrativo di un componente AWizard.",
  "_A_WIZARD_GROUP_DEMO_HEADER_": "Esempio dimostrativo",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_DESCRIPTION_": "Quando si passa a un altro passaggio in un Wizard, è possibile utilizzare il cambio di focus per indirizzare l'utente alla fonte del contenuto pertinente, anziché lasciare il focus sul pulsante di navigazione.",
  "_A_WIZARD_GROUP_HAS_FOCUS_JUMP_HEADER_": "Cambio di focus",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_DESCRIPTION_": "Il componente AWizard consente di visualizzare l'indicatore di caricamento all'interno dei pulsanti di navigazione. Questo può essere utile per indicare che un'operazione è in corso in background e che l'utente deve attendere il completamento del passaggio.",
  "_A_WIZARD_GROUP_IS_BUTTONS_LOADING_HEADER_": "Indicatore di caricamento",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_DESCRIPTION_": "La navigazione esterna dei passaggi include il controllo dinamico di un processo a più passaggi di un Wizard utilizzando variabili esterne o logica personalizzata, che consente una progressione personalizzata attraverso i passaggi in base a diverse esigenze e fattori.",
  "_A_WIZARD_GROUP_IS_CONTROL_OUTSIDE_HEADER_": "Navigazione esterna dei passaggi",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "I numeri possono essere aggiunti sequenzialmente ai passaggi per rappresentare chiaramente l'ordine di esecuzione.",
  "_A_WIZARD_GROUP_IS_STEP_NUMBER_VISIBLE_HEADER_": "Numerazione dei passaggi",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_DESCRIPTION_": "L'allineamento dei passaggi nell'intestazione del Wizard può essere regolato per essere allineato a sinistra o giustificato. Nell'allineamento giustificato, entrambi i bordi dell'intestazione sono allineati con i bordi del Wizard e i passaggi sono distribuiti uniformemente sulla larghezza disponibile, indipendentemente dal numero totale di passaggi.",
  "_A_WIZARD_GROUP_IS_STEPS_JUSTIFIED_HEADER_": "Allineare i passaggi giustificati",
  "_A_WIZARD_GROUP_IS_TOOLBAR_DESCRIPTION_": "La posizione della barra degli strumenti con i pulsanti di navigazione può essere regolata utilizzando una delle due proprietà. Le posizioni supportate sono sopra e sotto.",
  "_A_WIZARD_GROUP_IS_TOOLBAR_HEADER_": "Posizionamento della barra degli strumenti di navigazione",
  "_A_WIZARD_GROUP_KEY_ID_DESCRIPTION_": "Una chiave identificativa unica per ogni passo. Utilizzata per migliorare le prestazioni. Questa è la chiave per ciascuno degli oggetti nel prop <strong>steps</strong>. Il valore di questa chiave verrà trovato nell'oggetto e utilizzato come <strong>key</strong> nel ciclo. Se <strong>key-id</strong> non è specificato, verrà utilizzato <strong>index</strong> nel ciclo.",
  "_A_WIZARD_GROUP_KEY_ID_HEADER_": "Chiave identificativa unica",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Può essere regolato in base alle decisioni di design, allo spazio disponibile sullo schermo e alle priorità dell'esperienza utente, se visualizzare solo il passaggio attivo o tutti i passaggi in un Wizard.",
  "_A_WIZARD_GROUP_SHOW_ONLY_ACTIVE_STEP_MOBILE_HEADER_": "Visualizzare solo il passaggio attivo (Mobile)",
  "_A_WIZARD_GROUP_SLOT_DESCRIPTION_": "È possibile definire uno slot <strong>step</strong> per personalizzare il contenuto in un passaggio del Wizard. Lo slot può essere utilizzato da un singolo passaggio o da più passaggi.",
  "_A_WIZARD_GROUP_SLOT_HEADER_": "Contenuto personalizzato in un passaggio",
  "_A_WIZARD_GROUP_SLOT_LABEL_DESCRIPTION_": "È possibile utilizzare uno slot <strong>stepLabel</strong> per personalizzare il nome per ciascuno dei passaggi nell'intestazione del Wizard.",
  "_A_WIZARD_GROUP_SLOT_LABEL_HEADER_": "Nomi personalizzati nell'intestazione",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_DESCRIPTION_": "È possibile utilizzare uno slot <strong>toolbar</strong> per personalizzare la barra degli strumenti con i controlli di navigazione. Ad esempio, è possibile fornire un pulsante aggiuntivo.",
  "_A_WIZARD_GROUP_SLOT_TOOLBAR_HEADER_": "Barra degli strumenti di navigazione personalizzata",
  "_A_WIZARD_GROUP_STEP_ACTIVE_DESCRIPTION_": "È possibile specificare un numero corrispondente all'indice (a partire da 0) per impostare il passaggio attivo iniziale nel Wizard.",
  "_A_WIZARD_GROUP_STEP_ACTIVE_HEADER_": "Passaggio attivo",
  "_A_WIZARD_GROUP_STEPS_ERRORS_DESCRIPTION_": "Ciascun passaggio del Wizard può contenere la proprietà booleana \"errore\". Per il valore true, il passaggio corrispondente viene evidenziato come errato.",
  "_A_WIZARD_GROUP_STEPS_ERRORS_HEADER_": "Errore del passaggio",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_DESCRIPTION_": "Ciascun passaggio del Wizard può contenere la proprietà booleana \"avvertimento\". Per il valore true, il passaggio corrispondente viene evidenziato come passaggio di avvertimento. Questo è utile per indicare che qualcosa in un passaggio potrebbe differire dalla norma, senza indicare direttamente un errore.",
  "_A_WIZARD_GROUP_STEPS_WARNINGS_HEADER_": "Avvertimento del passaggio",
  "_A_WIZARD_GROUP_TYPE_DESCRIPTION_": "Consente di scegliere la rappresentazione visiva dei passaggi nell'intestazione. Una panoramica di tutti i passaggi viene visualizzata nella parte superiore del Wizard. Sono accettati i seguenti valori: <strong>basic</strong>, <strong>arrows</strong>, <strong>line</strong> e <strong>round</strong>.",
  "_A_WIZARD_GROUP_TYPE_HEADER_": "Tipo",
  "_A_WIZARD_LABEL_STEPS_": "Passaggi",
  "_A_WIZARD_LABEL_TYPE_": "Tipo",
  "_A_WIZARD_PAGE_BACK_BTN_TEXT_": "Indietro",
  "_A_WIZARD_PAGE_FORWARD_BTN_TEXT_": "Avanti",
  "_A_WIZARD_PROPS_ARIA_LABEL_DESCRIPTION_": "aria-label traducibile per l'elemento principale del Wizard",
  "_A_WIZARD_PROPS_ARIA_LABEL_STEPS_DESCRIPTION_": "aria-label traducibile per il blocco con tutti i passaggi del Wizard",
  "_A_WIZARD_PROPS_BACK_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributi aggiuntivi per il pulsante che passa al passaggio precedente e non sono definiti esplicitamente come proprietà.",
  "_A_WIZARD_PROPS_BACK_BUTTON_CLASS_DESCRIPTION_": "Una o più classi CSS aggiuntive per il pulsante che passa al passaggio precedente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_LEFT_DESCRIPTION_": "Nome dell'icona che viene visualizzata a sinistra del nome per il pulsante che passa al passaggio precedente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nome dell'icona che viene visualizzata a destra del nome per il pulsante che passa al passaggio precedente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TEXT_DESCRIPTION_": "Nome personalizzato per il pulsante che passa al passaggio precedente.",
  "_A_WIZARD_PROPS_BACK_BUTTON_TITLE_DESCRIPTION_": "Titolo personalizzato per il pulsante che passa al passaggio precedente.",
  "_A_WIZARD_PROPS_EXTRA_DESCRIPTION_": "Valori aggiuntivi utilizzati nel Wizard.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributi aggiuntivi per il pulsante che passa al passaggio successivo e non sono definiti esplicitamente come proprietà.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_CLASS_DESCRIPTION_": "Una o più classi CSS aggiuntive per il pulsante che passa al passaggio successivo.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_LEFT_DESCRIPTION_": "Nome dell'icona che viene visualizzata a sinistra del nome per il pulsante che passa al passaggio successivo.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_ICON_RIGHT_DESCRIPTION_": "Nome dell'icona che viene visualizzata a destra del nome per il pulsante che passa al passaggio successivo.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TEXT_DESCRIPTION_": "Nome personalizzato per il pulsante che passa al passaggio successivo.",
  "_A_WIZARD_PROPS_FORWARD_BUTTON_TITLE_DESCRIPTION_": "Titolo personalizzato per il pulsante che passa al passaggio successivo.",
  "_A_WIZARD_PROPS_HAS_FOCUS_JUMP_DESCRIPTION_": "Se viene utilizzato il cambio di focus quando si passa a un altro passaggio in un Wizard.",
  "_A_WIZARD_PROPS_ID_DESCRIPTION_": "Indica un identificatore univoco del Wizard.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_DISABLED_DESCRIPTION_": "Determina se il pulsante che passa al passaggio precedente deve essere disabilitato.",
  "_A_WIZARD_PROPS_IS_BACK_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante che passa al passaggio precedente deve essere nascosto.",
  "_A_WIZARD_PROPS_IS_BACK_FIRST_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante che passa al passaggio precedente deve essere nascosto nel primo passaggio del Wizard.",
  "_A_WIZARD_PROPS_IS_BACK_STEP_BUTTON_DISABLED_DESCRIPTION_": "Determina se il passaggio a uno dei passaggi precedenti facendo clic su di essi nell'intestazione è disabilitato.",
  "_A_WIZARD_PROPS_IS_BUTTONS_LOADING_DESCRIPTION_": "Determina se i pulsanti nella barra di navigazione vengono visualizzati con un indicatore di caricamento.",
  "_A_WIZARD_PROPS_IS_CONTROL_OUTSIDE_DESCRIPTION_": "Determina se la logica di controllo esterno per la navigazione dei passaggi nel Wizard viene utilizzata.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_DISABLED_DESCRIPTION_": "Determina se il pulsante che passa al passaggio successivo deve essere disabilitato.",
  "_A_WIZARD_PROPS_IS_FORWARD_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante che passa al passaggio successivo deve essere nascosto.",
  "_A_WIZARD_PROPS_IS_FORWARD_LAST_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante che passa al passaggio successivo deve essere nascosto nell'ultimo passaggio del Wizard.",
  "_A_WIZARD_PROPS_IS_FORWARD_STEP_BUTTON_DISABLED_DESCRIPTION_": "Determina se il passaggio a uno dei passaggi successivi facendo clic su di essi nell'intestazione è disabilitato.",
  "_A_WIZARD_PROPS_IS_MOBILE_DESCRIPTION_": "Visualizza se il Wizard viene visualizzato su un dispositivo mobile o meno.",
  "_A_WIZARD_PROPS_IS_STEP_NUMBER_VISIBLE_DESCRIPTION_": "Determina se i passaggi nell'intestazione sono numerati in sequenza.",
  "_A_WIZARD_PROPS_IS_STEPS_JUSTIFIED_DESCRIPTION_": "Determina se i passaggi sono giustificati.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_BOTTOM_DESCRIPTION_": "Determina se la barra di navigazione del Wizard deve essere in basso, sotto il contenuto del passaggio attivo attualmente. Questa è la posizione predefinita.",
  "_A_WIZARD_PROPS_IS_TOOLBAR_TOP_DESCRIPTION_": "Determina se la barra di navigazione del Wizard deve essere in alto, sopra il contenuto del passaggio attivo attualmente.",
  "_A_WIZARD_PROPS_KEY_ID_DESCRIPTION_": "Una chiave identificativa unica per ogni passo. Utilizzata per migliorare le prestazioni.",
  "_A_WIZARD_PROPS_SHOW_ONLY_ACTIVE_STEP_MOBILE_DESCRIPTION_": "Visualizza solo il passaggio attivo attualmente in un Wizard.",
  "_A_WIZARD_PROPS_STEP_ACTIVE_DESCRIPTION_": "Indice del passaggio attivo attualmente nel Wizard.",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_DESCRIPTION_": "Icona visualizzata in caso di errore nel passaggio",
  "_A_WIZARD_PROPS_STEP_ICON_ERROR_TEXT_DESCRIPTION_": "Testo e titolo per il lettore di schermo per l'icona dell'errore",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_DESCRIPTION_": "Icona visualizzata in caso di avvertimento nel passaggio",
  "_A_WIZARD_PROPS_STEP_ICON_WARNING_TEXT_DESCRIPTION_": "Testo e titolo per il lettore di schermo per l'icona dell'avvertimento",
  "_A_WIZARD_PROPS_STEP_PROGRESSBAR_TEXT_DESCRIPTION_": "Testo che indica il progresso dell'utente nel Wizard. Le variabili disponibili all'interno del segnaposto sono stepActive (passaggio attivo attualmente), stepsCount (numero totale di passaggi) e stepActiveLabel (etichetta del passaggio attivo attualmente).",
  "_A_WIZARD_PROPS_STEPS_DESCRIPTION_": "Un array di oggetti con informazioni su ciascun passaggio in un Wizard.",
  "_A_WIZARD_PROPS_STEPS_VISITED_DESCRIPTION_": "Rappresenta un oggetto in cui ogni chiave corrisponde a un indice di passaggio e il valore booleano associato indica se il passaggio corrispondente è stato visitato o meno.",
  "_A_WIZARD_PROPS_TOOLBAR_BOTTOM_TELEPORT_ID_DESCRIPTION_": "ID per teletrasportare la barra di navigazione nella parte inferiore del Wizard.",
  "_A_WIZARD_PROPS_TYPE_DESCRIPTION_": "Imposta la rappresentazione visiva dei passaggi nell'intestazione.",
  "_A_WIZARD_SLOTS_SLOT_DESCRIPTION_": "Uno slot che contiene un passaggio nel Wizard.",
  "_A_WIZARD_SLOTS_SLOT_LABEL_DESCRIPTION_": "Uno slot che contiene i nomi dei passaggi nell'intestazione del Wizard.",
  "_A_WIZARD_SLOTS_TOOLBAR_DESCRIPTION_": "Uno slot che contiene la barra di navigazione con i pulsanti.",
  "_A_WIZARD_STEP_1_": "Passaggio 1",
  "_A_WIZARD_STEP_2_": "Passaggio 2",
  "_A_WIZARD_STEP_3_": "Passaggio 3",
  "_A_WIZARD_STEP_4_": "Passaggio 4",
  "_A_WIZARD_STEP_NAME_": "Nome del passaggio",
  "_A_WIZARD_TYPE_ARROWS_": "Freccia",
  "_A_WIZARD_TYPE_BASIC_": "Base",
  "_A_WIZARD_TYPE_LINE_": "Lineare",
  "_A_WIZARD_TYPE_ROUND_": "Rotondo"
}