{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Die Komponente <strong lang=\"en\">APagination</strong> stellt die Navigation für große Datenmengen bereit. Sie kombiniert Auswahlfelder für Einträge pro Seite, eigene Layouts für Desktop und Mobile und löst die Events <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> aus, damit die konsumierende Ansicht mit der aktuellen Seite synchron bleibt.",
  "_A_PAGINATION_COMPONENT_NAME_": "Seitennummerierung",
  "_A_PAGINATION_PROPS_COUNT_ALL_ROWS_DESCRIPTION_": "Gesamtanzahl aller Zeilen im Datensatz. Aus diesem Wert werden der <strong lang=\"en\">from-to</strong>-Zähler und die Anzahl der verfügbaren Seiten berechnet.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Deaktiviert sämtliche Steuerelemente der Pagination - ideal während einer Nachladung oder wenn Navigation verhindert werden soll.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Anzahl der Zeilen pro Seite. Bei Änderungen emittiert die Komponente das Event <strong lang=\"en\">update:limit</strong>.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Liste der Einträge, die im Auswahlfeld \"pro Seite\" angezeigt werden. Werte können Strings oder Zahlen sein und spiegeln meist die Backend-Grenzen wider.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Maximale Anzahl nummerierter Seitenschaltflächen, die gleichzeitig angezeigt werden, bevor ein Auslassungssymbol erscheint.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Index der ersten Zeile der aktuellen Seite. Jeder Navigationsschritt löst <strong lang=\"en\">update:offset</strong> aus.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Wie viele Zeilen aktuell auf der Seite dargestellt werden. Wichtig, um den Bereich auf der letzten, eventuell unvollständigen Seite korrekt zu zeigen.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Darstellungskonfiguration für Desktop und Mobile. Für jede Plattform lässt sich festlegen, ob die Elemente als Button-Gruppe, Auswahlfeld oder verkürzte Navigation angezeigt werden sollen.",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "Deaktivierter Zustand",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Dieses Beispiel zeigt, wie die Prop <strong lang=\"en\">disabled</strong> umgeschaltet wird, um alle Elemente der Pagination zu sperren, während die Daten aktualisiert werden. Verwenden Sie den Schalter, um die Navigation mit einem Klick zu aktivieren oder zu deaktivieren."
}
