{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Die Komponente <strong lang=\"en\">APagination</strong> stellt die Navigation fur gro?e Datenmengen bereit. Sie kombiniert Auswahlfelder fur Eintrage pro Seite, eigene Layouts fur Desktop und Mobile und lost die Events <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> aus, damit die konsumierende Ansicht mit der aktuellen Seite synchron bleibt.",
  "_A_PAGINATION_COMPONENT_NAME_": "Seitennummerierung",
  "_A_PAGINATION_PROPS_COUNT_ALL_ROWS_DESCRIPTION_": "Gesamtanzahl aller Zeilen im Datensatz. Aus diesem Wert werden der <strong lang=\"en\">from-to</strong>-Zahler und die Anzahl der verfugbaren Seiten berechnet.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Deaktiviert samtliche Steuerelemente der Pagination - ideal wahrend einer Nachladung oder wenn Navigation verhindert werden soll.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Anzahl der Zeilen pro Seite. Bei Anderungen emittiert die Komponente das Event <strong lang=\"en\">update:limit</strong>.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Liste der Eintrage, die im Auswahlfeld \"pro Seite\" angezeigt werden. Werte konnen Strings oder Zahlen sein und spiegeln meist die Backend-Grenzen wider.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Maximale Anzahl nummerierter Seitenschaltflachen, die gleichzeitig angezeigt werden, bevor ein Auslassungssymbol erscheint.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Index der ersten Zeile der aktuellen Seite. Jeder Navigationsschritt lost <strong lang=\"en\">update:offset</strong> aus.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Wie viele Zeilen aktuell auf der Seite dargestellt werden. Wichtig, um den Bereich auf der letzten, eventuell unvollstandigen Seite korrekt zu zeigen.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Darstellungskonfiguration fur Desktop und Mobile. Fur jede Plattform lasst sich festlegen, ob die Elemente als Button-Gruppe, Auswahlfeld oder verkurzte Navigation angezeigt werden sollen.",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "Deaktivierter Zustand",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Dieses Beispiel zeigt, wie die Prop <strong lang=\"en\">disabled</strong> umgeschaltet wird, um alle Elemente der Pagination zu sperren, wahrend die Daten aktualisiert werden. Verwenden Sie den Schalter, um die Navigation mit einem Klick zu aktivieren oder zu deaktivieren.",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_HEADER_": "Eintrage pro Seite",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_DESCRIPTION_": "Verwenden Sie das geordnete Multiselect, um die Werte fur <strong lang=\"en\">limits-per-page</strong> zu konfigurieren. Die Auswahl bestimmt, welche Limits (5, 10, 25, 50, 75, 100) verfugbar sind.",
  "_A_PAGINATION_LIMITS_PER_PAGE_LABEL_": "Eintrage pro Seite",
  "_A_PAGINATION_GROUP_MAX_PAGES_HEADER_": "Maximale Seiten",
  "_A_PAGINATION_GROUP_MAX_PAGES_DESCRIPTION_": "Passen Sie den Slider an, um den Wert von <strong lang=\"en\">max-pages</strong> (1-10) zu steuern und zu sehen, wie viele Seitenbuttons gleichzeitig gerendert werden.",
  "_A_PAGINATION_MAX_PAGES_LABEL_": "Maximale Seiten"
}
