{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "El componente <strong lang=\"en\">APagination</strong> representa la navegacion para grandes conjuntos de datos. Combina controles por pagina, disenos de escritorio y movil y emite eventos <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> para mantener sincronizada la vista que lo consume.",
  "_A_PAGINATION_COMPONENT_NAME_": "Paginacion",
  "_A_PAGINATION_PROPS_TOTAL_COUNT_DESCRIPTION_": "Cantidad total de filas existentes en el conjunto de datos. Este valor determina el contador <strong lang=\"en\">from-to</strong> y el numero de paginas disponibles.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Deshabilita todos los controles de paginacion. Es util mientras se recargan las filas o cuando la navegacion debe bloquearse.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Numero de filas que se deben devolver por pagina. El componente emite <strong lang=\"en\">update:limit</strong> cuando el usuario selecciona un nuevo valor.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Lista de opciones que aparecen en el selector por pagina. Los valores pueden ser cadenas o numeros y suelen reflejar los limites del backend.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Numero maximo de botones de pagina numerados que pueden mostrarse a la vez antes de truncarse con puntos suspensivos.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Indice de la primera fila que pertenece a la pagina actual. El componente emite <strong lang=\"en\">update:offset</strong> cada vez que el usuario navega.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Cantidad de filas que realmente se muestran en la pagina actual. Necesario para mostrar correctamente el rango cuando la ultima pagina esta incompleta.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Configuracion visual para los disenos de escritorio y movil. Cada plataforma puede definir si los controles aparecen como grupos de botones, selectores o una navegacion corta.",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "Estado deshabilitado",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Este ejemplo muestra como alternar la prop <strong lang=\"en\">disabled</strong> para bloquear todos los controles de paginacion mientras se actualizan las filas. Usa el interruptor para activar o desactivar la navegacion con un solo clic.",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_HEADER_": "Limites por pagina",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_DESCRIPTION_": "Usa el multiselect ordenado para configurar los valores de <strong lang=\"en\">limits-per-page</strong>. La seleccion define los limites disponibles (5, 10, 25, 50, 75, 100).",
  "_A_PAGINATION_LIMITS_PER_PAGE_LABEL_": "Limites por pagina",
  "_A_PAGINATION_GROUP_MAX_PAGES_HEADER_": "Maximo de paginas",
  "_A_PAGINATION_GROUP_MAX_PAGES_DESCRIPTION_": "Ajusta el slider para controlar el valor de <strong lang=\"en\">max-pages</strong> (1-10) y ver cuantas botones de pagina se muestran a la vez.",
  "_A_PAGINATION_MAX_PAGES_LABEL_": "Maximo de paginas"
}
