{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Le composant <strong lang=\"en\">APagination</strong> fournit la navigation pour de grands ensembles de données. Il associe la sélection du nombre d’éléments par page, des mises en page adaptées au bureau et au mobile, et émet les événements <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> afin de garder la vue consommatrice synchronisée avec la page actuelle.",
  "_A_PAGINATION_COMPONENT_NAME_": "Pagination",
  "_A_PAGINATION_PROPS_COUNT_ALL_ROWS_DESCRIPTION_": "Nombre total de lignes disponibles dans l’ensemble des données. Sert à calculer l’indicateur <strong lang=\"en\">from-to</strong> et le nombre de pages.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Désactive tous les contrôles de pagination. Pratique pendant le rechargement ou lorsque la navigation doit être bloquée.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Nombre de lignes par page. Un changement déclenche l’événement <strong lang=\"en\">update:limit</strong>.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Liste des valeurs proposées dans le sélecteur \"par page\". Elles peuvent être des chaînes ou des nombres et représentent généralement les limites côté serveur.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Nombre maximal de boutons numérotés affichés avant de réduire la liste avec une ellipse.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Index de la première ligne de la page courante. Chaque navigation déclenche l’événement <strong lang=\"en\">update:offset</strong>.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Nombre de lignes réellement affichées sur la page courante. Utile pour présenter correctement l’intervalle sur la dernière page incomplète.",
  "_A_PAGINATION_PROPS_TOTAL_ROWS_COUNT_DESCRIPTION_": "Valeur annoncée avec le compteur et le texte du sélecteur. Correspond le plus souvent à <strong lang=\"en\">count-all-rows</strong>.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Configuration d’affichage pour les variantes bureau et mobile. Chaque plateforme peut définir si les contrôles apparaissent en groupe de boutons, en sélecteur ou sous forme de navigation compacte.",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "État désactivé",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Cet exemple montre comment basculer la prop <strong lang=\"en\">disabled</strong> afin de bloquer tous les contrôles de pagination pendant le rafraîchissement des données. Utilisez l'interrupteur pour activer ou désactiver la navigation en un clic."
}
