{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Le composant <strong lang=\"en\">APagination</strong> affiche la navigation pour les grands ensembles de donnees. Il combine les controles par page, des mises en page bureau et mobile, et emet les evenements <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> afin que la vue consommatrice reste synchronisee avec la page courante.",
  "_A_PAGINATION_COMPONENT_NAME_": "Pagination",
  "_A_PAGINATION_PROPS_TOTAL_COUNT_DESCRIPTION_": "Nombre total d'elements existant dans l'ensemble de donnees. Cette valeur pilote le compteur <strong lang=\"en\">from-to</strong> et le nombre de pages disponibles.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Desactive tous les controles de pagination. Utile pendant le rechargement des lignes ou lorsque la navigation doit etre bloquee.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Nombre de lignes a retourner par page. Le composant emet <strong lang=\"en\">update:limit</strong> lorsque l'utilisateur selectionne une nouvelle valeur.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Liste des options affichees dans le selecteur par page. Les valeurs peuvent etre des chaines ou des nombres et refletent generalement les limites du backend.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Nombre maximal de boutons de page numerotes pouvant etre affiches simultanement avant d'etre tronques avec des points de suspension.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Index de la premiere ligne appartenant a la page courante. Le composant emet <strong lang=\"en\">update:offset</strong> a chaque navigation.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Nombre de lignes effectivement rendues sur la page courante. Necessaire pour afficher correctement le compteur sur la derniere page incomplete.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Configuration d'affichage pour les mises en page bureau et mobile. Chaque plateforme peut definir comment les controles par page et la pagination doivent se comporter (groupe de boutons, selecteur, navigation courte, etc.).",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "Etat desactive",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Cet exemple montre comment basculer la prop <strong lang=\"en\">disabled</strong> afin de bloquer tous les controles de pagination pendant le rafraichissement des lignes. Utilisez l'interrupteur pour activer ou desactiver la navigation en un clic.",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_HEADER_": "Limites par page",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_DESCRIPTION_": "Utilisez le multiselect ordonne pour configurer les valeurs de <strong lang=\"en\">limits-per-page</strong>. La selection definit les limites disponibles (5, 10, 25, 50, 75, 100).",
  "_A_PAGINATION_LIMITS_PER_PAGE_LABEL_": "Limites par page",
  "_A_PAGINATION_GROUP_MAX_PAGES_HEADER_": "Maximum de pages",
  "_A_PAGINATION_GROUP_MAX_PAGES_DESCRIPTION_": "Ajustez le slider pour controler la valeur de <strong lang=\"en\">max-pages</strong> (1-10) et voir combien de boutons de page sont rendus a la fois.",
  "_A_PAGINATION_MAX_PAGES_LABEL_": "Maximum de pages"
}
