{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">APagination</strong> rende la navigazione per grandi set di dati. Combina controlli per pagina, layout desktop e mobile ed emette gli eventi <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong> cosi che la vista che lo consuma resti sincronizzata con la pagina corrente.",
  "_A_PAGINATION_COMPONENT_NAME_": "Paginazione",
  "_A_PAGINATION_PROPS_TOTAL_COUNT_DESCRIPTION_": "Numero totale di righe presenti nell'intero set di dati. Questo valore guida il contatore <strong lang=\"en\">from-to</strong> e il numero di pagine disponibili.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Disabilita tutti i controlli di paginazione. Utile mentre le righe vengono ricaricate o quando la navigazione deve essere bloccata.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Numero di righe da restituire per pagina. Il componente emette <strong lang=\"en\">update:limit</strong> quando l'utente seleziona un nuovo valore.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Elenco di opzioni che compaiono nel selettore per pagina. I valori possono essere stringhe o numeri e di solito riflettono i limiti del backend.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Numero massimo di pulsanti di pagina numerati che possono essere mostrati contemporaneamente prima del troncamento con ellissi.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Indice della prima riga appartenente alla pagina corrente. Il componente emette <strong lang=\"en\">update:offset</strong> ogni volta che l'utente naviga.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Quante righe sono effettivamente rese nella pagina corrente. Necessario per visualizzare correttamente il contatore quando l'ultima pagina e incompleta.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Configurazione di visualizzazione per layout desktop e mobile. Ogni piattaforma puo definire come si devono comportare i controlli per pagina e il paginatore (gruppi di pulsanti, select, navigazione breve, ecc.).",
  "_A_PAGINATION_GROUP_DISABLED_HEADER_": "Stato disabilitato",
  "_A_PAGINATION_GROUP_DISABLED_DESCRIPTION_": "Questo esempio mostra come attivare/disattivare la prop <strong lang=\"en\">disabled</strong> per bloccare tutti i controlli di paginazione mentre le righe vengono aggiornate. Usa l'interruttore per abilitare o disabilitare la navigazione con un solo clic.",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_HEADER_": "Limiti per pagina",
  "_A_PAGINATION_GROUP_LIMITS_PER_PAGE_DESCRIPTION_": "Usa il multiselect ordinato per configurare i valori di <strong lang=\"en\">limits-per-page</strong>. La selezione determina i limiti disponibili (5, 10, 25, 50, 75, 100).",
  "_A_PAGINATION_LIMITS_PER_PAGE_LABEL_": "Limiti per pagina",
  "_A_PAGINATION_GROUP_MAX_PAGES_HEADER_": "Numero massimo di pagine",
  "_A_PAGINATION_GROUP_MAX_PAGES_DESCRIPTION_": "Regola lo slider per controllare il valore di <strong lang=\"en\">max-pages</strong> (1-10) e vedere quante pulsanti di pagina vengono mostrati contemporaneamente.",
  "_A_PAGINATION_MAX_PAGES_LABEL_": "Numero massimo di pagine"
}
