{
  "_A_PAGINATION_COMPONENT_DESCRIPTION_": "Компонент <strong lang=\"en\">APagination</strong> отвечает за навигацию по большим наборам данных. Он сочетает управление количеством записей на странице, разные макеты для десктопа и мобильных устройств и генерирует события <strong lang=\"en\">update:limit</strong> / <strong lang=\"en\">update:offset</strong>, чтобы внешний вид оставался синхронизирован с выбранной страницей.",
  "_A_PAGINATION_COMPONENT_NAME_": "Пагинация",
  "_A_PAGINATION_PROPS_COUNT_ALL_ROWS_DESCRIPTION_": "Общее количество строк во всей выборке данных. Используется для подсчета диапазона <strong lang=\"en\">from-to</strong> и числа доступных страниц.",
  "_A_PAGINATION_PROPS_DISABLED_DESCRIPTION_": "Блокирует все элементы управления пагинации. Полезно во время загрузки строк или когда переходы между страницами нужно временно запретить.",
  "_A_PAGINATION_PROPS_LIMIT_DESCRIPTION_": "Количество строк на странице. При выборе нового значения компонент испускает событие <strong lang=\"en\">update:limit</strong>.",
  "_A_PAGINATION_PROPS_LIMITS_PER_PAGE_DESCRIPTION_": "Список вариантов, отображаемых в селекте \"на странице\". Значения задаются строками или числами и обычно соответствуют ограничениям бекенда.",
  "_A_PAGINATION_PROPS_MAX_PAGES_DESCRIPTION_": "Максимальное число пронумерованных кнопок, отображаемых одновременно, прежде чем появится многоточие.",
  "_A_PAGINATION_PROPS_OFFSET_DESCRIPTION_": "Индекс первой строки текущей страницы. При каждом переходе компонент испускает событие <strong lang=\"en\">update:offset</strong>.",
  "_A_PAGINATION_PROPS_ROWS_LENGTH_DESCRIPTION_": "Количество строк, фактически показанных на текущей странице. Нужен для корректного отображения диапазона на последней неполной странице.",
  "_A_PAGINATION_PROPS_TOTAL_ROWS_COUNT_DESCRIPTION_": "Число, которое выводится вместе с счётчиком и текстом per-page. Чаще всего совпадает со значением <strong lang=\"en\">count-all-rows</strong>.",
  "_A_PAGINATION_PROPS_MODES_DESCRIPTION_": "Настройка отображения для десктопного и мобильного макетов. Для каждой платформы можно определить, как должны вести себя блок выбора количества записей и пагинатор (группа кнопок, выпадающий список, короткая навигация и т.д.)."
}
