{
  "_A_TEXTAREA_COMPONENT_DESCRIPTION_": "Die Komponente <strong lang=\"en\">ATextarea</strong> bietet die Funktionalität eines Textfeldes mit verschiedenen Einstellungen wie Skalierbarkeit, einer Löschtaste und der Möglichkeit, die Größe zu ändern. Die Komponente unterstützt auch Labels, Hilfetexte und die Anzeige von Fehlern.",
  "_A_TEXTAREA_COMPONENT_NAME_": "Mehrzeiliges Textfeld",
  "_A_TEXTAREA_GROUP_IS_SCALABLE_DESCRIPTION_": "Dieses Beispiel zeigt ein Textfeld, dessen Höhe sich automatisch an den Inhalt anpasst. Wenn neue Zeilen hinzugefügt werden, erweitert sich das Textfeld und bietet eine optimale Größe, um den gesamten eingegebenen Text anzuzeigen.",
  "_A_TEXTAREA_GROUP_IS_SCALABLE_HEADER_": "Skalierbares Textfeld",
  "_A_TEXTAREA_GROUP_RESIZE_DESCRIPTION_": "Dieses Beispiel zeigt verschiedene Optionen zur Konfiguration der Größenänderung des Textfeldes. Sie können die vertikale Größenänderung <strong lang=\"en\">(resize='v')</strong>, die horizontale Größenänderung <strong lang=\"en\">(resize='h')</strong> festlegen, die Größenänderung vollständig deaktivieren <strong lang=\"en\">(resize='none')</strong> oder die automatische Größenänderung <strong lang=\"en\">(resize='auto')</strong> zulassen. Jede Option wird mit dem entsprechenden Textfeld demonstriert.",
  "_A_TEXTAREA_GROUP_RESIZE_HEADER_": "Änderung der Textfeldgröße",
  "_A_TEXTAREA_PROPS_IS_SCALABLE_DESCRIPTION_": "Bestimmt, ob die Höhe des Textfeldes basierend auf dem Inhalt geändert werden soll. Wenn dieser Parameter auf <strong lang=\"en\">true</strong> gesetzt ist, passt sich die Höhe des Textfeldes automatisch an, wenn Zeichen hinzugefügt oder entfernt werden.",
  "_A_TEXTAREA_PROPS_RESIZE_DESCRIPTION_": "Definiert, wie der Benutzer die Größe des Textfeldes ändern kann. Verfügbare Optionen: <strong lang=\"en\">'v'</strong> — vertikale Größenänderung, <strong lang=\"en\">'h'</strong> — horizontale Größenänderung, <strong lang=\"en\">'none'</strong> — Größenänderung ist deaktiviert, <strong lang=\"en\">'auto'</strong> — automatische Größenänderung.",
  "_A_TEXTAREA_PROPS_ROWS_DESCRIPTION_": "Legt die Anzahl der Zeilen für das Textfeld fest."
}