{
  "_A_MODAL_COMPONENT_DESCRIPTION_": "AModal è un componente che consente l'implementazione di finestre modali. Fornisce molte opzioni di personalizzazione, tra cui vari parametri per il contenuto, il comportamento dei pulsanti, i controlli di visibilità e le regolazioni delle dimensioni. Con slot personalizzabili per l'intestazione, il corpo e il piè di pagina, consente uno stile flessibile delle finestre modali per varie situazioni d'uso.",
  "_A_MODAL_COMPONENT_NAME_": "Finestra Modale",
  "_A_MODAL_GROUP_BODY_HTML_DESCRIPTION_": "La proprietà <strong>body-html</strong> viene utilizzata per visualizzare contenuto HTML personalizzato nella finestra modale.",
  "_A_MODAL_GROUP_BODY_HTML_HEADER_": "Utilizzo di <strong>body-html</strong>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_DESCRIPTION_": "<p>Questo esempio illustra varie opzioni per personalizzare il pulsante di chiusura.</p><p>Qui vengono utilizzate le proprietà <strong>close-button-attributes</strong>, <strong>close-button-class</strong>, <strong>close-button-id</strong> e <strong>close-button-text</strong> per personalizzare il pulsante di chiusura. Al pulsante di chiusura viene assegnato un tag di testo personalizzato, classi personalizzate e un ID personalizzato, e il testo del pulsante viene caricato da un file di traduzione.</p>",
  "_A_MODAL_GROUP_CLOSE_BUTTON_HEADER_": "Personalizzazione del Pulsante di Chiusura",
  "_A_MODAL_GROUP_FOOTER_STICKY_DESCRIPTION_": "Esempio di finestra modale con piè di pagina fisso in fondo che rimane in posizione mentre scorri il contenuto.",
  "_A_MODAL_GROUP_FOOTER_STICKY_HEADER_": "Finestra modale con piè di pagina fisso",
  "_A_MODAL_GROUP_IN_MODAL_DESCRIPTION_": "Questo esempio mostra la possibilità di aprire una finestra modale all'interno di un'altra. Tutte le modali possono essere gestite correttamente tramite <strong lang=\"en\">z-index</strong> e funzionare in modo indipendente tra loro.",
  "_A_MODAL_GROUP_IN_MODAL_HEADER_": "Modale dentro un modale",
  "_A_MODAL_GROUP_SAVE_BUTTON_DESCRIPTION_": "<p>Questo esempio illustra varie opzioni per personalizzare il pulsante di salvataggio.</p><p>Qui vengono utilizzate le proprietà <strong>save</strong>, <strong>save-button-attributes</strong>, <strong>save-button-class</strong> e <strong>save-button-id</strong> per personalizzare il pulsante di salvataggio. Al pulsante di salvataggio viene assegnato un tag di testo personalizzato, classi personalizzate e un ID personalizzato.</p>",
  "_A_MODAL_GROUP_SAVE_BUTTON_HEADER_": "Personalizzazione del Pulsante di Salvataggio",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_DESCRIPTION_": "<p>Questo esempio mostra l'uso di <strong>selector-close</strong> per impostare il focus su elementi specifici dopo la chiusura della finestra modale.</p><p>Il focus viene impostato sugli elementi con gli ID 'btn_aloha' e 'btn_open_modal' dopo la chiusura della finestra modale. Questo aiuta a mantenere il focus nel browser.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_HEADER_": "Utilizzo di <strong>selector-close</strong> per il Focus",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_DESCRIPTION_": "<p>Questo esempio mostra l'uso di <strong>selector-close-ids</strong> per impostare il focus su elementi specifici con ID dopo la chiusura della finestra modale.</p><p>Il focus viene impostato sugli elementi con ID 'btn_aloha' e 'btn_open_modal_id' dopo la chiusura della finestra modale. Questo aiuta a mantenere il focus nel browser.</p>",
  "_A_MODAL_GROUP_SELECTOR_CLOSE_IDS_HEADER_": "Utilizzo di <strong>selector-close-ids</strong> per il Focus",
  "_A_MODAL_GROUP_SIZE_DESCRIPTION_": "<p>Questo esempio mostra l'uso della proprietà <strong>size</strong> per regolare le dimensioni della finestra modale secondo necessità.</p><p>Le dimensioni della finestra modale si basano su opzioni come 'piccolo', 'grande', 'xl', 'xxl' e 'schermo intero'.</p>",
  "_A_MODAL_GROUP_SIZE_HEADER_": "Utilizzo della Proprietà <strong>size</strong> per Controllare le Dimensioni della Finestra Modale",
  "_A_MODAL_GROUP_SLOTS_DESCRIPTION_": "Questo esempio mostra l'uso di vari slot per personalizzare il contenuto nella finestra modale.",
  "_A_MODAL_GROUP_SLOTS_HEADER_": "Utilizzo degli Slot per il Contenuto della Finestra Modale",
  "_A_MODAL_PAGE_BTN_CLOSE_": "Chiudi",
  "_A_MODAL_PAGE_BTN_OPEN_MODAL_": "Apri Finestra Modale",
  "_A_MODAL_PROPS_BACKDROP_Z_INDEX_DESCRIPTION_": "Se impostato, questa proprietà specifica lo z-index CSS per lo sfondo della finestra modale.",
  "_A_MODAL_PROPS_BODY_HTML_CLASS_DESCRIPTION_": "Aggiunge una classe <strong lang=\"en\">CSS</strong> all' <strong lang=\"en\">HTML</strong> che può essere utilizzata nella finestra modale. <strong lang=\"en\">body-html</strong>",
  "_A_MODAL_PROPS_BODY_HTML_DESCRIPTION_": "Il contenuto HTML della finestra modale.",
  "_A_MODAL_PROPS_CLASS_EXTRA_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong> aggiuntiva per la finestra modale, che può essere utilizzata per test automatizzati o come selettore aggiuntivo.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributi per il pulsante di chiusura della finestra modale. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_CLASS_DESCRIPTION_": "La classe o le classi del pulsante di chiusura. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_CLOSE_BUTTON_ID_DESCRIPTION_": "L'ID del pulsante di chiusura.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_TEXT_DESCRIPTION_": "Il testo sul pulsante di chiusura.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_TEXT_SCREEN_READER_FOOTER_DESCRIPTION_": "Aggiunge un testo per il lettore di schermo per il pulsante 'Chiudi finestra modale' nel footer.",
  "_A_MODAL_PROPS_CLOSE_BUTTON_TEXT_SCREEN_READER_HEADER_DESCRIPTION_": "Aggiunge un testo per il lettore di schermo per il pulsante 'Chiudi finestra modale' nell'header.",
  "_A_MODAL_PROPS_CLOSE_DESCRIPTION_": "La funzione che consente di chiudere la finestra modale.",
  "_A_MODAL_PROPS_DISABLED_DESCRIPTION_": "Specifica se la finestra modale è disabilitata.",
  "_A_MODAL_PROPS_DISABLED_SAVE_DESCRIPTION_": "Specifica se il pulsante di salvataggio nella finestra modale è disabilitato.",
  "_A_MODAL_PROPS_EXTRA_DESCRIPTION_": "Un oggetto con parametri per le traduzioni. <a href=\"/#/translation\">(ATranslation)</a>",
  "_A_MODAL_PROPS_FOCUS_START_ID_DESCRIPTION_": "Se viene impostato un <strong lang=\"en\">ID</strong>, il focus si posiziona sull'elemento con questo <strong lang=\"en\">ID</strong> quando si apre la finestra modale (se <strong lang=\"en\">use-focus-on-start</strong> è impostato su <strong lang=\"en\">true</strong>).",
  "_A_MODAL_PROPS_HEADER_TAG_DESCRIPTION_": "Il tag HTML per l'intestazione della finestra modale.",
  "_A_MODAL_PROPS_HEADER_TEXT_DESCRIPTION_": "Il testo nell'intestazione della finestra modale.",
  "_A_MODAL_PROPS_HIDE_FOOTER_DESCRIPTION_": "Specifica se nascondere il piè di pagina nella finestra modale.",
  "_A_MODAL_PROPS_HIDE_HEADER_DESCRIPTION_": "Nasconde l'intestazione della finestra modale.",
  "_A_MODAL_PROPS_ID_DESCRIPTION_": "L'ID della finestra modale.",
  "_A_MODAL_PROPS_IS_CLOSE_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante di chiusura è visibile.",
  "_A_MODAL_PROPS_IS_CONFIRM_DESCRIPTION_": "Specifica se la finestra modale richiede conferma. (Solo per <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_FOOTER_STICKY_DESCRIPTION_": "Determina se il piè di pagina è fissato in basso nella finestra modale.",
  "_A_MODAL_PROPS_IS_MODAL_HIDDEN_DESCRIPTION_": "Determina se la finestra modale è nascosta. (Solo per <a href=\"/#/confirm\">AConfirm</a>)",
  "_A_MODAL_PROPS_IS_SAVE_BUTTON_HIDE_DESCRIPTION_": "Determina se il pulsante di salvataggio è visibile.",
  "_A_MODAL_PROPS_LOADING_DESCRIPTION_": "Specifica se la finestra modale è in uno stato di caricamento.",
  "_A_MODAL_PROPS_MODAL_CLASS_DESCRIPTION_": "La classe o le classi della finestra modale.",
  "_A_MODAL_PROPS_MODAL_STYLE_DESCRIPTION_": "Lo stile o gli stili della finestra modale.",
  "_A_MODAL_PROPS_SAVE_BUTTON_ATTRIBUTES_DESCRIPTION_": "Attributi per il pulsante di salvataggio nella finestra modale. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_CLASS_DESCRIPTION_": "La classe o le classi del pulsante di salvataggio. <a href=\"/#/button\">(AButton)</a>",
  "_A_MODAL_PROPS_SAVE_BUTTON_ID_DESCRIPTION_": "L'ID del pulsante di salvataggio.",
  "_A_MODAL_PROPS_SAVE_BUTTON_TEXT_DESCRIPTION_": "Il testo sul pulsante di salvataggio.",
  "_A_MODAL_PROPS_SAVE_BUTTON_TEXT_SCREEN_READER_DESCRIPTION_": "Aggiunge un testo per il lettore di schermo per il pulsante 'Salva' nella finestra modale.",
  "_A_MODAL_PROPS_SAVE_DESCRIPTION_": "La funzione che consente di salvare nella finestra modale.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_DESCRIPTION_": "Il selettore di focus per assicurare che il focus non venga perso nel browser quando viene chiusa la finestra modale.",
  "_A_MODAL_PROPS_SELECTOR_CLOSE_IDS_DESCRIPTION_": "L'ID o gli ID per il focus per assicurare che il focus non venga perso nel browser quando viene chiusa la finestra modale.",
  "_A_MODAL_PROPS_SHOW_CLOSE_BUTTON_HEADER_DESCRIPTION_": "Determina se visualizzare il pulsante di chiusura (\"x\") nell'intestazione della finestra modale.",
  "_A_MODAL_PROPS_SIZE_DESCRIPTION_": "Le dimensioni della finestra modale (piccola, grande, xl, xxl, schermo intero).",
  "_A_MODAL_PROPS_STOP_DESCRIPTION_": "Aggiunge un evento di clic con stopPropagation all'elemento padre della finestra modale per impedire che l'evento si propaghi ulteriormente.",
  "_A_MODAL_PROPS_USE_ESCAPE_DESCRIPTION_": "Specifica se il tasto Esc può chiudere la finestra modale.",
  "_A_MODAL_PROPS_USE_FOCUS_ON_START_DESCRIPTION_": "Se impostato su <strong lang=\"en\">true</strong> e non viene impostato <strong lang=\"en\">focus-start-id</strong>, il focus viene posizionato sul primo elemento focalizzabile nella finestra modale.",
  "_A_MODAL_PROPS_Z_INDEX_DESCRIPTION_": "Specifica lo z-index CSS per la finestra modale stessa.",
  "_A_MODAL_SLOTS_MODAL_BODY_DESCRIPTION_": "Uno slot che contiene il contenuto principale della finestra modale.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_APPEND_DESCRIPTION_": "Uno slot visualizzato dopo i pulsanti di salvataggio e chiusura nel piè di pagina della finestra modale.",
  "_A_MODAL_SLOTS_MODAL_FOOTER_PREPEND_DESCRIPTION_": "Uno slot visualizzato prima dei pulsanti di salvataggio e chiusura nel piè di pagina della finestra modale.",
  "_A_MODAL_SLOTS_MODAL_HEADER_DESCRIPTION_": "Uno slot che contiene il contenuto dell'intestazione della finestra modale."
}
