{
  "_A_LIST_CLASS_ITEM_PROP_DESCRIPTION_": "Clase CSS para cada elemento en la lista",
  "_A_LIST_CLASS_MAIN_PROP_DESCRIPTION_": "Clase CSS para cada elemento padre",
  "_A_LIST_COMPONENT_DESCRIPTION_": "El componente <strong>AList</strong> permite renderizar listas fácilmente con opciones de configuración flexibles para la presentación de datos.",
  "_A_LIST_COMPONENT_NAME_": "Lista",
  "_A_LIST_DATA_PROP_DESCRIPTION_": "Array con los datos a renderizar",
  "_A_LIST_GROUP_CLASS_GROUP_DESCRIPTION_": "Especificar la clase CSS para la lista principal o el elemento.",
  "_A_LIST_GROUP_CLASS_GROUP_HEADER_": "Estilo de Lista y Elemento",
  "_A_LIST_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Este ejemplo demuestra el uso de la propiedad <strong>is-data-simple-array</strong> en el componente para manejar diferentes tipos de datos: arrays simples y jerarquías anidadas.",
  "_A_LIST_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Uso con Arrays Simples y Jerarquías Anidadas",
  "_A_LIST_GROUP_IS_HTML_DESCRIPTION_": "Este ejemplo muestra el uso de la propiedad <strong>is-html</strong> en el componente en conjunto con el componente <strong>a-switch</strong> para controlar dinámicamente la visualización de la lista entre formato de texto y HTML.",
  "_A_LIST_GROUP_IS_HTML_HEADER_": "Visualización de Listas en Formato de Texto o HTML",
  "_A_LIST_GROUP_SEPARATOR_DESCRIPTION_": "Este ejemplo muestra el uso de la propiedad <strong>separator</strong> en el componente para establecer separadores personalizados entre elementos.",
  "_A_LIST_GROUP_SEPARATOR_HEADER_": "Separadores Personalizados Entre Elementos",
  "_A_LIST_GROUP_TAG_DESCRIPTION_": "Uso del componente para cambiar dinámicamente entre listas ordenadas (<strong>ol</strong>) y desordenadas (<strong>ul</strong>) mediante la propiedad <strong>tag</strong>.",
  "_A_LIST_GROUP_TAG_HEADER_": "Ajuste Dinámico de la Etiqueta HTML",
  "_A_LIST_IS_DATA_SIMPLE_ARRAY_PROP_DESCRIPTION_": "Indica si solo se usa un array simple sin objetos",
  "_A_LIST_IS_HTML_PROP_DESCRIPTION_": "Si es verdadero, se crea una lista HTML (&lt;ul&gt;&lt;li&gt;...&lt;/li&gt;&lt;/ul&gt;). De lo contrario, se genera una lista de texto (&lt;span&gt;...&lt;/span&gt;)",
  "_A_LIST_KEY_CHILDREN_DESCRIPTION_": "La propiedad <strong>key-children</strong> permite que los elementos tengan sus propios elementos secundarios, habilitando la presentación de datos jerárquicos.",
  "_A_LIST_KEY_CHILDREN_HEADER_": "Presentación de Datos Jerárquicos",
  "_A_LIST_KEY_CHILDREN_PROP_DESCRIPTION_": "Clave para sub-elementos, si los datos son un array de objetos",
  "_A_LIST_KEY_ID_DESCRIPTION_": "<p>Este ejemplo demuestra el uso de la propiedad <strong>key-id</strong> en el componente para asignar un identificador único a cada elemento en la lista. Esto es particularmente útil cuando la lista está compuesta de un array de objetos y cada objeto tiene una clave única (ID).</p><p>En el segundo ejemplo, la clave de etiqueta <strong>(label)</strong> se usa como identificador para los elementos de la lista.</p>",
  "_A_LIST_KEY_ID_HEADER_": "Identificación Única de Elementos de la Lista",
  "_A_LIST_KEY_ID_PROP_DESCRIPTION_": "Clave para identificaciones únicas, si los datos son un array de objetos (para mejorar el rendimiento)",
  "_A_LIST_KEY_LABEL_CALLBACK_DESCRIPTION_": "La propiedad <strong>key-label-callback</strong> permite una transformación personalizada de las etiquetas de los elementos.",
  "_A_LIST_KEY_LABEL_CALLBACK_HEADER_": "Formato Personalizado para Etiquetas",
  "_A_LIST_KEY_LABEL_CALLBACK_PROP_DESCRIPTION_": "Función para generar etiquetas con dos parámetros (<strong>item</strong> y <strong>itemIndex</strong>), si los datos son un array de objetos",
  "_A_LIST_KEY_LABEL_PROP_DESCRIPTION_": "Clave para la etiqueta que se mostrará, si los datos son un array de objetos",
  "_A_LIST_LABEL_TAG_PROP_DESCRIPTION_": "Etiqueta HTML para las etiquetas",
  "_A_LIST_LIST_ITEM_TAG_PROP_DESCRIPTION_": "Etiqueta HTML para los elementos en la lista",
  "_A_LIST_SEPARATOR_PROP_DESCRIPTION_": "Separador entre elementos",
  "_A_LIST_SEPARATOR_HTML_PROP_DESCRIPTION_": "_A_LIST_SEPARATOR_HTML_PROP_DESCRIPTION_",
  "_A_LIST_SLOT_DESCRIPTION_": "Contenido personalizado para cada elemento en la lista",
  "_A_LIST_TAG_PROP_DESCRIPTION_": "Etiqueta HTML para toda la lista",
  "_A_LIST_WITH_SLOT_DESCRIPTION_": "Una lista con contenido personalizado en los elementos a través del slot.",
  "_A_LIST_WITH_SLOT_HEADER_": "Slot"
}
