{
  "_A_LIST_CLASS_ITEM_PROP_DESCRIPTION_": "Classe CSS per ogni elemento nella lista",
  "_A_LIST_CLASS_MAIN_PROP_DESCRIPTION_": "Classe CSS per ogni elemento genitore",
  "_A_LIST_COMPONENT_DESCRIPTION_": "Il componente <strong>AList</strong> consente una facile renderizzazione delle liste con opzioni di configurazione flessibili per la presentazione dei dati.",
  "_A_LIST_COMPONENT_NAME_": "Lista",
  "_A_LIST_DATA_PROP_DESCRIPTION_": "Array con i dati da renderizzare",
  "_A_LIST_GROUP_CLASS_GROUP_DESCRIPTION_": "Specifica la classe CSS per la lista principale o l'elemento.",
  "_A_LIST_GROUP_CLASS_GROUP_HEADER_": "Stile di Lista ed Elemento",
  "_A_LIST_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Questo esempio dimostra l'uso della proprietà <strong>is-data-simple-array</strong> nel componente per gestire diversi tipi di dati: array semplici e gerarchie annidate.",
  "_A_LIST_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Uso con Array Semplici e Gerarchie Annidate",
  "_A_LIST_GROUP_IS_HTML_DESCRIPTION_": "Questo esempio mostra l'uso della proprietà <strong>is-html</strong> nel componente in combinazione con il componente <strong>a-switch</strong> per controllare dinamicamente la visualizzazione dell'elenco tra formato testo e HTML.",
  "_A_LIST_GROUP_IS_HTML_HEADER_": "Visualizzazione delle Liste in Formato Testo o HTML",
  "_A_LIST_GROUP_SEPARATOR_DESCRIPTION_": "Questo esempio mostra l'uso della proprietà <strong>separator</strong> nel componente per impostare separatori personalizzati tra gli elementi (funziona solo quando <strong>is-html</strong> è impostato su <strong>false</strong>).",
  "_A_LIST_GROUP_SEPARATOR_HEADER_": "Separatori Personalizzati Tra Gli Elementi",
  "_A_LIST_GROUP_TAG_DESCRIPTION_": "Uso del componente per passare dinamicamente tra liste ordinate (<strong>ol</strong>) e non ordinate (<strong>ul</strong>) tramite la proprietà <strong>tag</strong>.",
  "_A_LIST_GROUP_TAG_HEADER_": "Adattamento Dinamico del Tag HTML",
  "_A_LIST_IS_DATA_SIMPLE_ARRAY_PROP_DESCRIPTION_": "Indica se viene utilizzato solo un array semplice senza oggetti",
  "_A_LIST_IS_HTML_PROP_DESCRIPTION_": "Se vero, viene creata una lista HTML (&lt;ul&gt;&lt;li&gt;...&lt;/li&gt;&lt;/ul&gt;). Altrimenti, viene generata una lista di testo (&lt;span&gt;...&lt;/span&gt;)",
  "_A_LIST_KEY_CHILDREN_DESCRIPTION_": "La proprietà <strong>key-children</strong> consente agli elementi di avere i propri elementi figli, consentendo la presentazione di dati gerarchici.",
  "_A_LIST_KEY_CHILDREN_HEADER_": "Presentazione di Dati Gerarchici",
  "_A_LIST_KEY_CHILDREN_PROP_DESCRIPTION_": "Chiave per sottoggetti, se i dati sono un array di oggetti",
  "_A_LIST_KEY_ID_DESCRIPTION_": "<p>Questo esempio dimostra l'uso della proprietà <strong>key-id</strong> nel componente per assegnare un identificatore unico a ciascun elemento della lista. Questo è particolarmente utile quando la lista è composta da un array di oggetti e ogni oggetto ha una chiave unica (ID).</p><p>Nel secondo esempio, la chiave dell'etichetta <strong>(label)</strong> viene utilizzata come identificatore per gli elementi della lista.</p>",
  "_A_LIST_KEY_ID_HEADER_": "Identificazione Unica degli Elementi della Lista",
  "_A_LIST_KEY_ID_PROP_DESCRIPTION_": "Chiave per ID unici, se i dati sono un array di oggetti (per migliorare le prestazioni)",
  "_A_LIST_KEY_LABEL_CALLBACK_DESCRIPTION_": "La proprietà <strong>key-label-callback</strong> consente una trasformazione personalizzata delle etichette degli elementi.",
  "_A_LIST_KEY_LABEL_CALLBACK_HEADER_": "Formato Personalizzato per le Etichette",
  "_A_LIST_KEY_LABEL_CALLBACK_PROP_DESCRIPTION_": "Funzione per generare etichette con due parametri (<strong>item</strong> e <strong>itemIndex</strong>), se i dati sono un array di oggetti",
  "_A_LIST_KEY_LABEL_PROP_DESCRIPTION_": "Chiave per l'etichetta da visualizzare, se i dati sono un array di oggetti",
  "_A_LIST_LABEL_TAG_PROP_DESCRIPTION_": "Tag HTML per le etichette",
  "_A_LIST_LIST_ITEM_TAG_PROP_DESCRIPTION_": "Tag HTML per gli elementi nella lista",
  "_A_LIST_SEPARATOR_PROP_DESCRIPTION_": "Separatore tra gli elementi (attivo solo quando <strong>is-html</strong> è impostato su <strong>false</strong>)",
  "_A_LIST_SLOT_DESCRIPTION_": "Contenuto personalizzato per ogni elemento della lista",
  "_A_LIST_TAG_PROP_DESCRIPTION_": "Tag HTML per l'intera lista",
  "_A_LIST_WITH_SLOT_DESCRIPTION_": "Una lista con contenuto personalizzato negli elementi tramite lo slot.",
  "_A_LIST_WITH_SLOT_HEADER_": "Slot"
}
