{
  "_A_DROPDOWN_COMPONENT_NAME_": "Dropdown",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Anpassbare Button-Klasse",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "Die Klasse des Dropdown-Buttons kann mit der Prop <strong>button-class</strong> angepasst werden.",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "Die Prop ermöglicht es Ihnen, die Klasse des Dropdown-Buttons anzupassen.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Anpassbare Anzeige des Caret-Icons",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "Die ADropdown-Komponente für Vue.js ermöglicht es, die Anzeige des Caret-Icons anzupassen. In dieser Dokumentation wird die Prop <strong>has-caret</strong> beschrieben, die steuert, ob das Caret-Icon angezeigt wird oder nicht.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "Die Prop ermöglicht es Ihnen, festzulegen, ob das Caret-Icon in der Dropdown-Komponente angezeigt wird.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Anpassbares Caret-Icon",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "Das Caret-Icon des Dropdowns kann angepasst werden.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "Die Prop ermöglicht es Ihnen, das Caret-Icon des Dropdowns anzupassen.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Anpassbare Auslöser für das Dropdown",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "Die ADropdown-Komponente für Vue.js bietet die Möglichkeit, die Auslöser für das Dropdown anzupassen. In dieser Dokumentation wird die Props triggers beschrieben, die das Array der Auslöser definiert.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "Die Prop ermöglicht es Ihnen, die Auslöser festzulegen, die das Dropdown anzeigen.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Anpassbarer Button-Text",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "Hier wird die Prop <strong>button-text</strong> beschrieben, die es ermöglicht, den Text des Dropdown-Buttons anzupassen.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Dropdown-Inhalt in Body oder direkt nach Dropdown-Button",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "Die Prop inBody steuert, ob der Dropdown-Inhalt im Body oder direkt nach dem Dropdown-Button gerendert werden soll.",
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "Die ADropdown-Komponente ist eine Dropdown-Komponente für Vue.js, die es ermöglicht, eine Liste von Aktionen in einem Dropdown-Menü anzuzeigen. Diese Dokumentation enthält Informationen zur Verwendung der Komponente und beschreibt die verfügbaren Props.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "Die Prop ermöglicht die Kontrolle darüber, ob der Dropdown-Inhalt im Body oder direkt nach dem Dropdown-Button gerendert werden soll.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "Die Prop ermöglicht es Ihnen, den Text des Dropdown-Buttons anzupassen. "
}