{
  "_A_DROPDOWN_COMPONENT_NAME_": "Dropdown",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_HEADER_": "Dropdown Button Loading State",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_DESCRIPTION_": "The loading state of the dropdown button can be customized using the props <strong>button-loading</strong> and <strong>button-loading-align</strong>.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_": "This prop allows you to control the loading state of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_": "This prop allows you to adjust the position of the loading state within the button.",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_HEADER_": "Customizable Button Icons",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_DESCRIPTION_": "Icons before and after the text of the dropdown button can be customized using the props <strong>button-icon-left</strong> and <strong>button-icon-right</strong>.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_": "These props enable you to display the icon before the text of the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_": "These props enable you to display the icon after the text of the dropdown button.",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Customizable Button Class",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "The class of the dropdown button can be customized using the <strong>button-class</strong> prop.",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "This prop allows you to customize the class of the dropdown button.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Customizable Caret Icon Display",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "The ADropdown component for Vue.js allows you to customize the display of the caret icon. This documentation describes the <strong>has-caret</strong> prop, which controls whether the caret icon is displayed or not.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "This prop allows you to specify whether the caret icon should be displayed in the dropdown component.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Customizable Caret Icon",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "The dropdown's caret icon can be customized.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "This prop allows you to customize the caret icon of the dropdown.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Customizable Dropdown Triggers",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "The ADropdown component for Vue.js provides the ability to customize the triggers for the dropdown. This documentation describes the <strong>triggers</strong> prop, which defines the array of triggers.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "This prop allows you to specify the triggers that show the dropdown.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Customizable Button Text",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "This documentation describes the <strong>button-text</strong> prop, which allows you to customize the text of the dropdown button.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Dropdown Content in Body or Directly After Dropdown Button",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "The <strong>inBody</strong> prop controls whether the dropdown content should be rendered in the body or directly after the dropdown button.",
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "The ADropdown component is a dropdown component for Vue.js that allows you to display a list of actions in a dropdown menu. This documentation provides information on how to use the component and describes the available props.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "This prop allows you to control whether the dropdown content should be rendered in the body or directly after the dropdown button.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "This prop allows you to customize the text of the dropdown button."
}
