{
  "_A_DROPDOWN_COMPONENT_NAME_": "Menú desplegable",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_HEADER_": "Estado de carga del botón del menú desplegable",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_DESCRIPTION_": "El estado de carga del botón del menú desplegable se puede personalizar utilizando las propiedades <strong>button-loading</strong> y <strong>button-loading-align</strong>.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_": "Esta propiedad le permite controlar el estado de carga del botón del menú desplegable.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_": "Esta propiedad le permite ajustar la posición del estado de carga dentro del botón.",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_HEADER_": "Iconos de botón personalizables",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_DESCRIPTION_": "Los iconos antes y después del texto del botón del menú desplegable se pueden personalizar utilizando las propiedades <strong>button-icon-left</strong> y <strong>button-icon-right</strong>.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_": "Estas propiedades le permiten mostrar el icono antes del texto del botón del menú desplegable.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_": "Estas propiedades le permiten mostrar el icono después del texto del botón del menú desplegable.",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Clase de botón personalizable",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "La clase del botón del menú desplegable se puede personalizar utilizando la propiedad <strong>button-class</strong>.",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "Esta propiedad le permite personalizar la clase del botón del menú desplegable.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Personalización de la visualización del icono de la caret",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "El componente ADropdown para Vue.js le permite personalizar la visualización del icono de la caret. Esta documentación describe la propiedad <strong>has-caret</strong>, que controla si se muestra o no el icono de caret.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "Esta propiedad le permite especificar si se debe mostrar el icono de caret en el componente de menú desplegable.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Icono de caret personalizable",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "El icono de caret del menú desplegable se puede personalizar.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "Esta propiedad le permite personalizar el icono de caret del menú desplegable.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Disparadores de menú desplegable personalizables",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "El componente ADropdown para Vue.js proporciona la capacidad de personalizar los disparadores para el menú desplegable. Esta documentación describe la propiedad <strong>triggers</strong>, que define la matriz de disparadores.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "Esta propiedad le permite especificar los disparadores que muestran el menú desplegable.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Texto de botón personalizable",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "Esta documentación describe la propiedad <strong>button-text</strong>, que le permite personalizar el texto del botón del menú desplegable.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Contenido del menú desplegable en el cuerpo o directamente después del botón del menú desplegable",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "La propiedad <strong>inBody</strong> controla si el contenido del menú desplegable debe renderizarse en el cuerpo o directamente después del botón del menú desplegable.",
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "El componente ADropdown es un componente de menú desplegable para Vue.js que le permite mostrar una lista de acciones en un menú desplegable. Esta documentación proporciona información sobre cómo usar el componente y describe las propiedades disponibles.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "Esta propiedad le permite controlar si el contenido del menú desplegable debe renderizarse en el cuerpo o directamente después del botón del menú desplegable.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "Esta propiedad le permite personalizar el texto del botón del menú desplegable."
}
