{
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "Komponenta ADropdown predstavlja padajući izbornik koji korisniku omogućuje prikaz liste akcija za izbor. Ova dokumentacija sadrži informacije o uporabi komponente te opisuje dostupne propove.",
  "_A_DROPDOWN_COMPONENT_NAME_": "Padajući izbornik",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "Klasa gumba padajućeg izbornika može se prilagoditi koristeći prop <strong>button-class</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Prilagodljiva klasa gumba",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_DESCRIPTION_": "Ikonice prije i poslije teksta gumba padajućeg izbornika mogu se prilagoditi koristeći propove <strong>button-icon-left</strong> i <strong>button-icon-right</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_HEADER_": "Prilagodljive ikonice gumba",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_DESCRIPTION_": "Indikator učitavanja gumba padajućeg izbornika može se prilagoditi koristeći propove <strong>button-loading</strong> i <strong>button-loading-align</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_HEADER_": "Indikator učitavanja gumba padajućeg izbornika",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "Prop <strong>button-text</strong> omogućuje prilagodbu teksta gumba padajućeg izbornika.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Prilagodljivi tekst gumba",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "Ikonica strelice padajućeg izbornika može se prilagoditi koristeći prop <strong>caret-icon</strong>.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Prilagodljiva ikona strelice",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "Propom <strong>has-caret</strong> se određuje je li ikonica strelice prikazana ili skrivena.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Prilagodljiv prikaz ikonice strelice",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "Prop <strong>in-body</strong> kontrolira hoće li se sadržaj padajućeg izbornika generiati u tijelu ili neposredno nakon gumba padajućeg izbornika.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Pozicija sadržaja padajućeg izbornika",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "Niz okidača padajućeg izbornika moguće je moguće je definirati koristeći prop <strong>triggers</strong>.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Prilagodljivi okidači za padajući izbornik",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "Omogućuje prilagodbu klase gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_": "Omogućuju prikaz ikonice prije teksta gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_": "Omogućuju prikaz ikonice poslije teksta gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_": "Omogućuje kontrolu stanja učitavanja gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_": "Omogućuje prilagodbu pozicije stanja učitavanja unutar gumba.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "Omogućuje prilagodbu teksta gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "Omogućuje prilagodbu ikone strelice padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "Omogućuje postavljanje prikaza ikone strelice u komponenti padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "Omogućuje kontrolu nad time hoće li se sadržaj padajućeg izbornika renderirati u tijelu ili neposredno nakon gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "Omogućuje postavljanje okidača koji prikazuju padajući izbornik.",
  "_A_DROPDOWN_PROPS_ACTIONS_DESCRIPTION_": "Lista akcija između kojih je moguće izabrati",
  "_A_DROPDOWN_PROPS_BUTTON_ATTRIBUTES_DESCRIPTION_": "Dodatni atributi za prilagodbu gumba padajućeg izbornika. Atributi se proslijeđuju kao objekt koji sadrži nazive željenih atribua i njihove pripdajuće vrijednosti.",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_DESCRIPTION_": "Navodi dodatnu klasu za gumb padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_ATTRIBUTES_DESCRIPTION_": "Dodatni atributi za ikonu gumba padajućeg izbornika. Atributi se proslijeđuju kao objekt koji sadrži nazive željenih atribua i njihove pripdajuće vrijednosti.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_CLASS_DESCRIPTION_": "Navodi dodatnu klasu ikone gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_DESCRIPTION_": "Definira ikonu s lijeve strane gumba padajućeg izbornika. Naziv ikone se proslijeđuje kao niz ili se mogu definirati različite ikone za različite uređaje kao objekt.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_DESCRIPTION_": "Definira ikonu s desne strane gumba padajućeg izbornika. Naziv ikone se proslijeđuje kao niz ili se mogu definirati različite ikone za različite uređaje kao objekt.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_TAG_DESCRIPTION_": "Navodi prilagođenu HTML oznaku za ikonu gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_IS_TITLE_HTML_DESCRIPTION_" : "Određuje hoće li oblačić koji se prikazati kad se mišem prijeđe preko poveznice biti u običnom ili u HTML formatu.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_DESCRIPTION_": "Prikazuje indikator učitavanja gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_DESCRIPTION_": "CSS pozicioniranje indikatora učitavanja gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_CLASS_DESCRIPTION_": "CSS klasa indikatora učitavanja gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_PREVENT_DESCRIPTION_": "Određuje hoće li se standardno ponašanje funkcija za obradu događaja za gumb padajućeg izbornika spriječiti.",
  "_A_DROPDOWN_PROPS_BUTTON_STOP_DESCRIPTION_": "Navodi hoće li se daljnje propagiranje događaja za gumb padajućeg izbornika zaustaviti.",
  "_A_DROPDOWN_PROPS_BUTTON_TAG_DESCRIPTION_": "Navodi HTML oznaku koja će se koristiti za prikazivanje gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_DESCRIPTION_": "Niz ili objekt koji sadrži tekst gumba padajućeg izbornika za različite uređaje. Ključevi \"mobile\" i \"desktop\" koriste se za definiranje odgovarajućeg teksta za svaki uređaj.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Određuje hoće li tekst gumba padajućeg izbornika biti skriven od čitača zaslona.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_CLASS_DESCRIPTION_": "CSS klasa za tekst gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_SCREEN_READER_DESCRIPTION_": "Tekst gumba padajućeg izbornika za čitač zaslona.",
  "_A_DROPDOWN_PROPS_BUTTON_TITLE_DESCRIPTION_": "Jedna ili više dodatnih informacija koja će se prikazati kad se mišem prijeđe preko gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_BUTTON_TITLE_PLACEMENT_DESCRIPTION_": "Položaj u odnosu na gumb padajućeg izbornika u kojem će se prikazati oblačić. Funkcionira samo ako is-title-html ima vrijednost true.",
  "_A_DROPDOWN_PROPS_CARET_ICON_DESCRIPTION_": "Ikonica znaka za umetanje uz gumb padajućeg izbornika. Standardno je prikazana strelica prema dolje.",
  "_A_DROPDOWN_PROPS_CLASS_DESCRIPTION_": "Dodatna CSS klasa za padajući izbornika.",
  "_A_DROPDOWN_PROPS_DISABLED_DESCRIPTION_": "Indikator onemogućenog stanja.",
  "_A_DROPDOWN_PROPS_DROPDOWN_ATTRIBUTES_DESCRIPTION_": "Dodatni atributi padajućeg izbornika  koji nisu definirani kao props.",
  "_A_DROPDOWN_PROPS_DROPDOWN_CLASS_DESCRIPTION_": "Dodatna css klasa padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_DROPDOWN_RENDER_DEFAULT_DESCRIPTION_": "Određuje hoće li padajući izbornik početno biti otvoren. Predefinirana vrijednost je false.",
  "_A_DROPDOWN_PROPS_DROPDOWN_TAG_DESCRIPTION_": "Navodi HTML oznaku koja će se koristiti za elemente padajućeg izbornika. Predefinirana vrijednost je ul",
  "_A_DROPDOWN_PROPS_ELEMENTS_FOR_ARROWS_DESCRIPTION_": "Definira elemente po kojima se može kretati strelicama unutar padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_EXTRA_DESCRIPTION_": "Dodatne vrijednosti korištene za umetanje u prijevode.",
  "_A_DROPDOWN_PROPS_FLOATING_FLIP_DESCRIPTION_": "Konfiguracija za flip funkciju. Ona optimizira vidljivost padajućeg izbornika promjenom njegovog položaja po x osi kako bi se ipak zadržao u vidnom polju kad preferirani položaj izlazi iz granica.",
  "_A_DROPDOWN_PROPS_FLOATING_SHIFT_DESCRIPTION_": "Konfiguracija za shift funkciju. Ona optimizira vidiljivost padajućeg izbornika promjenom njegovog položaja po y osi kako bi se ipak zadržao u vidnom polju kad preferirani položaj izlazi iz granica.",
  "_A_DROPDOWN_PROPS_HAS_CARET_DESCRIPTION_": "Određuje nalazi li se uz gumb padajućeg izbornika ikona. Predefinirana vrijednost je true",
  "_A_DROPDOWN_PROPS_ID_DESCRIPTION_": "Određuje jedinstveni ID za HTML element koji odgovara padajućem izborniku.",
  "_A_DROPDOWN_PROPS_IN_BODY_DESCRIPTION_": "Određuje hoće li se sadržaj padajućeg izbornika generiati u tijelu ili neposredno nakon gumba padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_IS_CLOSE_BY_CLICK_INSIDE_DESCRIPTION_": "Određuje hoće li se komponenta zatvoriti kada korisnik klikne unutar nje.",
  "_A_DROPDOWN_PROPS_IS_CLOSE_BY_CLICK_OUTSIDE_DESCRIPTION_": "Određuje hoće li se komponenta zatvoriti kada korisnik klikne izvan nje.",
  "_A_DROPDOWN_PROPS_IS_HIDE_WITHOUT_ACTION_AND_SLOT_DESCRIPTION_": "Određuje hoće li padajući izbornik uopće postojati ako nema ni mogućih izbora ni definiranih slotova.",
  "_A_DROPDOWN_PROPS_IS_LIST_WIDTH_SAME_WITH_BUTTON_DESCRIPTION_": "Određuje je li gumb padajućeg izbornika iste širina kao i lista izbora.",
  "_A_DROPDOWN_PROPS_LOCK_ARROWS_NAVIGATION_DESCRIPTION_": "Određuje je li dozvoljena navigacija elemenata putem strelica na tastaturi unutar padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_LOCK_TAB_NAVIGATION_DESCRIPTION_": "Određuje je li dozvoljena navigacija elemenata putem tipke Tab unutar padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_PERSIST_DESCRIPTION_": "Određuje hoće li padajući izbornik ostati otvoren i nakon interakcije korisnika s drugim elementima, sve dok ga izričito ne zatvori.",
  "_A_DROPDOWN_PROPS_PLACEMENT_DESCRIPTION_": "Položaj na koji će se otvoriti padajući izbornik.",
  "_A_DROPDOWN_PROPS_POPPER_CONTAINER_ID_DESCRIPTION_": "ID kontejnerskog elementa u kojem su sadržani izbori padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_TRIGGERS_DESCRIPTION_": "Lsita događaja koji okidaju otvaranje ili zatvaranje padajućeg izbornika.",
  "_A_DROPDOWN_PROPS_USE_ESCAPE_DESCRIPTION_": "Određuje može li se tipka Esc koristiti za zatvaranje padajućeg izbornika."
}
