{
  "_A_DROPDOWN_COMPONENT_DESCRIPTION_": "Il componente ADropdown è un componente di menu a discesa per Vue.js che consente di visualizzare un elenco di azioni in un menu a discesa. Questa documentazione fornisce informazioni su come utilizzare il componente e descrive le proprietà disponibili.",
  "_A_DROPDOWN_COMPONENT_NAME_": "Menu a discesa",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_DESCRIPTION_": "La classe del pulsante del menu a discesa può essere personalizzata utilizzando la proprietà <strong>button-class</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_CLASS_HEADER_": "Classe del pulsante personalizzabile",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_DESCRIPTION_": "Le icone prima e dopo il testo del pulsante del menu a discesa possono essere personalizzate utilizzando le proprietà <strong>button-icon-left</strong> e <strong>button-icon-right</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_ICONS_HEADER_": "Icone del pulsante personalizzabili",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_DESCRIPTION_": "Lo stato di caricamento del pulsante del menu a discesa può essere personalizzato utilizzando le proprietà <strong>button-loading</strong> e <strong>button-loading-align</strong>.",
  "_A_DROPDOWN_GROUP_BUTTON_LOADING_HEADER_": "Stato di caricamento del pulsante del menu a discesa",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_DESCRIPTION_": "Questa documentazione descrive la proprietà <strong>button-text</strong>, che consente di personalizzare il testo del pulsante del menu a discesa.",
  "_A_DROPDOWN_GROUP_BUTTON_TEXT_HEADER_": "Testo del pulsante personalizzabile",
  "_A_DROPDOWN_GROUP_CARET_ICON_DESCRIPTION_": "L'icona caret del menu a discesa può essere personalizzata.",
  "_A_DROPDOWN_GROUP_CARET_ICON_HEADER_": "Icona caret personalizzabile",
  "_A_DROPDOWN_GROUP_HAS_CARET_DESCRIPTION_": "Il componente ADropdown per Vue.js consente di personalizzare la visualizzazione dell'icona caret. Questa documentazione descrive la proprietà <strong>has-caret</strong>, che controlla se l'icona caret deve essere visualizzata o meno.",
  "_A_DROPDOWN_GROUP_HAS_CARET_HEADER_": "Personalizzazione della visualizzazione dell'icona caret",
  "_A_DROPDOWN_GROUP_IN_BODY_DESCRIPTION_": "La proprietà <strong>inBody</strong> controlla se il contenuto del menu a discesa deve essere reso nel corpo o direttamente dopo il pulsante del menu a discesa.",
  "_A_DROPDOWN_GROUP_IN_BODY_HEADER_": "Contenuto del menu a discesa nel corpo o direttamente dopo il pulsante del menu a discesa",
  "_A_DROPDOWN_GROUP_TRIGGERS_DESCRIPTION_": "Il componente ADropdown per Vue.js offre la possibilità di personalizzare i trigger per il menu a discesa. Questa documentazione descrive la proprietà <strong>triggers</strong>, che definisce l'array di trigger.",
  "_A_DROPDOWN_GROUP_TRIGGERS_HEADER_": "Trigger del menu a discesa personalizzabili",
  "_A_DROPDOWN_PROPS_BUTTON_CLASS_": "Questa proprietà consente di personalizzare la classe del pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_LEFT_": "Queste proprietà consentono di visualizzare l'icona prima del testo del pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_BUTTON_ICON_RIGHT_": "Queste proprietà consentono di visualizzare l'icona dopo il testo del pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_": "Questa proprietà consente di controllare lo stato di caricamento del pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_BUTTON_LOADING_ALIGN_": "Questa proprietà consente di regolare la posizione dello stato di caricamento all'interno del pulsante.",
  "_A_DROPDOWN_PROPS_BUTTON_TEXT_": "Questa proprietà consente di personalizzare il testo del pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_CARET_ICON_": "Questa proprietà consente di personalizzare l'icona caret del menu a discesa.",
  "_A_DROPDOWN_PROPS_HAS_CARET_": "Questa proprietà consente di specificare se l'icona caret deve essere visualizzata nel componente del menu a discesa.",
  "_A_DROPDOWN_PROPS_IN_BODY_": "Questa proprietà consente di controllare se il contenuto del menu a discesa deve essere reso nel corpo o direttamente dopo il pulsante del menu a discesa.",
  "_A_DROPDOWN_PROPS_TRIGGERS_": "Questa proprietà consente di specificare i trigger che mostrano il menu a discesa."
}
