{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "El componente AProgress es una barra de progreso personalizable para aplicaciones Vue.js. Le permite representar visualmente el progreso de una tarea.",
  "_A_PROGRESS_COMPONENT_NAME_": "Barra de progreso",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con combinaciones de colores personalizables y adaptarlas al diseño de su aplicación Vue.js. Puede personalizar tanto el color de fondo de la barra de progreso como el color de la visualización del progreso.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Combinaciones de colores personalizables para barras de progreso",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso en varios colores y adaptarlas al diseño de su aplicación Vue.js. Con la flexibilidad de las props, puede personalizar los colores de fondo de las barras de progreso y visualizar el progreso de manera personalizada. Estos colores personalizables le ofrecen una fácil integración en sus proyectos y le permiten configurar la barra de progreso según las necesidades de la aplicación.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con una función que genera dinámicamente la clase de fondo basada en el valor del progreso. En lugar de una clase de fondo fija, puede vincular la prop <strong>class-progress-bar</strong> con una función que devuelva el valor de la clase deseada.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Barras de progreso dinámicamente personalizables con función para clases",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Colores personalizables para barras de progreso",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "El componente AProgress le permite controlar la duración de la animación para las barras de progreso. Utilizando la prop <strong>duration</strong>, puede establecer la velocidad de la animación, haciendo que la barra de progreso se anime más lentamente o más rápidamente. La duración se indica en segundos y afecta a la velocidad con la que se mueve la barra de progreso en la visualización rayada o indeterminada.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Control de la duración de la animación",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso indeterminadas con animación. Utilizando la prop <strong>indeterminate</strong>, puede crear una barra de progreso que no represente el progreso con un valor específico. En su lugar, se muestra un movimiento continuo y animado para indicar que hay un proceso en curso cuya duración o valor de progreso exacto no se conoce. Este tipo de barra de progreso es especialmente útil para situaciones en las que una tarea tarda más y no se puede cuantificar el progreso.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Barras de progreso indeterminadas con animación",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con límites dinámicos. Puede utilizar las props min y max para establecer los límites inferior y superior de la barra de progreso. Esto le proporciona la flexibilidad de configurar la barra de progreso para diferentes escenarios y mostrar el progreso en varias escalas.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Límites dinámicos",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con visualización invertida. Cuando la prop <strong>reverse</strong> se establece en true, la visualización del progreso se muestra de derecha a izquierda en lugar de izquierda a derecha.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "Visualización invertida",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con una visualización opcional del valor. Utilizando la prop <strong>showValue</strong>, puede controlar si el valor del progreso se muestra como texto dentro de la barra de progreso.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Visualización opcional del valor",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso en varios tamaños y adaptarlas al diseño de su aplicación Vue.js.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Tamaños personalizables para barras de progreso",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "El componente AProgress ofrece la posibilidad de personalizar el valor del progreso mostrado utilizando el slot <strong>progressText</strong>. Este slot le permite crear una visualización personalizada del valor de la barra de progreso que va más allá de la visualización predeterminada del valor.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "Visualización personalizada del valor del progreso con el slot <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso rayadas. Utilizando la prop <strong>striped</strong>, puede activar la rayadura de la barra de progreso, destacándola visualmente. La visualización rayada de la barra de progreso puede ayudar a centrar la atención en el progreso y proporcionar una mejor retroalimentación visual al usuario.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso rayadas con una visualización animada. Utilizando la prop <strong>striped-flow</strong>, puede activar una animación fluida para las barras de progreso rayadas. Esta animación añade un efecto visual dinámico a la barra de progreso y puede ayudar a representar el progreso de una manera atractiva.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Barras de progreso rayadas con animación",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Barras de progreso rayadas",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "El componente AProgress le permite actualizar las barras de progreso en tiempo real cambiando dinámicamente las props value. En conjunto con un campo de entrada del tipo \"integerNonNegative\", como se muestra en el ejemplo, los usuarios pueden controlar el progreso utilizando el componente a-input-number. Esto le permite ajustar dinámicamente la barra de progreso en función de las entradas del usuario u otros eventos y mostrar visualmente el progreso actual.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Barras de progreso actualizables dinámicamente",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "El componente AProgress le permite crear barras de progreso con diferentes formatos de texto para el valor del progreso. Cuando la prop valueTextInteger se establece en true, el valor del progreso se muestra como un porcentaje entero (por ejemplo, \"20 %\"). Cuando la prop valueTextInteger se establece en false o no se establece, el valor del progreso se muestra como un porcentaje con dos decimales (por ejemplo, \"20,00 %\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Visualización de valor diferente",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Esta prop le permite establecer una o más clases para la barra de progreso para personalizar su apariencia.",
  "_A_PROGRESS_PROPS_DURATION_": "Esta prop controla la duración de la animación para la barra de progreso.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Esta prop activa la visualización indeterminada de la barra de progreso. Cuando indeterminate se establece en true, la barra de progreso se anima y muestra un movimiento continuo e indeterminado.",
  "_A_PROGRESS_PROPS_MAX_": "El valor máximo de la barra de progreso",
  "_A_PROGRESS_PROPS_MIN_": "El valor mínimo de la barra de progreso",
  "_A_PROGRESS_PROPS_REVERSE_": "Esta prop indica si la visualización del progreso debe mostrarse de derecha a izquierda.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Esta prop indica si el valor del progreso debe mostrarse como texto dentro de la barra de progreso.",
  "_A_PROGRESS_PROPS_STRIPED_": "Esta prop activa la visualización rayada de la barra de progreso.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Esta prop activa la visualización animada para las barras de progreso rayadas.",
  "_A_PROGRESS_PROPS_VALUE_": "El progreso actual de la barra de progreso",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Esta prop indica qué formato de texto se debe utilizar para el valor del progreso. Cuando valueTextInteger se establece en true, el valor se muestra como un porcentaje entero. Cuando valueTextInteger se establece en false o no se establece, el valor se muestra como un porcentaje con dos decimales.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "Este slot le permite personalizar la visualización del valor de la barra de progreso. Puede acceder a la variable valuePercent en el scope del slot para mostrar el progreso actual en porcentaje."
}
