{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "Le composant AProgress est une barre de progression personnalisable pour les applications Vue.js. Il vous permet de représenter visuellement l'avancement d'un processus.",
  "_A_PROGRESS_COMPONENT_NAME_": "Barre de progression",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec des combinaisons de couleurs personnalisables et de les adapter au design de votre application Vue.js. Vous pouvez personnaliser à la fois la couleur de fond de la barre de progression et la couleur de l'indicateur de progression.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Combinaisons de couleurs personnalisables pour les barres de progression",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression dans différentes couleurs et de les adapter au design de votre application Vue.js. Avec la flexibilité des props, vous pouvez personnaliser les couleurs de fond des barres de progression et visualiser l'avancement de manière personnalisée. Ces couleurs personnalisables vous offrent une intégration facile dans vos projets et vous permettent de configurer la barre de progression selon les besoins de l'application.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec une fonction qui génère dynamiquement la classe de fond en fonction de la valeur de progression. Au lieu d'une classe de fond fixe, vous pouvez associer la prop <strong>class-progress-bar</strong> à une fonction qui renvoie la valeur de la classe souhaitée.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Barres de progression dynamiquement personnalisables avec fonction pour classes",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Couleurs personnalisables pour les barres de progression",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "Le composant AProgress vous permet de contrôler la durée de l'animation pour les barres de progression. En utilisant la prop <strong>duration</strong>, vous pouvez définir la vitesse de l'animation, ce qui fait que la barre de progression s'anime plus lentement ou plus rapidement. La durée est indiquée en secondes et affecte la vitesse à laquelle la barre de progression se déplace dans la visualisation rayée ou indéterminée.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Contrôle de la durée de l'animation",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression indéterminées avec animation. En utilisant la prop <strong>indeterminate</strong>, vous pouvez créer une barre de progression qui ne représente pas l'avancement avec une valeur spécifique. À la place, un mouvement continu et animé est affiché pour indiquer qu'un processus est en cours, dont la durée ou la valeur exacte n'est pas connue. Ce type de barre de progression est particulièrement utile pour les situations où un processus prend plus de temps et où l'avancement ne peut pas être quantifié.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Barres de progression indéterminées avec animation",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec des limites dynamiques. Vous pouvez utiliser les props min et max pour définir les limites inférieure et supérieure de la barre de progression. Cela vous offre la flexibilité de configurer la barre de progression pour différents scénarios et de montrer l'avancement à différentes échelles.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Limites dynamiques",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec une visualisation inversée. Lorsque la prop <strong>reverse</strong> est définie sur true, la visualisation de l'avancement est affichée de droite à gauche au lieu de gauche à droite.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "Visualisation inversée",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec une visualisation optionnelle de la valeur. En utilisant la prop <strong>showValue</strong>, vous pouvez contrôler si la valeur de l'avancement doit être affichée en tant que texte à l'intérieur de la barre de progression.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Visualisation optionnelle de la valeur",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression dans différentes tailles et de les adapter au design de votre application Vue.js.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Tailles personnalisables pour les barres de progression",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "Le composant AProgress offre la possibilité de personnaliser la valeur de l'avancement affichée en utilisant le slot <strong>progressText</strong>. Ce slot vous permet de créer une visualisation personnalisée de la valeur de la barre de progression qui dépasse la visualisation par défaut de la valeur.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "Visualisation personnalisée de la valeur de progression avec le slot <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression rayées. En utilisant la prop <strong>striped</strong>, vous pouvez activer le rayage de la barre de progression, la mettant en valeur visuellement. La visualisation rayée de la barre de progression peut aider à attirer l'attention sur l'avancement et à fournir un meilleur retour visuel à l'utilisateur.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression rayées avec une visualisation animée. En utilisant la prop <strong>striped-flow</strong>, vous pouvez activer une animation fluide pour les barres de progression rayées. Cette animation ajoute un effet visuel dynamique à la barre de progression et peut aider à représenter l'avancement de manière attrayante.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Barres de progression rayées avec animation",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Barres de progression rayées",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "Le composant AProgress vous permet de mettre à jour les barres de progression en temps réel en modifiant dynamiquement les props value. En conjonction avec un champ de saisie du type \"integerNonNegative\", comme montré dans l'exemple, les utilisateurs peuvent contrôler l'avancement en utilisant le composant a-input-number. Cela vous permet d'ajuster dynamiquement la barre de progression en fonction des entrées des utilisateurs ou d'autres événements et de montrer visuellement l'avancement actuel.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Barres de progression dynamiquement actualisables",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "Le composant AProgress vous permet de créer des barres de progression avec différents formats de texte pour la valeur de l'avancement. Lorsque la prop valueTextInteger est définie sur true, la valeur de l'avancement est affichée comme un pourcentage entier (par exemple, \"20 %\"). Lorsque la prop valueTextInteger est définie sur false ou n'est pas définie, la valeur de l'avancement est affichée comme un pourcentage avec deux décimales (par exemple, \"20,00 %\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Visualisation de valeur différente",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Cette prop vous permet de définir une ou plusieurs classes pour la barre de progression afin de personnaliser son apparence.",
  "_A_PROGRESS_PROPS_DURATION_": "Cette prop contrôle la durée de l'animation pour la barre de progression.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Cette prop active la visualisation indéterminée de la barre de progression. Lorsque indeterminate est défini sur true, la barre de progression est animée et montre un mouvement continu et indéterminé.",
  "_A_PROGRESS_PROPS_MAX_": "La valeur maximale de la barre de progression",
  "_A_PROGRESS_PROPS_MIN_": "La valeur minimale de la barre de progression",
  "_A_PROGRESS_PROPS_REVERSE_": "Cette prop indique si la visualisation de l'avancement doit être affichée de droite à gauche.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Cette prop indique si la valeur de l'avancement doit être affichée en tant que texte à l'intérieur de la barre de progression.",
  "_A_PROGRESS_PROPS_STRIPED_": "Cette prop active la visualisation rayée de la barre de progression.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Cette prop active la visualisation animée pour les barres de progression rayées.",
  "_A_PROGRESS_PROPS_VALUE_": "L'avancement actuel de la barre de progression",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Cette prop indique quel format de texte doit être utilisé pour la valeur de l'avancement. Lorsque valueTextInteger est défini sur true, la valeur est affichée comme un pourcentage entier. Lorsque valueTextInteger est défini sur false ou n'est pas défini, la valeur est affichée comme un pourcentage avec deux décimales.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "Ce slot vous permet de personnaliser la visualisation de la valeur de la barre de progression. Vous pouvez accéder à la variable valuePercent dans le scope du slot pour afficher l'avancement actuel en pourcentage."
}
