{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "Il componente AProgress è una barra di progresso personalizzabile per le applicazioni Vue.js. Consente di rappresentare visivamente il progresso di un'operazione.",
  "_A_PROGRESS_COMPONENT_NAME_": "Barra di progresso",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con combinazioni di colori personalizzabili e di adattarle al design della tua applicazione Vue.js. Puoi personalizzare sia il colore di sfondo della barra di progresso che il colore della visualizzazione del progresso.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Combinazioni di colori personalizzabili per barre di progresso",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso in diversi colori e di adattarle al design della tua applicazione Vue.js. Con la flessibilità delle props, puoi personalizzare i colori di sfondo delle barre di progresso e visualizzare il progresso in modo personalizzato. Questi colori personalizzabili offrono una facile integrazione nei tuoi progetti e consentono di configurare la barra di progresso in base alle esigenze dell'applicazione.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con una funzione che genera dinamicamente la classe di sfondo in base al valore del progresso. Invece di una classe di sfondo fissa, puoi associare la prop <strong>class-progress-bar</strong> a una funzione che restituisce il valore della classe desiderata.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Barre di progresso dinamicamente personalizzabili con funzione per classi",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Colori personalizzabili per barre di progresso",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "Il componente AProgress consente di controllare la durata dell'animazione per le barre di progresso. Utilizzando la prop <strong>duration</strong>, puoi impostare la velocità dell'animazione, facendo sì che la barra di progresso si animi più lentamente o più rapidamente. La durata è indicata in secondi e influisce sulla velocità con cui la barra di progresso si muove nella visualizzazione striata o indeterminata.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Controllo della durata dell'animazione",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso indeterminate con animazione. Utilizzando la prop <strong>indeterminate</strong>, puoi creare una barra di progresso che non rappresenta l'avanzamento con un valore specifico. Invece, viene mostrato un movimento continuo e animato per indicare che un processo è in corso, la cui durata o valore di avanzamento non è noto. Questo tipo di barra di progresso è particolarmente utile per situazioni in cui un'operazione richiede più tempo e non è possibile quantificare l'avanzamento.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Barre di progresso indeterminate con animazione",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con limiti dinamici. Puoi utilizzare le props min e max per impostare i limiti inferiore e superiore della barra di progresso. Ciò offre la flessibilità di configurare la barra di progresso per diversi scenari e mostrare l'avanzamento a diverse scale.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Limiti dinamici",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con visualizzazione inversa. Quando la prop <strong>reverse</strong> è impostata su true, la visualizzazione del progresso viene mostrata da destra a sinistra anziché da sinistra a destra.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "Visualizzazione inversa",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con una visualizzazione opzionale del valore. Utilizzando la prop <strong>showValue</strong>, puoi controllare se il valore del progresso deve essere mostrato come testo all'interno della barra di progresso.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Visualizzazione opzionale del valore",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso in diverse dimensioni e di adattarle al design della tua applicazione Vue.js.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Dimensioni personalizzabili per barre di progresso",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "Il componente AProgress offre la possibilità di personalizzare il valore del progresso mostrato utilizzando lo slot <strong>progressText</strong>. Questo slot consente di creare una visualizzazione personalizzata del valore della barra di progresso che va oltre la visualizzazione predefinita del valore.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "Visualizzazione personalizzata del valore di progresso con lo slot <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso striate. Utilizzando la prop <strong>striped</strong>, puoi attivare la striatura della barra di progresso, mettendola in risalto visivamente. La visualizzazione striata della barra di progresso può aiutare a concentrare l'attenzione sull'avanzamento e a fornire un miglior feedback visivo all'utente.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso striate con una visualizzazione animata. Utilizzando la prop <strong>striped-flow</strong>, puoi attivare un'animazione fluida per le barre di progresso striate. Questa animazione aggiunge un effetto visivo dinamico alla barra di progresso e può aiutare a rappresentare l'avanzamento in modo attraente.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Barre di progresso striate con animazione",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Barre di progresso striate",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "Il componente AProgress consente di aggiornare le barre di progresso in tempo reale modificando dinamicamente le props value. In combinazione con un campo di input del tipo \"integerNonNegative\", come mostrato nell'esempio, gli utenti possono controllare l'avanzamento utilizzando il componente a-input-number. Ciò consente di regolare dinamicamente la barra di progresso in base agli input degli utenti o ad altri eventi e di mostrare visivamente l'avanzamento attuale.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Barre di progresso aggiornabili dinamicamente",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "Il componente AProgress consente di creare barre di progresso con diversi formati di testo per il valore del progresso. Quando la prop valueTextInteger è impostata su true, il valore del progresso viene mostrato come una percentuale intera (ad esempio, \"20 %\"). Quando la prop valueTextInteger è impostata su false o non è impostata, il valore del progresso viene mostrato come una percentuale con due decimali (ad esempio, \"20,00 %\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Visualizzazione del valore differente",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Questa prop consente di definire una o più classi per la barra di progresso per personalizzarne l'aspetto.",
  "_A_PROGRESS_PROPS_DURATION_": "Questa prop controlla la durata dell'animazione per la barra di progresso.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Questa prop attiva la visualizzazione indeterminata della barra di progresso. Quando indeterminate è impostato su true, la barra di progresso è animata e mostra un movimento continuo e indeterminato.",
  "_A_PROGRESS_PROPS_MAX_": "Il valore massimo della barra di progresso",
  "_A_PROGRESS_PROPS_MIN_": "Il valore minimo della barra di progresso",
  "_A_PROGRESS_PROPS_REVERSE_": "Questa prop indica se la visualizzazione del progresso deve essere mostrata da destra a sinistra.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Questa prop indica se il valore del progresso deve essere mostrato come testo all'interno della barra di progresso.",
  "_A_PROGRESS_PROPS_STRIPED_": "Questa prop attiva la visualizzazione striata della barra di progresso.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Questa prop attiva la visualizzazione animata per le barre di progresso striate.",
  "_A_PROGRESS_PROPS_VALUE_": "L'avanzamento attuale della barra di progresso",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Questa prop indica quale formato di testo deve essere utilizzato per il valore del progresso. Quando valueTextInteger è impostato su true, il valore viene mostrato come una percentuale intera. Quando valueTextInteger è impostato su false o non è impostato, il valore viene mostrato come una percentuale con due decimali.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "Questo slot consente di personalizzare la visualizzazione del valore della barra di progresso. È possibile accedere alla variabile valuePercent nell'ambito dello slot per visualizzare l'avanzamento attuale in percentuale."
}
