{
  "_A_PROGRESS_COMPONENT_DESCRIPTION_": "Компонент AProgress — это настраиваемый прогресс бар для приложений Vue.js. Он позволяет визуально отображать прогресс выполнения процесса.",
  "_A_PROGRESS_COMPONENT_NAME_": "Прогресс бар",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с настраиваемыми цветовыми комбинациями и адаптировать их к дизайну вашего приложения Vue.js. Вы можете индивидуально настроить как цвет фона прогресс бара, так и цвет отображения прогресса.",
  "_A_PROGRESS_GROUP_CLASS_COMBINATION_HEADER_": "Настраиваемые цветовые комбинации для прогресс баров",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары различных цветов и адаптировать их к дизайну вашего приложения Vue.js. С гибкостью пропсов вы можете индивидуально настроить цвета фона прогресс баров и визуально отображать прогресс. Эти настраиваемые цвета обеспечивают легкую интеграцию в ваши проекты и позволяют настроить прогресс бар в соответствии с потребностями приложения.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с функцией, которая динамически генерирует класс фона на основе значения прогресса. Вместо фиксированного класса фона вы можете связать пропс <strong>class-progress-bar</strong> с функцией, возвращающей необходимое значение класса.",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_FUNCTION_HEADER_": "Динамически настраиваемые прогресс бары с функцией для классов",
  "_A_PROGRESS_GROUP_CLASS_PROGRESS_BAR_HEADER_": "Настраиваемые цвета для прогресс баров",
  "_A_PROGRESS_GROUP_DURATION_DESCRIPTION_": "Компонент AProgress позволяет контролировать продолжительность анимации для прогресс баров. С помощью пропса <strong>duration</strong> вы можете задать скорость анимации, что позволяет прогресс бару двигаться медленнее или быстрее. Продолжительность указывается в секундах и влияет на скорость, с которой прогресс бар перемещается при полосатом или неопределенном отображении.",
  "_A_PROGRESS_GROUP_DURATION_HEADER_": "Контроль продолжительности анимации",
  "_A_PROGRESS_GROUP_INDETERMINATE_DESCRIPTION_": "Компонент AProgress позволяет создавать неопределенные прогресс бары с анимацией. Используя пропс <strong>indeterminate</strong>, вы можете создать прогресс бар, который не представляет прогресс с конкретным значением. Вместо этого отображается непрерывное анимированное движение, указывающее на то, что процесс продолжается, и его точная продолжительность или значение прогресса неизвестны. Этот тип прогресс бара особенно подходит для ситуаций, когда процесс занимает больше времени и прогресс невозможно количественно оценить.",
  "_A_PROGRESS_GROUP_INDETERMINATE_HEADER_": "Неопределенные прогресс бары с анимацией",
  "_A_PROGRESS_GROUP_MIN_MAX_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с динамическими пределами. Вы можете использовать пропсы min и max, чтобы установить нижний и верхний пределы прогресс бара. Это обеспечивает гибкость настройки прогресс бара для различных сценариев и отображения прогресса в разных масштабах.",
  "_A_PROGRESS_GROUP_MIN_MAX_HEADER_": "Динамические пределы",
  "_A_PROGRESS_GROUP_REVERSE_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с обратным отображением. Если пропс <strong>reverse</strong> установлен в true, отображение прогресса будет показываться справа налево, а не слева направо.",
  "_A_PROGRESS_GROUP_REVERSE_HEADER_": "Обратное отображение",
  "_A_PROGRESS_GROUP_SHOW_VALUE_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с опциональным отображением значения. С помощью пропса <strong>showValue</strong> вы можете контролировать, будет ли значение прогресса отображаться в виде текста внутри прогресс бара.",
  "_A_PROGRESS_GROUP_SHOW_VALUE_HEADER_": "Опциональное отображение значения",
  "_A_PROGRESS_GROUP_SIZES_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары различных размеров и адаптировать их к дизайну вашего приложения Vue.js.",
  "_A_PROGRESS_GROUP_SIZES_HEADER_": "Настраиваемые размеры для прогресс баров",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_DESCRIPTION_": "Компонент AProgress предлагает возможность настроить отображаемое значение прогресса с использованием слота <strong>progressText</strong>. Этот слот позволяет создать пользовательское отображение значения прогресс бара, которое выходит за рамки стандартного отображения значения.",
  "_A_PROGRESS_GROUP_SLOT_PROGRESS_TEXT_HEADER_": "Пользовательское отображение значения прогресса с использованием слота <strong>progressText</strong>",
  "_A_PROGRESS_GROUP_STRIPED_DESCRIPTION_": "Компонент AProgress позволяет создавать полосатые прогресс бары. С помощью пропса <strong>striped</strong> вы можете активировать полосатость прогресс бара, что визуально выделяет его. Полосатое отображение прогресс бара может помочь сосредоточить внимание на прогрессе и предоставить пользователю лучшее визуальное восприятие.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_DESCRIPTION_": "Компонент AProgress позволяет создавать полосатые прогресс бары с анимированным отображением. С помощью пропса <strong>striped-flow</strong> вы можете активировать плавную анимацию для полосатых прогресс баров. Эта анимация добавляет динамический визуальный эффект прогресс бару и может помочь представить прогресс привлекательным образом.",
  "_A_PROGRESS_GROUP_STRIPED_FLOW_HEADER_": "Полосатые прогресс бары с анимацией",
  "_A_PROGRESS_GROUP_STRIPED_HEADER_": "Полосатые прогресс бары",
  "_A_PROGRESS_GROUP_VALUE_DESCRIPTION_": "Компонент AProgress позволяет обновлять прогресс бары в реальном времени, динамически изменяя пропсы value. В сочетании с полем ввода типа \"integerNonNegative\", как показано в примере, пользователи могут контролировать прогресс с помощью компонента a-input-number. Это позволяет динамически настраивать прогресс бар в зависимости от ввода пользователя или других событий и визуально отображать текущий прогресс.",
  "_A_PROGRESS_GROUP_VALUE_HEADER_": "Динамически обновляемые прогресс бары",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_DESCRIPTION_": "Компонент AProgress позволяет создавать прогресс бары с различными текстовыми форматами для значения прогресса. Если пропс valueTextInteger установлен в true, значение прогресса отображается в виде целого процента (например, \"20 %\"). Если пропс valueTextInteger установлен в false или не установлен, значение прогресса отображается в виде процента с двумя десятичными знаками (например, \"20,00 %\").",
  "_A_PROGRESS_GROUP_VALUE_TEXT_INTEGER_HEADER_": "Различное отображение значения",
  "_A_PROGRESS_PROPS_CLASS_PROGRESS_BAR_": "Этот пропс позволяет задать один или несколько классов для прогресс бара, чтобы настроить его внешний вид.",
  "_A_PROGRESS_PROPS_DURATION_": "Этот пропс контролирует продолжительность анимации для прогресс бара.",
  "_A_PROGRESS_PROPS_INDETERMINATE_": "Этот пропс активирует неопределенное отображение прогресс бара. Если indeterminate установлен в true, прогресс бар анимируется и показывает непрерывное неопределенное движение.",
  "_A_PROGRESS_PROPS_MAX_": "Максимальное значение прогресс бара",
  "_A_PROGRESS_PROPS_MIN_": "Минимальное значение прогресс бара",
  "_A_PROGRESS_PROPS_REVERSE_": "Этот пропс указывает, должно ли отображение прогресса показываться справа налево.",
  "_A_PROGRESS_PROPS_SHOW_VALUE_": "Этот пропс указывает, должно ли значение прогресса отображаться в виде текста внутри прогресс бара.",
  "_A_PROGRESS_PROPS_STRIPED_": "Этот пропс активирует полосатое отображение прогресс бара.",
  "_A_PROGRESS_PROPS_STRIPED_FLOW_": "Этот пропс активирует анимированное отображение для полосатых прогресс баров.",
  "_A_PROGRESS_PROPS_VALUE_": "Текущий прогресс прогресс бара",
  "_A_PROGRESS_PROPS_VALUE_TEXT_INTEGER_": "Этот пропс указывает, какой текстовый формат должен использоваться для значения прогресса. Если valueTextInteger установлен в true, значение отображается в виде целого процента. Если valueTextInteger установлен в false или не установлен, значение отображается в виде процента с двумя десятичными знаками.",
  "_A_PROGRESS_SLOT_PROGRESS_TEXT_": "Этот слот позволяет настроить отображение значения прогресс бара. Вы можете получить доступ к переменной valuePercent в области видимости слота, чтобы отобразить текущий процентный прогресс."
}