{
  "_A_INPUT_COMPONENT_DESCRIPTION_": "Komponenta <strong lang=\"en\">AInput</strong> pruža funkcionalnost unosa podataka s podrškom za različite vrste podataka kao što su <strong lang=\"en\">text</strong>, <strong lang=\"en\">password</strong>, <strong lang=\"en\">number</strong>, <strong lang=\"en\">email</strong> i druge. Komponenta podržava prikaz ikona, gumb za brisanje te mogućnost prikazivanja/sakrivanja lozinke.",
  "_A_INPUT_COMPONENT_NAME_": "Tekstualno Polje",
  "_A_INPUT_GROUP_PASSWORD_DESCRIPTION_": "Ovaj primjer pokazuje kako koristiti polje za unos s tipom <strong lang=\"en\">password</strong> i mogućnost prebacivanja vidljivosti lozinke pomoću <strong lang=\"en\">show-password</strong>. U prvom polju korisnik može mijenjati između prikazivanja i sakrivanja lozinke, dok je u drugom polju ta funkcija onemogućena.",
  "_A_INPUT_GROUP_PASSWORD_HEADER_": "Polje za Unos Lozinke",
  "_A_INPUT_GROUP_READONLY_DESCRIPTION_": "Ovaj primjer prikazuje ulazna polja s aktiviranim <strong lang=\"en\">readonly</strong> načinom, gdje je vrijednost samo za čitanje i korisnik je ne može mijenjati.",
  "_A_INPUT_GROUP_READONLY_HEADER_": "<strong lang=\"en\">Readonly</strong> ulazna polja",
  "_A_INPUT_GROUP_READONLY_PASSWORD_DESCRIPTION_": "Primjer prikaza <strong lang=\"en\">password</strong> polja u <strong lang=\"en\">readonly</strong> načinu rada. Vrijednost lozinke skriva se pomoću zadanog simbola, broj simbola kontrolira se putem <strong lang=\"en\">readonly-password-length</strong>, a sam simbol putem <strong lang=\"en\">readonly-password-symbol</strong>. U posljednjem polju prikazana je varijanta u kojoj je omogućeno <strong lang=\"en\">show-password</strong> i vrijednost je potpuno vidljiva.",
  "_A_INPUT_GROUP_READONLY_PASSWORD_HEADER_": "<strong lang=\"en\">Readonly</strong> polja za lozinku",
  "_A_INPUT_PROPS_ICON_PREPEND_DESCRIPTION_": "Određuje ikonu koja će se prikazati prije polja za unos. Ova ikona može se koristiti za poboljšanje vizualne percepcije ili za označavanje vrste unesnih podataka.",
  "_A_INPUT_PROPS_READONLY_PASSWORD_LENGTH_DESCRIPTION_": "Broj znakova prikazanih u načinu samo za čitanje za polje lozinke. Ne ovisi o stvarnoj duljini vrijednosti.",
  "_A_INPUT_PROPS_READONLY_PASSWORD_SYMBOL_DESCRIPTION_": "Simbol koji se koristi za maskiranje vrijednosti polja lozinke u načinu samo za čitanje.",
  "_A_INPUT_PROPS_SHOW_PASSWORD_DESCRIPTION_": "Radi kada je tip unosa <strong lang=\"en\">password</strong>. Omogućuje prebacivanje vidljivosti unesene lozinke, dajući korisniku mogućnost da vidi unos lozinke.",
  "_A_INPUT_PROPS_STEP_DESCRIPTION_": "Koristi se za tipove <strong lang=\"en\">number</strong> ili <strong lang=\"en\">integer</strong>. Određuje korak za promjenu vrijednosti, na primjer, pri povećanju ili smanjenju broja pomoću strelica na tipkovnici.",
  "_A_INPUT_PROPS_TYPE_DESCRIPTION_": "Definira vrstu unosa. Podržane su različite vrste podataka kao što su <strong lang=\"en\">text</strong>, <strong lang=\"en\">password</strong>, <strong lang=\"en\">number</strong>, <strong lang=\"en\">integer</strong>, <strong lang=\"en\">email</strong> i druge."
}