{
  "_A_INPUT_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">AInput</strong> fornisce funzionalità di input dati con supporto per vari tipi di dati come <strong lang=\"en\">text</strong>, <strong lang=\"en\">password</strong>, <strong lang=\"en\">number</strong>, <strong lang=\"en\">email</strong> e altri. Il componente supporta la visualizzazione di icone, un pulsante di cancellazione e la possibilità di mostrare/nascondere la password.",
  "_A_INPUT_COMPONENT_NAME_": "Campo di Testo",
  "_A_INPUT_GROUP_PASSWORD_DESCRIPTION_": "Questo esempio mostra come utilizzare un campo di input con il tipo <strong lang=\"en\">password</strong> e la possibilità di alternare la visibilità della password utilizzando <strong lang=\"en\">show-password</strong>. Nel primo campo, l'utente può alternare tra la visualizzazione e la mascheratura della password, mentre nel secondo campo questa funzione è disabilitata.",
  "_A_INPUT_GROUP_PASSWORD_HEADER_": "Campo di Input della Password",
  "_A_INPUT_PROPS_ICON_PREPEND_DESCRIPTION_": "Specifica l'icona che verrà visualizzata prima del campo di input. Questa icona può essere utilizzata per migliorare la percezione visiva o indicare il tipo di dati in input.",
  "_A_INPUT_PROPS_SHOW_PASSWORD_DESCRIPTION_": "Funziona quando il tipo di input è <strong lang=\"en\">password</strong>. Consente di alternare la visibilità della password inserita, offrendo all'utente la possibilità di vedere la password durante la digitazione.",
  "_A_INPUT_PROPS_STEP_DESCRIPTION_": "Utilizzato per i tipi <strong lang=\"en\">number</strong> o <strong lang=\"en\">integer</strong>. Specifica il passo per modificare il valore, ad esempio durante l'aumento o la diminuzione del numero utilizzando le frecce della tastiera.",
  "_A_INPUT_PROPS_TYPE_DESCRIPTION_": "Definisce il tipo di valore di input. Sono supportati vari tipi di dati, come <strong lang=\"en\">text</strong>, <strong lang=\"en\">password</strong>, <strong lang=\"en\">number</strong>, <strong lang=\"en\">integer</strong>, <strong lang=\"en\">email</strong> e altri."
}