{
  "_A_LINK_COMPONENT_DESCRIPTION_": "مكون ALink هو مكون قوي لـ Vue.js يوفر أنماطًا ووظائف مخصصة للروابط. يقدم طريقة بسيطة ومرنة لإنشاء وتخصيص الروابط في تطبيق Vue.js الخاص بك.",
  "_A_LINK_COMPONENT_NAME_": "رابط",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>هذا هو <strong>تلميح HTML الخاص بي!!!!</strong></div><div>السطر الثاني</div><div>السطر الثالث</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "مكون ALink هو مكون Vue.js يوفر أنماطًا مخصصة للروابط. مع هذا المكون، يمكنك استخدام فئات محددة مسبقًا لتخصيص نمط الرابط بناءً على التصميم المطلوب. تتيح لك هذه المرونة دمج الروابط بسلاسة في مشروع Vue.js الخاص بك والحفاظ على جمالية بصرية متسقة.",
  "_A_LINK_GROUP_CLASS_HEADER_": "روابط بأنماط مخصصة",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "يسمح لك مكون ALink باستخدام العديد من الخصائص المعقدة لتخصيص الرابط والتحكم فيه بوظائف متقدمة. في المثال التالي، يتم استخدام عدة خصائص لتكوين الرابط والتحكم في التحميل.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "استخدام الخصائص المعقدة",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "مع الخاصية الجديدة <strong>disabled</strong> يمكنك تعطيل الروابط بحيث لا يمكن النقر عليها. عند تعطيل الرابط، يتم عرضه بدون خاصية href. بالإضافة إلى ذلك، يتم تمييز الرابط المعطل بالفئة <strong>disabled</strong>.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "روابط معطلة",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "يتيح ALink تجميع الروابط لعرض جذاب.",
  "_A_LINK_GROUP_GROUP_HEADER_": "التجميع",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "يمكن أيضًا تجميع الروابط في هيكل يشبه الجدول.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "التجميع في شكل جدولي",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "مع هذا المكون، يمكنك تنظيم الروابط في مجموعات وتخصيص حجم المجموعات لتحقيق عرض أمثل.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "تخصيص أحجام مجموعات الروابط",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "يسمح المكون أيضًا بتجميع الروابط بشكل <strong>عمودي</strong> لعرض جذاب.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "التجميع العمودي",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "يتيح لك مكون ALink عرض محتوى HTML بأمان دون الاعتماد عليه بالكامل. باستخدام الخاصية \"html\" ومكتبة DomPurify، يتم تنظيف محتوى HTML المرسل وعرضه بأمان في الرابط.",
  "_A_LINK_GROUP_HTML_HEADER_": "عرض محتوى HTML بأمان باستخدام DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "مع الخصائص <strong>icon-left</strong> و <strong>icon-right</strong> يمكنك الآن عرض الأيقونات في الروابط لتخصيص العرض البصري أكثر.",
  "_A_LINK_GROUP_ICONS_HEADER_": "الأيقونات",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "مع الخصائص <strong>loading</strong> و <strong>loading-align</strong> يمكنك عرض دوامة التحميل في مواضع مختلفة داخل الرابط لإظهار أن الرابط قيد التحميل.",
  "_A_LINK_GROUP_LOADING_HEADER_": "عرض دوامة التحميل في مواضع مختلفة",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "يوفر هذا المكون أيضًا إمكانية عرض الروابط بتخطيط محدد للحصول على تأثير بصري مميز.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "خيارات التخطيط",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "يتيح لك مكون ALink استخدام محتوى HTML آمن كعنصر نصي في الرابط. من خلال تفعيل الخاصية \"safe-html\" وإرسال سلسلة HTML، يتم التعامل مع محتوى HTML المرسل بشكل آمن وإدراجه مباشرة عبر خاصية JavaScript \"innerHTML\".",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "استخدام محتوى HTML آمن كسلسلة نصية في الرابط",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "يتيح لك المكون تصميم الروابط بفئات محددة مسبقًا ويوفر خيارات حجم لتلبية متطلبات تصميمك الفردية.",
  "_A_LINK_GROUP_SIZES_HEADER_": "خيارات الحجم",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "يتيح لك مكون ALink عرض محتوى إضافي بعد النص في الرابط باستخدام الفتحة \"linkAppend\". يتم عرض المحتوى الذي يتم وضعه في الفتحة بعد النص في الرابط.",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "استخدام الفتحة \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "يتيح لك مكون ALink وضع محتوى مخصص داخل الرابط باستخدام الفتحة الافتراضية \"default\". يتم عرض المحتوى الذي يتم وضعه في الفتحة داخل الرابط.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "استخدام الفتحة الافتراضية",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "يتيح لك مكون ALink عرض محتوى إضافي قبل النص في الرابط باستخدام الفتحة \"linkPrepend\". يتم عرض المحتوى الذي يتم وضعه في الفتحة قبل النص في الرابط.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "استخدام الفتحة \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "يتيح لك مكون ALink تحديد محتوى HTML مخصص لعنوان الرابط باستخدام الفتحة \"linkTitle\" مع الخاصية \":is-title-html\". يتم استخدام المحتوى الذي يتم وضعه في الفتحة كعنوان HTML للرابط.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "استخدام الفتحة \"linkTitle\" للعناوين HTML",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "مع الخصائص <strong>text-before</strong> و <strong>text-after</strong> يمكنك عرض نص إضافي داخل الرابط.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "عرض نص إضافي قبل وبعد النص داخل الرابط",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "يتيح لك مكون ALink تخصيص نص الرابط للأجهزة المختلفة. باستخدام الخاصية \":text\" ككائن، يمكنك تحديد نص مختلف للأجهزة المحمولة وأجهزة الكمبيوتر المكتبية.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "نص قابل للتخصيص للأجهزة المختلفة",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "في هذا المثال، يتم عرض كيفية تخصيص وسم النص في مكون \"ALink\" في Vue.js. بشكل افتراضي، يتم عرض النص داخل وسم \"span\". باستخدام الخاصية \"text-tag\"، يمكن تخصيص وسم النص بشكل مرن لاستخدام وسوم HTML مختلفة مثل \"strong\" أو \"em\" أو غيرها.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "تخصيص وسم النص في مكون \"ALink\"",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "يتيح لك مكون ALink دمج عدة عناوين في خاصية واحدة. باستخدام الخاصية \":title\" كصفيف، يمكنك تحديد عدة عناصر يتم دمجها في عنوان واحد للرابط.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "دمج العناوين في خاصية واحدة",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "يتيح لك مكون ALink عرض العنوان كـ HTML والتحكم في موضع العنوان. باستخدام الخصائص \":is-title-html\" و \":title\" و \":title-placement\"، يمكنك استخدام عناوين HTML وتحديد موضع العنوان.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "عرض عناوين HTML والتحكم في موضعها",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "يمكن استخدام الفئات المحددة مسبقًا للشفافية لدمج الروابط في الخلفية.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "خيارات الشفافية",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "يحدد خصائص إضافية للرابط. يمكنك استخدام كائن لتحديد الخصائص المطلوبة وقيمها.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "يحدد الفئة الأساسية لـ CSS للعنصر، مما يحدد نمطًا مرئيًا عامًا افتراضيًا.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "يحدد فئة CSS لإخفاء العنصر، ويستخدم للتحكم في رؤية العنصر في سياقات مختلفة.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "تتيح لك هذه الخاصية تحديد الفئات المخصصة لأنماط الرابط.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "يحدد فئة CSS التي تطبق على الرابط عندما يكون معطلاً.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "تتيح لك هذه الخاصية تعطيل الرابط. عند تعيين disabled إلى true، يتم عرض الرابط بدون خاصية href ويتم إضافة الفئة الإضافية 'disabled'.",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "كائن إضافي للترجمة",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "خاصية href للرابط",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "محتوى HTML الآمن الذي سيتم عرضه في الزر",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "يحدد HTML لمحتوى الرابط المخصص للسكين ريدر. يمكنك استخدام سلسلة نصية أو رقم أو كائن لتحديد محتوى HTML المطلوب.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "يحدد خصائص إضافية للأيقونات. يمكنك استخدام كائن لتحديد الخصائص المطلوبة وقيمها للأيقونات.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "يحدد فئة CSS إضافية للأيقونات.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "أيقونة على الجانب الأيسر من الرابط",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "أيقونة على الجانب الأيمن من الرابط",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "يحدد وسم HTML المخصص للأيقونات.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "يحدد معرفًا فريدًا للرابط. إذا لم يتم تحديد معرف، يتم إنشاء معرف فريد تلقائيًا.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "يحدد ما إذا كان يجب تفسير العنوان كـ HTML. عند تعيين القيمة إلى true، يتم عرض العنوان كـ HTML.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "تتيح لك هذه الخاصية تحديد موضع دوامة التحميل داخل الرابط. يمكنك استخدام \"right\" (اليمين) أو \"left\" (اليسار) كقيمة.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "تتيح لك هذه الخاصية تحديد فئة CSS لدوامة التحميل.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "تتيح لك هذه الخاصية تحديد ما إذا كان الرابط قيد التحميل حاليًا. عند تعيين loading إلى true، يتم عرض دوامة التحميل داخل الرابط.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "إذا تم تمرير هذا الخاصية، سيتم عرض محتواها كـ HTML بدون تحويل.",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "يحدد المحتوى الآمن لـ HTML لمنطقة السكين ريدر. يمكنك استخدام سلسلة نصية أو رقم أو كائن لتحديد محتويات مختلفة لحالات مختلفة.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "خاصية target للرابط",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "تتيح لك هذه الخاصية عرض نص إضافي بعد النص الرئيسي للرابط داخل الرابط.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "يحدد ما إذا كان يجب تعيين نص الرابط كـ aria-hidden=\"true\".",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "تتيح لك هذه الخاصية عرض نص إضافي قبل النص الرئيسي للرابط داخل الرابط.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "يحدد فئة CSS التي سيتم تطبيقها على نص الرابط.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "سلسلة نصية أو كائن يحتوي على النص للأجهزة المختلفة. استخدم المفاتيح \"mobile\" و \"desktop\" لتحديد النص المناسب لكل جهاز.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "يحدد النص الذي سيتم استخدامه للسكين ريدر.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "تتيح هذه الخاصية تخصيص وسم HTML الذي يتم داخله عرض النص داخل الرابط.",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "يوفر كائنًا لتحديد خصائص HTML إضافية لعنوان العنصر، مما يتيح تخصيصًا دقيقًا لسلوكه وأسلوبه.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "سلسلة نصية أو كائن أو مجموعة من العناصر التي يتم دمجها في عنوان واحد.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "موضع العنوان HTML",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "تحدد \"z-index\" لعنوان العنصر، وتحدد ترتيبه في التراص في سياق العناصر المتداخلة الأخرى.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "خاصية to لـ RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "الفتحة الافتراضية التي تحتوي على المحتوى للرابط.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "الفتحة التي تحتوي على المحتوى الذي يتم عرضه بعد النص في الرابط.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "الفتحة التي تحتوي على المحتوى الذي يتم عرضه قبل النص في الرابط.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "الفتحة التي تحتوي على محتوى HTML المستخدم كعنوان للرابط."
}