{
  "_A_LINK_COMPONENT_DESCRIPTION_": "El componente ALink es un potente componente de Vue.js que proporciona estilos y funciones personalizadas para los enlaces. Ofrece una manera sencilla y flexible de crear y personalizar enlaces en su aplicación Vue.js.",
  "_A_LINK_COMPONENT_NAME_": "Enlace",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>¡ESTE ES MI <strong>TOOLTIP HTML!!!!</strong></div><div>Segunda línea</div><div>Tercera línea</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "El componente ALink es un componente de Vue.js que proporciona estilos personalizados para los enlaces. Con este componente, puede utilizar varias clases predefinidas para personalizar el estilo del enlace según el diseño deseado. Esta flexibilidad le permite integrar enlaces sin problemas en su proyecto Vue.js y mantener una estética visual coherente.",
  "_A_LINK_GROUP_CLASS_HEADER_": "Enlaces con estilos personalizados",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "El componente ALink le permite utilizar varias propiedades complejas para personalizar y controlar el enlace con funciones avanzadas. En el siguiente ejemplo, se utilizan varias propiedades para configurar el enlace y controlar la carga.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "Uso de propiedades complejas",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "Con la nueva propiedad <strong>disabled</strong> puede desactivar los enlaces para que no se puedan hacer clic en ellos. Cuando el enlace está desactivado, se renderiza sin el atributo href. Además, el enlace desactivado se marca con la clase <strong>disabled</strong>.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "Enlaces desactivados",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "ALink permite agrupar enlaces para una presentación atractiva.",
  "_A_LINK_GROUP_GROUP_HEADER_": "Agrupación",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Los enlaces también se pueden agrupar en una estructura similar a una tabla.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Agrupación en forma de tabla",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "Con este componente, puede organizar los enlaces en grupos y ajustar el tamaño de los grupos para una presentación óptima.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "Ajuste de tamaños de grupos de enlaces",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "El componente también permite la agrupación <strong>vertical</strong> de enlaces para una presentación atractiva.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "Agrupación vertical",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "El componente ALink le permite mostrar contenido HTML de forma segura sin confiar completamente en él. Al utilizar la propiedad \"html\" y la biblioteca DomPurify, el contenido HTML proporcionado se limpia y se muestra de forma segura en el enlace.",
  "_A_LINK_GROUP_HTML_HEADER_": "Mostrar contenido HTML de forma segura con DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "Con las propiedades <strong>icon-left</strong> y <strong>icon-right</strong> ahora puede mostrar iconos en los enlaces para personalizar aún más la presentación visual.",
  "_A_LINK_GROUP_ICONS_HEADER_": "Iconos",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "Con las propiedades <strong>loading</strong> y <strong>loading-align</strong> puede mostrar un spinner en diferentes posiciones dentro del enlace para indicar que el enlace se está cargando.",
  "_A_LINK_GROUP_LOADING_HEADER_": "Mostrar un spinner en diferentes posiciones",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "Este componente también ofrece la posibilidad de mostrar enlaces con un contorno para crear un efecto visual especial.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "Opciones de contorno",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "El componente ALink le permite utilizar contenido HTML seguro como cadena en el enlace. Al activar la propiedad \"safe-html\" y proporcionar una cadena HTML, el contenido HTML proporcionado se trata de forma segura y se inserta directamente a través del atributo JavaScript \"innerHTML\".",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "Usar contenido HTML seguro como cadena en el enlace",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "El componente le permite diseñar enlaces con clases predefinidas y ofrece opciones de tamaño para satisfacer sus requisitos de diseño individuales.",
  "_A_LINK_GROUP_SIZES_HEADER_": "Opciones de tamaño",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "El componente ALink le permite mostrar contenido adicional después del texto en el enlace utilizando el slot \"linkAppend\". El contenido colocado en el slot se mostrará después del texto en el enlace.",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "Uso del slot \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "El componente ALink le permite colocar contenido personalizado dentro del enlace utilizando el slot predeterminado \"default\". El contenido colocado en el slot se mostrará dentro del enlace.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "Uso del slot predeterminado",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "El componente ALink le permite mostrar contenido adicional antes del texto en el enlace utilizando el slot \"linkPrepend\". El contenido colocado en el slot se mostrará antes del texto en el enlace.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "Uso del slot \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "El componente ALink le permite definir contenido HTML personalizado para el título del enlace utilizando el slot \"linkTitle\" junto con la propiedad \":is-title-html\". El contenido colocado en el slot se utilizará como título HTML para el enlace.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "Uso del slot \"linkTitle\" para títulos HTML",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Con las propiedades <strong>text-before</strong> y <strong>text-after</strong> puede mostrar texto adicional dentro del enlace.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Mostrar texto adicional antes y después del texto del enlace dentro del enlace",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "El componente ALink le permite adaptar el texto del enlace para diferentes dispositivos. Al utilizar la propiedad \":text\" como un objeto, puede definir texto diferente para dispositivos móviles y de escritorio.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "Texto adaptable para diferentes dispositivos",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "En este ejemplo se muestra cómo personalizar la etiqueta de texto en el componente \"ALink\" en Vue.js. Por defecto, el texto se renderiza en una etiqueta \"span\". Al utilizar la propiedad \"text-tag\", la etiqueta de texto se puede personalizar de forma flexible para utilizar diferentes etiquetas HTML como \"strong\", \"em\" u otras.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "Personalización de la etiqueta de texto en el componente \"ALink\"",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "El componente ALink le permite concatenar varios títulos en una propiedad. Al utilizar la propiedad \":title\" como un array, puede especificar varios elementos que se combinarán en un solo título para el enlace.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "Concatenar títulos en una propiedad",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "El componente ALink le permite mostrar el título como HTML y controlar la colocación del título. Al utilizar las propiedades \":is-title-html\", \":title\" y \":title-placement\", puede utilizar títulos HTML y definir la posición del título.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "Mostrar títulos HTML y control de la colocación del título",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "Se pueden utilizar clases predefinidas para la transparencia para fusionar los enlaces con el fondo.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "Opciones de transparencia",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "Especifica atributos adicionales para el enlace. Puede utilizar un objeto para definir los atributos deseados y sus valores.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Define la clase CSS base para el elemento, estableciendo un estilo visual predeterminado general.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Especifica una clase CSS para ocultar el elemento, se utiliza para controlar la visibilidad del elemento en diferentes contextos.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "Esta propiedad le permite especificar clases personalizadas para los estilos de enlace.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "Especifica la clase CSS que se aplica al enlace cuando está desactivado.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "Esta propiedad le permite desactivar el enlace. Cuando disabled está establecido en true, el enlace se renderiza sin el atributo href y se agrega la clase adicional 'disabled'.",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "Objeto adicional para la traducción",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "Atributo href para el enlace",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "El contenido HTML seguro que se mostrará en el botón",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Especifica el HTML para el contenido del enlace destinado al lector de pantalla. Puede utilizar una cadena, un número o un objeto para definir el contenido HTML deseado.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Especifica atributos adicionales para los iconos. Puede utilizar un objeto para definir los atributos deseados y sus valores para los iconos.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "Especifica una clase CSS adicional para los iconos.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "Un icono en el lado izquierdo del enlace",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "Un icono en el lado derecho del enlace",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "Especifica la etiqueta HTML personalizada para los iconos.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "Especifica una ID única para el enlace. Si no se especifica ninguna ID, se genera automáticamente una ID única.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Especifica si el título debe interpretarse como HTML. Cuando el valor está establecido en true, el título se renderiza como HTML.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "Esta propiedad le permite especificar la alineación del spinner dentro del enlace. Puede utilizar \"right\" (derecha) o \"left\" (izquierda) como valor.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "Con esta propiedad puede especificar la clase CSS para el spinner.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "Con esta propiedad puede especificar si el enlace se está cargando actualmente. Cuando loading está establecido en true, se muestra un spinner dentro del enlace.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "Si se pasa esta propiedad, su contenido se renderizará como HTML sin conversión.",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Especifica el contenido HTML seguro para el área del lector de pantalla. Puede utilizar una cadena, un número o un objeto para especificar diferentes contenidos para diferentes estados.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "Atributo target para el enlace",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "Esta propiedad le permite mostrar texto adicional después del texto del enlace dentro del enlace.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Especifica si el texto del enlace debe marcarse como aria-hidden=\"true\".",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "Esta propiedad le permite mostrar texto adicional antes del texto del enlace dentro del enlace.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "Especifica la clase CSS que se aplicará al texto del enlace.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "Una cadena o un objeto que contiene el texto para diferentes dispositivos. Utilice las claves \"mobile\" y \"desktop\" para especificar el texto correspondiente para cada dispositivo.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Especifica el texto que se utilizará para el lector de pantalla.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "Esta propiedad le permite personalizar la etiqueta HTML en la que se renderiza el texto dentro del enlace.",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Proporciona un objeto para especificar atributos HTML adicionales para el título del elemento, lo que permite una personalización detallada de su comportamiento y estilo.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "Una cadena, un objeto o una matriz de elementos que se concatenan en un solo título.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "La colocación del título HTML",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Establece el \"z-index\" para el título del elemento, determinando su orden de apilamiento en el contexto de otros elementos superpuestos.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "Atributo to para RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "El slot predeterminado que contiene el contenido para el enlace.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "El slot que contiene el contenido que se mostrará después del texto en el enlace.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "El slot que contiene el contenido que se mostrará antes del texto en el enlace.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "El slot que contiene el contenido HTML que se utilizará como título para el enlace."
}