{
  "_A_LINK_COMPONENT_DESCRIPTION_": "Le composant ALink est un composant puissant de Vue.js qui fournit des styles et des fonctionnalités personnalisés pour les liens. Il offre un moyen simple et flexible de créer et de personnaliser des liens dans votre application Vue.js.",
  "_A_LINK_COMPONENT_NAME_": "Lien",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>CECI EST MON <strong>INFO-BULLE HTML !!!!</strong></div><div>Deuxième ligne</div><div>Troisième ligne</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "Le composant ALink est un composant Vue.js qui fournit des styles personnalisés pour les liens. Avec ce composant, vous pouvez utiliser diverses classes prédéfinies pour adapter le style du lien en fonction du design souhaité. Cette flexibilité vous permet d'intégrer les liens de manière transparente dans votre projet Vue.js et de maintenir une esthétique visuelle cohérente.",
  "_A_LINK_GROUP_CLASS_HEADER_": "Liens avec styles personnalisés",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "Le composant ALink vous permet d'utiliser diverses propriétés complexes pour personnaliser et contrôler le lien avec des fonctionnalités avancées. Dans l'exemple suivant, plusieurs propriétés sont utilisées pour configurer le lien et contrôler le chargement.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "Utilisation des propriétés complexes",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "Avec la nouvelle propriété <strong>disabled</strong>, vous pouvez désactiver les liens afin qu'ils ne soient plus cliquables. Lorsque le lien est désactivé, il est rendu sans l'attribut href. De plus, le lien désactivé est marqué avec la classe <strong>disabled</strong>.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "Liens désactivés",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "ALink permet de regrouper des liens pour une présentation attrayante.",
  "_A_LINK_GROUP_GROUP_HEADER_": "Regroupement",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Les liens peuvent également être regroupés dans une structure de type tableau.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Regroupement en forme de tableau",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "Avec ce composant, vous pouvez organiser les liens en groupes et ajuster la taille des groupes pour une présentation optimale.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "Ajustement des tailles des groupes de liens",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Le composant permet également le regroupement <strong>vertical</strong> des liens pour une présentation attrayante.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "Regroupement vertical",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "Le composant ALink vous permet d'afficher du contenu HTML de manière sécurisée sans lui faire entièrement confiance. En utilisant la propriété \"html\" et la bibliothèque DomPurify, le contenu HTML fourni est nettoyé et affiché en toute sécurité dans le lien.",
  "_A_LINK_GROUP_HTML_HEADER_": "Afficher le contenu HTML de manière sécurisée avec DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "Avec les propriétés <strong>icon-left</strong> et <strong>icon-right</strong>, vous pouvez maintenant afficher des icônes dans les liens pour adapter encore plus la présentation visuelle.",
  "_A_LINK_GROUP_ICONS_HEADER_": "Icônes",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "Avec les propriétés <strong>loading</strong> et <strong>loading-align</strong>, vous pouvez afficher un spinner à différentes positions à l'intérieur du lien pour indiquer que le lien est en cours de chargement.",
  "_A_LINK_GROUP_LOADING_HEADER_": "Afficher un spinner à différentes positions",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "Ce composant offre également la possibilité de présenter les liens avec un contour pour créer un effet visuel spécial.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "Options de contour",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "Le composant ALink vous permet d'utiliser du contenu HTML sécurisé comme une chaîne dans le lien. En activant la propriété \"safe-html\" et en fournissant une chaîne HTML, le contenu HTML fourni est traité de manière sécurisée et inséré directement via l'attribut JavaScript \"innerHTML\".",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "Utiliser du contenu HTML sécurisé comme chaîne dans le lien",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "Le composant vous permet de styliser les liens avec des classes prédéfinies et offre des options de taille pour répondre à vos exigences de conception individuelles.",
  "_A_LINK_GROUP_SIZES_HEADER_": "Options de taille",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "Le composant ALink vous permet d'afficher du contenu supplémentaire après le texte dans le lien en utilisant le slot \"linkAppend\". Le contenu placé dans le slot est affiché après le texte dans le lien.",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "Utilisation du slot \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Le composant ALink vous permet de placer du contenu personnalisé dans le lien en utilisant le slot par défaut \"default\". Le contenu placé dans le slot est affiché dans le lien.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "Utilisation du slot par défaut",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "Le composant ALink vous permet d'afficher du contenu supplémentaire avant le texte dans le lien en utilisant le slot \"linkPrepend\". Le contenu placé dans le slot est affiché avant le texte dans le lien.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "Utilisation du slot \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "Le composant ALink vous permet de définir du contenu HTML personnalisé pour le titre du lien en utilisant le slot \"linkTitle\" avec la propriété \":is-title-html\". Le contenu placé dans le slot est utilisé comme titre HTML pour le lien.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "Utilisation du slot \"linkTitle\" pour les titres HTML",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Avec les propriétés <strong>text-before</strong> et <strong>text-after</strong>, vous pouvez afficher du texte supplémentaire à l'intérieur du lien.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Afficher du texte supplémentaire avant et après le texte du lien à l'intérieur du lien",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "Le composant ALink vous permet d'adapter le texte du lien pour différents appareils. En utilisant la propriété \":text\" comme un objet, vous pouvez définir un texte différent pour les appareils mobiles et de bureau.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "Texte adaptable pour différents appareils",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "Cet exemple montre comment personnaliser la balise de texte dans le composant \"ALink\" de Vue.js. Par défaut, le texte est rendu dans une balise \"span\". En utilisant la propriété \"text-tag\", la balise de texte peut être personnalisée de manière flexible pour utiliser différentes balises HTML comme \"strong\", \"em\" ou autres.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "Personnalisation de la balise de texte dans le composant \"ALink\"",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "Le composant ALink vous permet de concaténer plusieurs titres dans une propriété. En utilisant la propriété \":title\" comme un tableau, vous pouvez spécifier plusieurs éléments qui seront combinés en un seul titre pour le lien.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "Concaténer des titres dans une propriété",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "Le composant ALink vous permet d'afficher le titre comme HTML et de contrôler la position du titre. En utilisant les propriétés \":is-title-html\", \":title\" et \":title-placement\", vous pouvez utiliser des titres HTML et définir la position du titre.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "Afficher les titres HTML et contrôler la position du titre",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "Des classes prédéfinies pour la transparence peuvent être utilisées pour fusionner les liens avec l'arrière-plan.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "Options de transparence",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "Spécifie des attributs supplémentaires pour le lien. Vous pouvez utiliser un objet pour définir les attributs souhaités et leurs valeurs.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Définit la classe CSS de base pour l'élément, établissant un style visuel standard général.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Spécifie une classe CSS pour masquer l'élément, utilisée pour contrôler la visibilité de l'élément dans différents contextes.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "Cette propriété vous permet de spécifier des classes personnalisées pour les styles de lien.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "Spécifie la classe CSS qui est appliquée au lien lorsqu'il est désactivé.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "Cette propriété vous permet de désactiver le lien. Lorsque disabled est réglé sur true, le lien est rendu sans l'attribut href et la classe supplémentaire 'disabled' est ajoutée.",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "Objet supplémentaire pour la traduction",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "Attribut href pour le lien",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "Le contenu HTML sécurisé qui sera affiché dans le bouton",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Spécifie le HTML pour le contenu du lien destiné au lecteur d'écran. Vous pouvez utiliser une chaîne, un nombre ou un objet pour définir le contenu HTML souhaité.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Spécifie des attributs supplémentaires pour les icônes. Vous pouvez utiliser un objet pour définir les attributs souhaités et leurs valeurs pour les icônes.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "Spécifie une classe CSS supplémentaire pour les icônes.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "Une icône sur le côté gauche du lien",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "Une icône sur le côté droit du lien",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "Spécifie la balise HTML personnalisée pour les icônes.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "Spécifie un ID unique pour le lien. Si aucun ID n'est spécifié, un ID unique est généré automatiquement.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Spécifie si le titre doit être interprété comme HTML. Lorsque la valeur est réglée sur true, le titre est rendu comme HTML.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "Cette propriété vous permet de spécifier l'alignement du spinner à l'intérieur du lien. Vous pouvez utiliser \"right\" (droite) ou \"left\" (gauche) comme valeur.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "Avec cette propriété, vous pouvez spécifier la classe CSS pour le spinner.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "Avec cette propriété, vous pouvez indiquer si le lien est actuellement en cours de chargement. Lorsque loading est réglé sur true, un spinner est affiché à l'intérieur du lien.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "Si cette propriété est passée, son contenu sera rendu en tant que HTML sans conversion.",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Spécifie le contenu HTML sécurisé pour la zone du lecteur d'écran. Vous pouvez utiliser une chaîne, un nombre ou un objet pour spécifier différents contenus pour différents états.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "Attribut target pour le lien",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "Cette propriété vous permet d'afficher du texte supplémentaire après le texte du lien à l'intérieur du lien.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Spécifie si le texte du lien doit être marqué comme aria-hidden=\"true\".",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "Cette propriété vous permet d'afficher du texte supplémentaire avant le texte du lien à l'intérieur du lien.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "Spécifie la classe CSS qui sera appliquée au texte du lien.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "Une chaîne ou un objet qui contient le texte pour différents appareils. Utilisez les clés \"mobile\" et \"desktop\" pour spécifier le texte approprié pour chaque appareil.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Spécifie le texte qui sera utilisé pour le lecteur d'écran.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "Cette propriété permet de personnaliser la balise HTML dans laquelle le texte est rendu à l'intérieur du lien.",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fournit un objet pour spécifier des attributs HTML supplémentaires pour le titre de l'élément, permettant une personnalisation détaillée de son comportement et de son style.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "Une chaîne, un objet ou un tableau d'éléments qui sont concaténés en un seul titre.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "La position du titre HTML",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Définit le \"z-index\" pour le titre de l'élément, déterminant son ordre d'empilement dans le contexte d'autres éléments superposés.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "Attribut to pour RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "Le slot par défaut qui contient le contenu pour le lien.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "Le slot qui contient le contenu qui sera affiché après le texte dans le lien.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "Le slot qui contient le contenu qui sera affiché avant le texte dans le lien.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "Le slot qui contient le contenu HTML utilisé comme titre pour le lien."
}