{
  "_A_LINK_COMPONENT_DESCRIPTION_": "Il componente ALink è un potente componente Vue.js che fornisce stili e funzionalità personalizzate per i link. Offre un modo semplice e flessibile per creare e personalizzare i link nella tua applicazione Vue.js.",
  "_A_LINK_COMPONENT_NAME_": "Link",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>QUESTO È IL MIO <strong>TOOLTIP HTML!!!!</strong></div><div>Seconda linea</div><div>Terza linea</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "Il componente ALink è un componente Vue.js che fornisce stili personalizzati per i link. Con questo componente, è possibile utilizzare diverse classi predefinite per adattare lo stile del link in base al design desiderato. Questa flessibilità ti consente di integrare i link nel tuo progetto Vue.js in modo fluido, mantenendo un'estetica visiva coerente.",
  "_A_LINK_GROUP_CLASS_HEADER_": "Link con stili individuali",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "Il componente ALink ti permette di utilizzare diverse proprietà complesse per personalizzare e controllare il link con funzionalità avanzate. Nel seguente esempio, vengono utilizzate diverse proprietà per configurare il link e controllarne il caricamento.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "Utilizzo di proprietà complesse",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "Con la nuova proprietà <strong>disabled</strong>, puoi disattivare i link in modo che non siano più cliccabili. Quando il link è disattivato, viene reso senza l'attributo href. Inoltre, il link disattivato viene contrassegnato con la classe <strong>disabled</strong>.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "Link disattivati",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "ALink consente di raggruppare i link per una presentazione attraente.",
  "_A_LINK_GROUP_GROUP_HEADER_": "Raggruppamento",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "I link possono anche essere raggruppati in una struttura simile a una tabella.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Raggruppamento a tabella",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "Con questo componente, puoi organizzare i link in gruppi e adattare le dimensioni dei gruppi per ottenere una presentazione ottimale.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "Adattamento delle dimensioni dei gruppi di link",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Il componente permette anche il raggruppamento <strong>verticale</strong> dei link per una presentazione attraente.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "Raggruppamento verticale",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "Il componente ALink ti permette di visualizzare contenuti HTML in modo sicuro, senza fidarti completamente di essi. Utilizzando la proprietà \"html\" e la libreria DomPurify, il contenuto HTML fornito viene purificato e visualizzato in modo sicuro nel link.",
  "_A_LINK_GROUP_HTML_HEADER_": "Visualizzare contenuti HTML in modo sicuro con DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "Con le proprietà <strong>icon-left</strong> e <strong>icon-right</strong>, puoi ora visualizzare icone nei link per personalizzare ulteriormente la presentazione visiva.",
  "_A_LINK_GROUP_ICONS_HEADER_": "Icone",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "Con le proprietà <strong>loading</strong> e <strong>loading-align</strong>, puoi visualizzare uno spinner in varie posizioni all'interno del link per indicare che il link è in fase di caricamento.",
  "_A_LINK_GROUP_LOADING_HEADER_": "Visualizzare uno spinner in varie posizioni",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "Questo componente offre anche la possibilità di presentare i link con una rappresentazione outline per creare un effetto visivo speciale.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "Opzioni outline",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "Il componente ALink ti permette di utilizzare contenuti HTML sicuri come stringa nel link. Attivando la proprietà \"safe-html\" e fornendo una stringa HTML, il contenuto HTML fornito viene trattato in modo sicuro e inserito direttamente tramite l'attributo JavaScript \"innerHTML\".",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "Utilizzare contenuti HTML sicuri come stringa nel link",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "Il componente ti permette di stilizzare i link con classi predefinite e offre opzioni di dimensione per soddisfare le tue esigenze di design individuali.",
  "_A_LINK_GROUP_SIZES_HEADER_": "Opzioni di dimensione",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "Il componente ALink ti permette di visualizzare contenuti aggiuntivi dopo il testo nel link utilizzando lo slot \"linkAppend\". Il contenuto posizionato nello slot viene visualizzato dopo il testo nel link.",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "Utilizzo dello slot \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Il componente ALink ti permette di posizionare contenuti personalizzati nel link utilizzando lo slot predefinito \"default\". Il contenuto posizionato nello slot viene visualizzato nel link.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "Utilizzo dello slot predefinito",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "Il componente ALink ti permette di visualizzare contenuti aggiuntivi prima del testo nel link utilizzando lo slot \"linkPrepend\". Il contenuto posizionato nello slot viene visualizzato prima del testo nel link.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "Utilizzo dello slot \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "Il componente ALink ti permette di definire contenuti HTML personalizzati per il titolo del link utilizzando lo slot \"linkTitle\" insieme alla proprietà \":is-title-html\". Il contenuto posizionato nello slot viene utilizzato come titolo HTML per il link.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "Utilizzo dello slot \"linkTitle\" per titoli HTML",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Con le proprietà <strong>text-before</strong> e <strong>text-after</strong>, puoi visualizzare testo aggiuntivo all'interno del link.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Visualizzare testo aggiuntivo prima e dopo il testo del link all'interno del link",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "Il componente ALink ti permette di adattare il testo del link per diversi dispositivi. Utilizzando la proprietà \":text\" come oggetto, puoi definire testi diversi per dispositivi mobili e desktop.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "Testo adattabile per diversi dispositivi",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "In questo esempio viene mostrato come personalizzare il tag di testo nel componente \"ALink\" di Vue.js. Per impostazione predefinita, il testo viene reso in un tag \"span\". Utilizzando la proprietà \"text-tag\", il tag di testo può essere personalizzato in modo flessibile per utilizzare diversi tag HTML come \"strong\", \"em\" o altri.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "Personalizzazione del tag di testo nel componente \"ALink\"",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "Il componente ALink ti permette di concatenare più titoli in una proprietà. Utilizzando la proprietà \":title\" come array, puoi specificare più elementi che verranno combinati in un unico titolo per il link.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "Concatenare titoli in una proprietà",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "Il componente ALink ti permette di visualizzare il titolo come HTML e controllare la posizione del titolo. Utilizzando le proprietà \":is-title-html\", \":title\" e \":title-placement\", puoi utilizzare titoli HTML e definire la posizione del titolo.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "Visualizzare titoli HTML e controllare la posizione del titolo",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "Classi predefinite per la trasparenza possono essere utilizzate per fondere i link con lo sfondo.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "Opzioni di trasparenza",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "Specifica attributi aggiuntivi per il link. Puoi utilizzare un oggetto per definire gli attributi desiderati e i loro valori.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Definisce la classe CSS di base per l'elemento, stabilendo uno stile visivo standard generale.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Specifica una classe CSS per nascondere l'elemento, utilizzata per controllare la visibilità dell'elemento in diversi contesti.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "Questa proprietà ti permette di specificare classi personalizzate per gli stili del link.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "Specifica la classe CSS che viene applicata al link quando è disattivato.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "Questa proprietà ti permette di disattivare il link. Quando disabled è impostato su true, il link viene reso senza l'attributo href e viene aggiunta la classe aggiuntiva 'disabled'.",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "Oggetto extra per la traduzione",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "Attributo href per il link",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "Il contenuto HTML sicuro che sarà visualizzato nel pulsante",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Specifica l'HTML per il contenuto del link destinato al lettore di schermo. Puoi utilizzare una stringa, un numero o un oggetto per definire il contenuto HTML desiderato.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Specifica attributi aggiuntivi per le icone. Puoi utilizzare un oggetto per definire gli attributi desiderati e i loro valori per le icone.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "Specifica una classe CSS aggiuntiva per le icone.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "Un'icona sul lato sinistro del link",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "Un'icona sul lato destro del link",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "Specifica il tag HTML personalizzato per le icone.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "Specifica un ID univoco per il link. Se non viene specificato alcun ID, viene generato automaticamente un ID univoco.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Specifica se il titolo deve essere interpretato come HTML. Quando il valore è impostato su true, il titolo viene reso come HTML.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "Questa proprietà ti permette di specificare l'allineamento dello spinner all'interno del link. Puoi utilizzare \"right\" (destra) o \"left\" (sinistra) come valore.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "Con questa proprietà, puoi specificare la classe CSS per lo spinner.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "Con questa proprietà, puoi indicare se il link è attualmente in fase di caricamento. Quando loading è impostato su true, uno spinner viene visualizzato all'interno del link.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "Se questa proprietà viene passata, il suo contenuto verrà reso come HTML senza conversione.",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Specifica il contenuto HTML sicuro per l'area del lettore di schermo. Puoi utilizzare una stringa, un numero o un oggetto per specificare contenuti diversi per stati diversi.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "Attributo target per il link",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "Questa proprietà ti permette di visualizzare testo aggiuntivo dopo il testo del link all'interno del link.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Specifica se il testo del link deve essere contrassegnato come aria-hidden=\"true\".",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "Questa proprietà ti permette di visualizzare testo aggiuntivo prima del testo del link all'interno del link.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "Specifica la classe CSS che verrà applicata al testo del link.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "Una stringa o un oggetto che contiene il testo per diversi dispositivi. Utilizza le chiavi \"mobile\" e \"desktop\" per specificare il testo appropriato per ciascun dispositivo.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Specifica il testo che verrà utilizzato per il lettore di schermo.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "Questa proprietà permette di personalizzare il tag HTML in cui viene reso il testo all'interno del link.",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fornisce un oggetto per specificare attributi HTML aggiuntivi per il titolo dell'elemento, consentendo una personalizzazione dettagliata del suo comportamento e del suo stile.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "Una stringa, un oggetto o un array di elementi che vengono concatenati in un unico titolo.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "La posizione del titolo HTML",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Imposta lo \"z-index\" per il titolo dell'elemento, determinando il suo ordine di sovrapposizione nel contesto di altri elementi sovrapposti.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "Attributo to per RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "Lo slot predefinito che contiene il contenuto per il link.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "Lo slot che contiene il contenuto che verrà visualizzato dopo il testo nel link.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "Lo slot che contiene il contenuto che verrà visualizzato prima del testo nel link.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "Lo slot che contiene il contenuto HTML utilizzato come titolo per il link."
}