{
  "_A_BUTTON_COMPONENT_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> es un botón versátil con configuración extendida a través de props. Se integra con <a href=\"/#/element\">AElement</a> para el renderizado, permitiendo configurar accesibilidad, clases, identificadores, estados de carga y otros parámetros. Soporta la personalización de apariencia, texto, iconos y manejo de eventos como clics, convirtiéndolo en una herramienta poderosa para crear interfaces.",
  "_A_BUTTON_COMPONENT_NAME_": "Botón",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Se activa cuando se hace clic en el botón.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>ESTE ES MI <strong>HTML-CONSEJO MÁGICO!!!!</strong></div><div>Segunda línea</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>ESTE ES MI <strong>HTML-CONSEJO MÁGICO!!!!</strong></div><div>Segunda línea</div><div>Número: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar un botón en estado desactivado y establecer los atributos de accesibilidad correspondientes. Para esto, se puede usar la propiedad \"<strong lang=\"en\">aria-disabled</strong>\" para indicar el estado desactivado. Esto permite usar eventos como enfoque o hover, mientras el botón permanece desactivado para clics.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Botón desactivado usando <strong lang=\"en\">aria-disabled</strong>",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Existen muchas clases <strong lang=\"en\">CSS</strong> que se pueden usar con el botón.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite usar varias propiedades y eventos complejos para configurar y gestionar un botón con funciones avanzadas. En el siguiente ejemplo, se utilizan varias propiedades y eventos para configurar el botón y gestionar su estado de carga.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Uso de propiedades y eventos complejos",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite desactivar un botón usando la propiedad \"<strong lang=\"en\">disabled</strong>\". Esto hace que el botón no esté disponible para interacción tanto visual como funcionalmente.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Desactivación de un botón",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Agrupe una serie de botones en una sola fila.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Agrupación horizontal de botones",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Puede agrupar botones en una tabla.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Agrupación tabular de botones",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "En lugar de aplicar clases de tamaño de botón a cada botón en un grupo, simplemente agregue <strong lang=\"en\">.a_btn_group_large</strong> o <strong lang=\"en\">.a_btn_group_small</strong> a cada <strong lang=\"en\">.a_btn_group</strong>, incluyendo cada grupo anidado si tiene varios niveles.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Tamaño del grupo de botones",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Coloque botones en una columna vertical.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Agrupación vertical de botones",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar contenido <strong lang=\"en\">HTML</strong> de forma segura, sin confiar completamente en él. Usando la propiedad \"<strong lang=\"en\">html</strong>\" y la biblioteca <strong lang=\"en\">DomPurify</strong>, el contenido <strong lang=\"en\">HTML</strong> enviado se limpia y se muestra de forma segura en el botón.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Visualización segura de contenido <strong lang=\"en\">HTML</strong> usando <strong lang=\"en\">DomPurify</strong>",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar iconos a la izquierda y derecha del botón usando las propiedades \"<strong lang=\"en\">:icon-left</strong>\" y \"<strong lang=\"en\">:icon-right</strong>\". Puede establecer diferentes iconos para diferentes dispositivos para lograr una apariencia personalizable.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Uso de propiedades de iconos",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar un botón en estado de carga con un indicador de carga. También puede establecer la alineación del indicador de carga. Esto puede ser útil para mostrar un proceso en segundo plano que requiere que el usuario espere a que se complete.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Botón en estado de carga y alineación del indicador de carga",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "¿Necesita un botón, pero sin colores de fondo brillantes? Reemplace las clases de modificadores estándar con clases <strong lang=\"en\">.a_btn_outline_*</strong> para eliminar todas las imágenes y colores de fondo de cualquier botón.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Botones de contorno",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite usar contenido <strong lang=\"en\">HTML</strong> seguro como una cadena dentro del botón. Al habilitar la propiedad \"<strong lang=\"en\">safe-html</strong>\" y pasar una cadena de contenido <strong lang=\"en\">HTML</strong>, el contenido <strong lang=\"en\">HTML</strong> enviado se tratará con confianza y se insertará directamente a través del atributo <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Uso de contenido <strong lang=\"en\">HTML</strong> seguro como cadena dentro del botón",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "¿Quiere botones grandes o pequeños? Agregue <strong lang=\"en\">.a_btn_large</strong> o <strong lang=\"en\">.a_btn_small</strong> para tamaños adicionales.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Tamaños de botones",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar contenido adicional después del texto del botón usando el slot \"<strong lang=\"en\">buttonAppend</strong>\". El contenido colocado en el slot se mostrará después del texto del botón.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite colocar contenido personalizado dentro del botón usando el slot predeterminado \"<strong lang=\"en\">:slots='default'</strong>\". El contenido colocado en el slot se mostrará dentro del botón.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Uso del slot predeterminado",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar contenido adicional antes del texto del botón usando el slot \"<strong lang=\"en\">buttonPrepend</strong>\". El contenido colocado en el slot se mostrará antes del texto del botón.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite definir contenido <strong lang=\"en\">HTML</strong> personalizado para el título del botón usando el slot \"<strong lang=\"en\">buttonTitle</strong>\" en combinación con el atributo \"<strong lang=\"en\">:is-title-html</strong>\". El contenido colocado en el slot se usará como título <strong lang=\"en\">HTML</strong> para el botón.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Uso del slot \"<strong lang=\"en\">buttonTitle</strong>\" para título <strong lang=\"en\">HTML</strong>",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Establecer las <strong lang=\"en\">props</strong> 'stop' en un valor booleano se puede usar para controlar si un evento debe propagarse o no. El ejemplo muestra dos escenarios diferentes: uno con el valor 'stop' establecido en '<strong lang=\"en\">true</strong>' y el otro establecido en '<strong lang=\"en\">false</strong>'.",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Uso de las <strong lang=\"en\">props</strong> 'stop' para detener la propagación de eventos",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite usar un botón como interruptor con dos estados (encendido/apagado). Usando los atributos \"<strong lang=\"en\">:is-switch</strong>\" y \"<strong lang=\"en\">:model-switch</strong>\", puede habilitar el modo de interruptor y controlar el estado del botón. El botón se renderiza como un elemento \"<strong lang=\"en\">button</strong>\" con el atributo \"<strong lang=\"en\">aria-pressed</strong>\" que indica el estado.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Uso del modo de botón interruptor",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar texto adicional dentro del botón. Esto puede ser útil para agregar texto predefinido antes o después del texto principal del botón.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texto adicional dentro del botón",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite personalizar el texto del botón para diferentes dispositivos. Usando el atributo \"<strong lang=\"en\">:text</strong>\" como objeto, puede establecer texto diferente para dispositivos móviles y de escritorio.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Personalización de texto para diferentes dispositivos",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "Este ejemplo muestra cómo personalizar la etiqueta para el texto en el componente \"<strong lang=\"en\">AButton</strong>\" en <strong lang=\"en\">Vue.js</strong>. Por defecto, el texto se muestra en una etiqueta <strong lang=\"en\">span</strong>. Sin embargo, usando la propiedad <strong lang=\"en\">text-tag</strong>, la etiqueta para el texto se puede personalizar de manera flexible para usar varias etiquetas <strong lang=\"en\">HTML</strong> como \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" u otras.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Cambio de la etiqueta de texto en el componente \"<strong lang=\"en\">AButton</strong>\"",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite combinar varios títulos en un solo atributo. Usando el atributo \"<strong lang=\"en\">:title</strong>\" como array, puede especificar varios elementos que se combinarán en un solo título para el botón.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Combinación de títulos en un solo atributo",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "El componente <strong lang=\"en\">AButton</strong> permite mostrar un título como <strong lang=\"en\">HTML</strong> y controlar su ubicación. Usando los atributos \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" y \"<strong lang=\"en\">:title-placement</strong>\", puede usar un título <strong lang=\"en\">HTML</strong> y establecer su ubicación.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualización de un título <strong lang=\"en\">HTML</strong> con traducción y parámetros",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "En el ejemplo siguiente, el título se muestra como texto traducido con un parámetro. El parámetro <strong lang=\"en\">number</strong> se pasa a través del atributo <strong lang=\"en\">extra</strong>.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Visualización de un título <strong lang=\"en\">HTML</strong> y su ubicación",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Si necesita un botón que armonice con el fondo en lugar de cubrirlo, reemplace las clases estándar con clases <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Botones transparentes",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Determina si el botón debe estar desactivado. Si el valor se establece como <strong lang=\"en\">true</strong>, el botón se mostrará como desactivado y se agregará la propiedad de accesibilidad \"<strong lang=\"en\">aria-disabled</strong>\".",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Define una etiqueta <strong lang=\"en\">ARIA</strong> para el botón. Puede usar una cadena, un número o un objeto como valor para establecer la etiqueta deseada.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Define atributos adicionales para el botón. Puede usar un objeto para establecer los atributos necesarios y sus valores.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Define la clase de estilo base para el elemento, estableciendo el estilo visual general predeterminado.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Establece la clase de estilo para ocultar el elemento, se usa para controlar la visibilidad del elemento en varios contextos.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Clase <strong lang=\"en\">CSS</strong>",
  "_A_BUTTON_PROPS_CLASS_DISABLED_DESCRIPTION_": "Especifica la clase <strong lang=\"en\">CSS</strong> que se aplica al botón cuando está desactivado.",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Determina si el botón debe estar desactivado. Si el valor se establece como <strong lang=\"en\">true</strong>, el botón estará desactivado.",
  "_A_BUTTON_PROPS_EXTRA_DATA_DESCRIPTION_": "Proporciona datos adicionales para todos los slots del componente, permitiendo pasar datos e información personalizados que se pueden usar dentro de los slots para una personalización más flexible y detallada del contenido.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Objeto adicional para traducción",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Contenido <strong lang=\"en\">HTML</strong> que debe mostrarse dentro del botón.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Define el contenido <strong lang=\"en\">HTML</strong> para el lector de pantalla del botón. Puede usar una cadena, un número o un objeto como valor para establecer el contenido <strong lang=\"en\">HTML</strong> deseado.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Define atributos adicionales para iconos. Puede usar un objeto para establecer los atributos necesarios y sus valores para iconos.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Define una clase <strong lang=\"en\">CSS</strong> adicional para iconos.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Define un icono a la izquierda del botón. Puede especificar un nombre de icono como cadena o definir diferentes iconos para diferentes dispositivos como objeto.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Define un icono a la derecha del botón. Puede especificar un nombre de icono como cadena o definir diferentes iconos para diferentes dispositivos como objeto.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Define una etiqueta <strong lang=\"en\">HTML</strong> personalizada para iconos.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Define un identificador único para el botón. Si no se especifica un identificador, se generará automáticamente un identificador único.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Determina si el botón debe usarse en modo interruptor. Si el valor se establece como <strong lang=\"en\">true</strong>, el botón se mostrará como un botón interruptor.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Determina si el título debe interpretarse como <strong lang=\"en\">HTML</strong>. Si el valor se establece como <strong lang=\"en\">true</strong>, el título se mostrará como <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Determina la alineación del indicador de carga. Puede especificar el valor \"<strong lang=\"en\">left</strong>\" o \"<strong lang=\"en\">right</strong>\".",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Define la clase <strong lang=\"en\">CSS</strong> para el estado de carga del botón. Puede especificar una cadena con una clase <strong lang=\"en\">CSS</strong> o usar un objeto para especificar diferentes clases <strong lang=\"en\">CSS</strong> para diferentes estados.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Determina si el botón está en estado de carga. Si el valor se establece como <strong lang=\"en\">true</strong>, el botón se mostrará como \"<strong lang=\"en\">loading</strong>\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "El valor del modelo que controla el estado del interruptor del botón. Si el valor se establece como <strong lang=\"en\">true</strong>, el botón estará encendido (<strong lang=\"en\">pressed=true</strong>), de lo contrario, el botón estará apagado (<strong lang=\"en\">pressed=false</strong>).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Determina si se debe prevenir el comportamiento predeterminado de los manejadores de eventos para el botón (<strong lang=\"en\">preventDefault</strong>).",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Habilita la confianza en la cadena <strong lang=\"en\">HTML</strong> pasada y permite mostrarla dentro del botón.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Define contenido <strong lang=\"en\">HTML</strong> seguro para el área de lectura de pantalla. Puede especificar una cadena, un número o un objeto para establecer diferentes contenidos para diferentes estados.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Determina si se debe detener la propagación adicional del evento (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Define el valor del índice de tabulación (<strong lang=\"en\">tabindex</strong>) para el botón. El índice de tabulación se puede establecer como número o cadena.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Define la etiqueta <strong lang=\"en\">HTML</strong> que se usará para mostrar el botón.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Define el texto que debe mostrarse después del texto del botón.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Determina si el texto del botón debe marcarse como <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Define el texto que debe mostrarse antes del texto del botón.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Define la clase <strong lang=\"en\">CSS</strong> que se aplicará al texto del botón.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Cadena u objeto que contiene texto para diferentes dispositivos. Use las claves \"<strong lang=\"en\">mobile</strong>\" y \"<strong lang=\"en\">desktop</strong>\" para especificar el texto correspondiente para cada dispositivo.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Define el texto que se usará para el lector de pantalla (<strong lang=\"en\">screen reader</strong>).",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Este parámetro permite personalizar la etiqueta <strong lang=\"en\">HTML</strong> en la que se muestra el texto dentro del botón.",
  "_A_BUTTON_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Proporciona un objeto para personalizar atributos <strong lang=\"en\">HTML</strong> adicionales para el título del elemento, permitiendo detallar su comportamiento y estilo.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Cadena o array de elementos que se combinarán en un solo título.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Posicionamiento del título <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Establece el <strong lang=\"en\">z-index</strong> para el título del elemento, definiendo su orden de apilamiento en el contexto de otros elementos superpuestos.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Define el tipo de botón. Los valores permitidos son \"<strong lang=\"en\">button</strong>\", \"<strong lang=\"en\">submit</strong>\" y \"<strong lang=\"en\">reset</strong>\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot que contiene contenido que debe mostrarse después del texto del botón.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot que contiene contenido que debe mostrarse antes del texto del botón.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot que contiene contenido <strong lang=\"en\">HTML</strong> que se usará como título para el botón.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Slot predeterminado que contiene contenido para el botón."
}
