{
  "_A_BUTTON_COMPONENT_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> est un bouton polyvalent avec une configuration étendue via les props. Il s'intègre avec <a href=\"/#/element\">AElement</a> pour le rendu, permettant de configurer l'accessibilité, les classes, les identifiants, les états de chargement et d'autres paramètres. Il prend en charge la personnalisation de l'apparence, du texte, des icônes et la gestion des événements tels que les clics, ce qui en fait un outil puissant pour créer des interfaces.",
  "_A_BUTTON_COMPONENT_NAME_": "Bouton",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Se déclenche lorsque le bouton est cliqué.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>VOICI MON <strong>HTML-CONSEIL MAGIQUE!!!!</strong></div><div>Deuxième ligne</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>VOICI MON <strong>HTML-CONSEIL MAGIQUE!!!!</strong></div><div>Deuxième ligne</div><div>Numéro: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher un bouton dans un état désactivé et de définir les attributs d'accessibilité appropriés. Pour cela, la propriété \"<strong lang=\"en\">aria-disabled</strong>\" peut être utilisée pour indiquer l'état désactivé. Cela permet d'utiliser des événements tels que le focus ou le survol, tout en gardant le bouton désactivé pour les clics.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Bouton désactivé avec <strong lang=\"en\">aria-disabled</strong>",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Il existe de nombreuses classes <strong lang=\"en\">CSS</strong> qui peuvent être utilisées avec le bouton.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'utiliser diverses propriétés et événements complexes pour configurer et gérer un bouton avec des fonctionnalités avancées. Dans l'exemple suivant, plusieurs propriétés et événements sont utilisés pour configurer le bouton et gérer son état de chargement.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Utilisation de propriétés et d'événements complexes",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet de désactiver un bouton à l'aide de la propriété \"<strong lang=\"en\">disabled</strong>\". Cela rend le bouton indisponible pour l'interaction, tant visuellement que fonctionnellement.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Désactivation d'un bouton",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Regroupez une série de boutons sur une seule ligne.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Regroupement horizontal de boutons",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Vous pouvez regrouper les boutons dans un tableau.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Regroupement tabulaire de boutons",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Au lieu d'appliquer des classes de taille de bouton à chaque bouton d'un groupe, ajoutez simplement <strong lang=\"en\">.a_btn_group_large</strong> ou <strong lang=\"en\">.a_btn_group_small</strong> à chaque <strong lang=\"en\">.a_btn_group</strong>, y compris chaque groupe imbriqué si vous avez plusieurs niveaux.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Taille du groupe de boutons",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Placez les boutons dans une colonne verticale.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Regroupement vertical de boutons",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher en toute sécurité du contenu <strong lang=\"en\">HTML</strong> sans lui faire entièrement confiance. En utilisant la propriété \"<strong lang=\"en\">html</strong>\" et la bibliothèque <strong lang=\"en\">DomPurify</strong>, le contenu <strong lang=\"en\">HTML</strong> transmis est nettoyé et affiché en toute sécurité dans le bouton.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Affichage sécurisé du contenu <strong lang=\"en\">HTML</strong> à l'aide de <strong lang=\"en\">DomPurify</strong>",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher des icônes à gauche et à droite du bouton à l'aide des propriétés \"<strong lang=\"en\">:icon-left</strong>\" et \"<strong lang=\"en\">:icon-right</strong>\". Vous pouvez définir différentes icônes pour différents appareils afin d'obtenir une apparence personnalisable.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Utilisation des propriétés d'icônes",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher un bouton en état de chargement avec un indicateur de chargement. Vous pouvez également définir l'alignement de l'indicateur de chargement. Cela peut être utile pour afficher un processus en arrière-plan qui nécessite que l'utilisateur attende qu'il soit terminé.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Bouton en état de chargement et alignement de l'indicateur de chargement",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Besoin d'un bouton, mais sans couleurs de fond vives? Remplacez les classes de modificateurs standard par des classes <strong lang=\"en\">.a_btn_outline_*</strong> pour supprimer toutes les images et couleurs de fond de n'importe quel bouton.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Boutons contour",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'utiliser du contenu <strong lang=\"en\">HTML</strong> sécurisé sous forme de chaîne à l'intérieur du bouton. Lorsque la propriété \"<strong lang=\"en\">safe-html</strong>\" est activée et qu'une chaîne de contenu <strong lang=\"en\">HTML</strong> est transmise, le contenu <strong lang=\"en\">HTML</strong> transmis sera traité avec confiance et inséré directement via l'attribut <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Utilisation de contenu <strong lang=\"en\">HTML</strong> sécurisé sous forme de chaîne à l'intérieur du bouton",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Vous voulez des boutons grands ou petits? Ajoutez <strong lang=\"en\">.a_btn_large</strong> ou <strong lang=\"en\">.a_btn_small</strong> pour des tailles supplémentaires.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Tailles des boutons",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher du contenu supplémentaire après le texte du bouton à l'aide du slot \"<strong lang=\"en\">buttonAppend</strong>\". Le contenu placé dans le slot sera affiché après le texte du bouton.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet de placer du contenu personnalisé à l'intérieur du bouton à l'aide du slot par défaut \"<strong lang=\"en\">:slots='default'</strong>\". Le contenu placé dans le slot sera affiché à l'intérieur du bouton.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Utilisation du slot par défaut",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher du contenu supplémentaire avant le texte du bouton à l'aide du slot \"<strong lang=\"en\">buttonPrepend</strong>\". Le contenu placé dans le slot sera affiché avant le texte du bouton.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet de définir un contenu <strong lang=\"en\">HTML</strong> personnalisé pour le titre du bouton à l'aide du slot \"<strong lang=\"en\">buttonTitle</strong>\" en combinaison avec l'attribut \"<strong lang=\"en\">:is-title-html</strong>\". Le contenu placé dans le slot sera utilisé comme titre <strong lang=\"en\">HTML</strong> pour le bouton.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Utilisation du slot \"<strong lang=\"en\">buttonTitle</strong>\" pour le titre <strong lang=\"en\">HTML</strong>",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "La définition des <strong lang=\"en\">props</strong> 'stop' sur une valeur booléenne peut être utilisée pour contrôler si un événement doit se propager ou non. L'exemple montre deux scénarios différents: l'un avec la valeur 'stop' définie sur '<strong lang=\"en\">true</strong>' et l'autre définie sur '<strong lang=\"en\">false</strong>'.",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Utilisation des <strong lang=\"en\">props</strong> 'stop' pour arrêter la propagation des événements",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'utiliser un bouton comme interrupteur avec deux états (activé/désactivé). À l'aide des attributs \"<strong lang=\"en\">:is-switch</strong>\" et \"<strong lang=\"en\">:model-switch</strong>\", vous pouvez activer le mode interrupteur et contrôler l'état du bouton. Le bouton est rendu comme un élément \"<strong lang=\"en\">button</strong>\" avec l'attribut \"<strong lang=\"en\">aria-pressed</strong>\" indiquant l'état.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Utilisation du mode bouton interrupteur",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher du texte supplémentaire à l'intérieur du bouton. Cela peut être utile pour ajouter du texte prédéfini avant ou après le texte principal du bouton.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texte supplémentaire à l'intérieur du bouton",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet de personnaliser le texte du bouton pour différents appareils. À l'aide de l'attribut \"<strong lang=\"en\">:text</strong>\" sous forme d'objet, vous pouvez définir un texte différent pour les appareils mobiles et de bureau.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Personnalisation du texte pour différents appareils",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "Cet exemple montre comment personnaliser la balise pour le texte dans le composant \"<strong lang=\"en\">AButton</strong>\" dans <strong lang=\"en\">Vue.js</strong>. Par défaut, le texte est affiché dans une balise <strong lang=\"en\">span</strong>. Cependant, en utilisant la propriété <strong lang=\"en\">text-tag</strong>, la balise pour le texte peut être personnalisée de manière flexible pour utiliser diverses balises <strong lang=\"en\">HTML</strong> telles que \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" ou autres.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Modification de la balise de texte dans le composant \"<strong lang=\"en\">AButton</strong>\"",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet de combiner plusieurs titres dans un seul attribut. À l'aide de l'attribut \"<strong lang=\"en\">:title</strong>\" sous forme de tableau, vous pouvez spécifier plusieurs éléments qui seront combinés en un seul titre pour le bouton.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Combinaison de titres dans un seul attribut",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Le composant <strong lang=\"en\">AButton</strong> permet d'afficher un titre sous forme de <strong lang=\"en\">HTML</strong> et de contrôler son placement. À l'aide des attributs \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" et \"<strong lang=\"en\">:title-placement</strong>\", vous pouvez utiliser un titre <strong lang=\"en\">HTML</strong> et définir son emplacement.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Affichage d'un titre <strong lang=\"en\">HTML</strong> avec traduction et paramètres",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "Dans l'exemple ci-dessous, le titre est affiché sous forme de texte traduit avec un paramètre. Le paramètre <strong lang=\"en\">number</strong> est transmis via l'attribut <strong lang=\"en\">extra</strong>.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Affichage d'un titre <strong lang=\"en\">HTML</strong> et son placement",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Si vous avez besoin d'un bouton qui s'harmonise avec l'arrière-plan au lieu de le couvrir, remplacez les classes standard par des classes <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Boutons transparents",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Détermine si le bouton doit être désactivé. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le bouton sera affiché comme désactivé et la propriété d'accessibilité \"<strong lang=\"en\">aria-disabled</strong>\" sera ajoutée.",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Définit une étiquette <strong lang=\"en\">ARIA</strong> pour le bouton. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir l'étiquette souhaitée.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Définit des attributs supplémentaires pour le bouton. Vous pouvez utiliser un objet pour définir les attributs nécessaires et leurs valeurs.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Définit la classe de style de base pour l'élément, établissant le style visuel général par défaut.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Définit la classe de style pour masquer l'élément, utilisée pour contrôler la visibilité de l'élément dans différents contextes.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong>",
  "_A_BUTTON_PROPS_CLASS_DISABLED_DESCRIPTION_": "Spécifie la classe <strong lang=\"en\">CSS</strong> qui est appliquée au bouton lorsqu'il est désactivé.",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Détermine si le bouton doit être désactivé. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le bouton sera désactivé.",
  "_A_BUTTON_PROPS_EXTRA_DATA_DESCRIPTION_": "Fournit des données supplémentaires pour tous les slots du composant, permettant de transmettre des données et des informations personnalisées qui peuvent être utilisées à l'intérieur des slots pour une personnalisation plus flexible et détaillée du contenu.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Objet supplémentaire pour la traduction",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Contenu <strong lang=\"en\">HTML</strong> qui doit être affiché à l'intérieur du bouton.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Définit le contenu <strong lang=\"en\">HTML</strong> pour le lecteur d'écran du bouton. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir le contenu <strong lang=\"en\">HTML</strong> souhaité.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Définit des attributs supplémentaires pour les icônes. Vous pouvez utiliser un objet pour définir les attributs nécessaires et leurs valeurs pour les icônes.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Définit une classe <strong lang=\"en\">CSS</strong> supplémentaire pour les icônes.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Définit une icône à gauche du bouton. Vous pouvez spécifier un nom d'icône sous forme de chaîne ou définir différentes icônes pour différents appareils sous forme d'objet.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Définit une icône à droite du bouton. Vous pouvez spécifier un nom d'icône sous forme de chaîne ou définir différentes icônes pour différents appareils sous forme d'objet.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Définit une balise <strong lang=\"en\">HTML</strong> personnalisée pour les icônes.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Définit un identifiant unique pour le bouton. Si aucun identifiant n'est spécifié, un identifiant unique sera automatiquement généré.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Détermine si le bouton doit être utilisé en mode interrupteur. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le bouton sera affiché comme un bouton interrupteur.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Détermine si le titre doit être interprété comme <strong lang=\"en\">HTML</strong>. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le titre sera affiché comme <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Détermine l'alignement de l'indicateur de chargement. Vous pouvez spécifier la valeur \"<strong lang=\"en\">left</strong>\" ou \"<strong lang=\"en\">right</strong>\".",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Définit la classe <strong lang=\"en\">CSS</strong> pour l'état de chargement du bouton. Vous pouvez spécifier une chaîne avec une classe <strong lang=\"en\">CSS</strong> ou utiliser un objet pour spécifier différentes classes <strong lang=\"en\">CSS</strong> pour différents états.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Détermine si le bouton est en état de chargement. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le bouton sera affiché comme \"<strong lang=\"en\">loading</strong>\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "La valeur du modèle qui contrôle l'état de l'interrupteur du bouton. Si la valeur est définie sur <strong lang=\"en\">true</strong>, le bouton sera activé (<strong lang=\"en\">pressed=true</strong>), sinon le bouton sera désactivé (<strong lang=\"en\">pressed=false</strong>).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Détermine si le comportement par défaut des gestionnaires d'événements pour le bouton doit être empêché (<strong lang=\"en\">preventDefault</strong>).",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Active la confiance dans la chaîne <strong lang=\"en\">HTML</strong> transmise et permet de l'afficher à l'intérieur du bouton.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Définit un contenu <strong lang=\"en\">HTML</strong> sécurisé pour la zone de lecture d'écran. Vous pouvez spécifier une chaîne, un nombre ou un objet pour définir différents contenus pour différents états.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Détermine si la propagation ultérieure de l'événement doit être arrêtée (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Définit la valeur de l'index de tabulation (<strong lang=\"en\">tabindex</strong>) pour le bouton. L'index de tabulation peut être défini comme un nombre ou une chaîne.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Définit la balise <strong lang=\"en\">HTML</strong> qui sera utilisée pour afficher le bouton.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Définit le texte qui doit être affiché après le texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Détermine si le texte du bouton doit être marqué comme <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Définit le texte qui doit être affiché avant le texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Définit la classe <strong lang=\"en\">CSS</strong> qui sera appliquée au texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Chaîne ou objet contenant du texte pour différents appareils. Utilisez les clés \"<strong lang=\"en\">mobile</strong>\" et \"<strong lang=\"en\">desktop</strong>\" pour spécifier le texte correspondant pour chaque appareil.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Définit le texte qui sera utilisé pour le lecteur d'écran (<strong lang=\"en\">screen reader</strong>).",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Ce paramètre permet de personnaliser la balise <strong lang=\"en\">HTML</strong> dans laquelle le texte est affiché à l'intérieur du bouton.",
  "_A_BUTTON_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fournit un objet pour personnaliser des attributs <strong lang=\"en\">HTML</strong> supplémentaires pour le titre de l'élément, permettant de détailler son comportement et son style.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Chaîne ou tableau d'éléments qui seront combinés en un seul titre.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Positionnement du titre <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Définit le <strong lang=\"en\">z-index</strong> pour le titre de l'élément, déterminant son ordre d'empilement dans le contexte d'autres éléments qui se chevauchent.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Définit le type de bouton. Les valeurs autorisées sont \"<strong lang=\"en\">button</strong>\", \"<strong lang=\"en\">submit</strong>\" et \"<strong lang=\"en\">reset</strong>\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot qui contient du contenu qui doit être affiché après le texte du bouton.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot qui contient du contenu qui doit être affiché avant le texte du bouton.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot qui contient du contenu <strong lang=\"en\">HTML</strong> qui sera utilisé comme titre pour le bouton.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Slot par défaut qui contient du contenu pour le bouton."
}
