{
  "_A_BUTTON_COMPONENT_DESCRIPTION_": "Komponenta <strong>AButton</strong> je univerzalna tipka s naprednim mogućnostima prilagodbe putem propova. Integrira se s <a href=\"/#/element\">AElement</a> za renderiranje i omogućuje prilagodbu pristupačnosti, klasa, identifikatora, stanja učitavanja i drugih parametara. Podržava prilagodbu izgleda, teksta, ikona i obradu događaja kao što su klikovi, što je čini moćnim alatom za dizajn korisničkih sučelja.",
  "_A_BUTTON_COMPONENT_NAME_": "Tipka",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Emituje se kada se tipka klikne.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>OVO JE MOJ <strong>HTML-ALAT ZA SAVJETE!!!!</strong></div><div>Drugi redak</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>OVO JE MOJ <strong>HTML-ALAT ZA SAVJETE!!!!</strong></div><div>Drugi redak</div><div>Broj: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje tipke kao neaktivne i postavljanje odgovarajućih svojstava pristupačnosti. Možete koristiti prop \"aria-disabled\" za označavanje neaktivnog stanja. To vam omogućuje korištenje događaja poput fokusa ili hovera dok tipka nije klikabilna.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Neaktivna tipka s aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Postoji mnogo CSS klasa koje se mogu koristiti s tipkom.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Komponenta AButton omogućuje vam korištenje raznih složenih propova i događaja za prilagodbu i kontrolu tipke s naprednim funkcijama. U sljedećem primjeru koristi se nekoliko propova i događaj za konfiguriranje tipke i kontrolu učitavanja.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Korištenje složenih propova i događaja",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Komponenta AButton omogućuje vam onemogućavanje tipke pomoću propa \"disabled\". Time se tipka vizualno i funkcionalno onemogućuje, tako da više nije interaktivna.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Onemogućavanje tipke",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Grupirajte niz tipki u jedan redak.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Horizontalno grupiranje tipki",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Možete grupirati tipke u tablici.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Tablično grupiranje tipki",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Umjesto primjene klasa za veličinu tipki na svaku tipku u grupi, jednostavno dodajte .a_btn_group_large ili .a_btn_group_small na svaku .a_btn_group, uključujući svaku pojedinačnu, kada ugnijezdujete više grupa.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Veličina grupe tipki",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Grupirajte tipke u okomiti stupac.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Okomito grupiranje tipki",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Komponenta AButton omogućuje vam sigurno prikazivanje HTML sadržaja bez potpune pouzdanosti u njega. Korištenjem propa \"html\" i biblioteke DomPurify, predani HTML sadržaj se čisti i sigurno prikazuje u tipki.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Sigurno prikazivanje HTML sadržaja uz pomoć DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje ikona s lijeve i desne strane tipke pomoću propova \":icon-left\" i \":icon-right\". Možete definirati različite ikone za različite uređaje kako biste postigli prilagodljiv prikaz.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Korištenje icon-propova",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje tipke u stanju učitavanja s indikatorom učitavanja. Također možete postaviti poravnavanje indikatora učitavanja. Ovo može biti korisno za označavanje da se određeni postupak odvija u pozadini i da korisnik mora pričekati njegov završetak.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Tipka sa stanjem učitavanja i poravnavanjem indikatora učitavanja",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Trebate tipku, ali ne i jarke pozadinske boje koje donosi? Zamijenite standardne modifikatorske klase s .a_btn_outline_* klasama kako biste uklonili sve pozadinske slike i boje na bilo kojoj tipki.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Tipke s obrisima",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Komponenta AButton omogućuje vam korištenje sigurnog HTML sadržaja kao niza u tipki. Aktiviranjem propa \"safe-html\" i predajom HTML niza, predani HTML sadržaj se pouzdano obrađuje i izravno umeće putem JavaScript atributa \"innerHTML\".",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Korištenje sigurnog HTML sadržaja kao niza u tipki",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Želite li veće ili manje tipke? Dodajte .a_btn_large ili .a_btn_small za dodatne veličine.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Veličine tipki",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje dodatnog sadržaja nakon teksta u tipki pomoću slota \"buttonAppend\". Sadržaj postavljen u slot prikazuje se nakon teksta u tipki.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Korištenje slota \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Komponenta AButton omogućuje vam postavljanje prilagođenog sadržaja unutar tipke pomoću zadanog slota \":slots='default'\". Sadržaj postavljen u slot prikazuje se unutar tipke.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Korištenje zadanog slota",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje dodatnog sadržaja prije teksta u tipki pomoću slota \"buttonPrepend\". Sadržaj postavljen u slot prikazuje se prije teksta u tipki.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Korištenje slota \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Komponenta AButton omogućuje vam definiranje prilagođenog HTML sadržaja za naslov tipke pomoću slota \"buttonTitle\" zajedno s propom \":is-title-html\". Sadržaj postavljen u slot koristi se kao HTML naslov za tipku.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Korištenje slota \"buttonTitle\" za HTML naslov",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Postavljanjem propa \"stop\" na logičku vrijednost može se kontrolirati hoće li se događaj propagirati ili ne. Primjer prikazuje dva različita scenarija: jedan s \"stop\" postavljenim na \"true\" i jedan na \"false\".",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Korištenje propa \"stop\" za zaustavljanje propagacije događaja",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Komponenta AButton omogućuje vam korištenje tipke kao prekidača s dva stanja (aktivno/neaktivno). Korištenjem propova \":is-switch\" i \":model-switch\" možete aktivirati prekidač i kontrolirati stanje. Tipka se renderira kao element \"button\" s atributom \"aria-pressed\" za označavanje stanja.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Korištenje moda prekidača tipke",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje dodatnog teksta unutar tipke. Ovo može biti korisno za dodavanje unaprijed definiranog teksta prije ili nakon stvarnog teksta tipke.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Dodatni tekst unutar tipke",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Komponenta AButton omogućuje vam prilagodbu teksta tipke za različite uređaje. Korištenjem propa \":text\" kao objekta možete definirati različit tekst za mobilne i desktop uređaje.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Prilagodljiv tekst za različite uređaje",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "U ovom primjeru se prikazuje kako prilagoditi oznaku teksta u komponenti \"AButton\" u Vue.js. Prema zadanim postavkama, tekst se renderira u oznaci \"span\". Korištenjem propa \"text-tag\" možete fleksibilno prilagoditi oznaku teksta kako biste koristili različite HTML oznake kao što su \"strong\", \"em\" ili druge.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Prilagodba oznake teksta u komponenti \"AButton\"",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Komponenta AButton omogućuje vam da spojite više naslova u jedan prop. Korištenjem propa \":title\" kao niza možete navesti više elemenata koji se spajaju u jedan naslov za tipku.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Spajanje naslova u jedan prop",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Komponenta AButton omogućuje vam prikazivanje naslova kao HTML i kontrolu pozicioniranja naslova. Korištenjem propova \":is-title-html\", \":title\" i \":title-placement\" možete koristiti HTML naslove i postaviti pozicioniranje naslova.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Prikazivanje HTML naslova s prijevodom i parametrom",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "U sljedećem primjeru, naslov se prikazuje kao prevedeni tekst s parametrom. Parametar broj prenosi se putem atributa extra.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Prikazivanje HTML naslova i pozicioniranje naslova",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Ako vam je potrebna tipka koja se stapa s pozadinom umjesto da je prekriva, zamijenite standardne klase modifikatora s .a_btn_transparent* klasama.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Transparentne tipke",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Navodi hoće li tipka biti označena kao neaktivna. Ako je vrijednost postavljena na true, tipka će biti prikazana kao neaktivna i svojstvo pristupačnosti \"aria-disabled\" će biti dodano.",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": " Navodi ARIA oznaku za tipku. Možete koristiti niz, broj ili objekt kao vrijednost za postavljanje željene oznake.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Navodi dodatne atribute za tipku. Možete koristiti objekt za postavljanje željenih atributa i njihovih vrijednosti.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Definira osnovnu CSS klasu za element, postavljajući opći vizualni standardni stil.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Postavlja CSS klasu za skrivanje elementa, koristi se za kontrolu vidljivosti elementa u različitim kontekstima.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "CSS klasa",
  "_A_BUTTON_PROPS_CLASS_DISABLED_DESCRIPTION_": "Navodi CSS klasu koja se primjenjuje na tipku kada je onemogućena.",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Navodi hoće li tipka biti onemogućena. Ako je vrijednost postavljena na true, tipka će biti onemogućena.",
  "_A_BUTTON_PROPS_EXTRA_DATA_DESCRIPTION_": "Pruža dodatne podatke za sve slotove komponente, što omogućuje prijenos prilagođenih podataka i informacija za korištenje unutar slotova za fleksibilniju i detaljniju prilagodbu sadržaja.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Dodatni objekt za prijevod",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "HTML sadržaj koji treba osigurati i prikazati u tipki",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Navodi HTML za sadržaj čitača ekrana tipke. Možete koristiti niz, broj ili objekt kao vrijednost za postavljanje željenog HTML sadržaja.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Navodi dodatne atribute za ikone. Možete koristiti objekt za postavljanje željenih atributa i njihovih vrijednosti za ikone.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Navodi dodatnu CSS klasu za ikone.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Definira ikonu s lijeve strane tipke. Možete navesti naziv ikone kao niz ili definirati različite ikone za različite uređaje kao objekt.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Definira ikonu s desne strane tipke. Možete navesti naziv ikone kao niz ili definirati različite ikone za različite uređaje kao objekt.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": " Navodi prilagođenu HTML oznaku za ikone.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Navodi jedinstveni ID za tipku. Ako ID nije naveden, automatski će se generirati jedinstveni ID.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Navodi hoće li se tipka koristiti u načinu prekidača. Ako je vrijednost postavljena na true, tipka će biti renderirana kao prekidač.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Navodi hoće li se naslov interpretirati kao HTML. Ako je vrijednost postavljena na true, naslov će biti renderiran kao HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Navodi poravnanje indikatora učitavanja. Možete navesti \"left\" ili \"right\" kao vrijednost.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Navodi CSS klasu za stanje učitavanja tipke. Možete navesti niz s CSS klasom ili koristiti objekt za postavljanje različitih CSS klasa za različita stanja.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Navodi hoće li tipka biti u stanju učitavanja. Ako je vrijednost postavljena na true, tipka će biti prikazana kao \"loading\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "Model vrijednost koja kontrolira stanje prekidača tipke. Ako je vrijednost postavljena na true, tipka je aktivirana (pressed=true), inače je tipka deaktivirana (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Navodi hoće li se standardno ponašanje funkcija za obradu događaja za tipku spriječiti.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Aktivira povjerenje u predani HTML niz i omogućuje njegovo prikazivanje u tipki",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Navodi sigurni HTML sadržaj za područje čitača ekrana. Možete koristiti niz, broj ili objekt za postavljanje različitih sadržaja za različita stanja.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Navodi hoće li se daljnje širenje događaja zaustaviti.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Navodi vrijednost tabindeksa za tipku. Tabindeks može biti broj ili niz.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Navodi HTML oznaku koja će se koristiti za prikazivanje tipke.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Definira tekst koji će se prikazati nakon teksta tipke.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Navodi hoće li tekst tipke biti označen kao aria-hidden=\"true\".\n",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Definira tekst koji će se prikazati prije teksta tipke.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Navodi CSS klasu koja će se primijeniti na tekst tipke.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Niz ili objekt koji sadrži tekst za različite uređaje. Koristite ključeve \"mobile\" i \"desktop\" za definiranje odgovarajućeg teksta za svaki uređaj.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Navodi tekst koji će se koristiti za čitače ekrana.",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Ovaj prop omogućuje prilagodbu HTML oznake u kojoj se renderira tekst unutar tipke",
  "_A_BUTTON_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Pruža objekt za postavljanje dodatnih HTML atributa za naslov elementa, omogućuje detaljnu prilagodbu njegovog ponašanja i stila.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Niz ili niz elemenata koji se spajaju u jedan naslov.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Pozicioniranje HTML naslova",
  "_A_BUTTON_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Postavlja z-indeks za naslov elementa, određuje redoslijed preklapanja u kontekstu drugih preklapajućih elemenata.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Navodi vrstu tipke. Dopuštene vrijednosti su \"button\", \"submit\" i \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot koji sadrži sadržaj koji će se prikazati nakon teksta u tipki.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot koji sadrži sadržaj koji će se prikazati prije teksta u tipki.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot koji sadrži HTML sadržaj koji će se koristiti kao naslov za tipku.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Zadani slot koji sadrži sadržaj za tipku."
}
