{
  "_A_BUTTON_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> è un pulsante versatile con configurazione estesa tramite props. Si integra con <a href=\"/#/element\">AElement</a> per il rendering, consentendo di configurare accessibilità, classi, identificatori, stati di caricamento e altri parametri. Supporta la personalizzazione dell'aspetto, del testo, delle icone e la gestione degli eventi come i clic, rendendolo uno strumento potente per la creazione di interfacce.",
  "_A_BUTTON_COMPONENT_NAME_": "Pulsante",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Si attiva quando si fa clic sul pulsante.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>QUESTO È IL MIO <strong>HTML-SUGGERIMENTO MAGICO!!!!</strong></div><div>Seconda riga</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>QUESTO È IL MIO <strong>HTML-SUGGERIMENTO MAGICO!!!!</strong></div><div>Seconda riga</div><div>Numero: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare un pulsante in stato disabilitato e impostare gli attributi di accessibilità appropriati. Per questo, è possibile utilizzare la proprietà \"<strong lang=\"en\">aria-disabled</strong>\" per indicare lo stato disabilitato. Ciò consente di utilizzare eventi come focus o hover, mentre il pulsante rimane disabilitato per i clic.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Pulsante disabilitato con <strong lang=\"en\">aria-disabled</strong>",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Esistono molte classi <strong lang=\"en\">CSS</strong> che possono essere utilizzate con il pulsante.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di utilizzare varie proprietà ed eventi complessi per configurare e gestire un pulsante con funzionalità avanzate. Nell'esempio seguente, vengono utilizzate diverse proprietà ed eventi per configurare il pulsante e gestire il suo stato di caricamento.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Utilizzo di proprietà ed eventi complessi",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di disabilitare un pulsante utilizzando la proprietà \"<strong lang=\"en\">disabled</strong>\". Ciò rende il pulsante non disponibile per l'interazione sia visivamente che funzionalmente.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Disabilitazione di un pulsante",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Raggruppa una serie di pulsanti in una singola riga.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Raggruppamento orizzontale dei pulsanti",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "È possibile raggruppare i pulsanti in una tabella.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Raggruppamento tabulare dei pulsanti",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Invece di applicare classi di dimensione del pulsante a ogni pulsante in un gruppo, aggiungi semplicemente <strong lang=\"en\">.a_btn_group_large</strong> o <strong lang=\"en\">.a_btn_group_small</strong> a ogni <strong lang=\"en\">.a_btn_group</strong>, incluso ogni gruppo annidato se hai più livelli.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Dimensione del gruppo di pulsanti",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Posiziona i pulsanti in una colonna verticale.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Raggruppamento verticale dei pulsanti",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare in modo sicuro contenuto <strong lang=\"en\">HTML</strong> senza fidarsi completamente di esso. Utilizzando la proprietà \"<strong lang=\"en\">html</strong>\" e la libreria <strong lang=\"en\">DomPurify</strong>, il contenuto <strong lang=\"en\">HTML</strong> trasmesso viene pulito e visualizzato in modo sicuro nel pulsante.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Visualizzazione sicura del contenuto <strong lang=\"en\">HTML</strong> utilizzando <strong lang=\"en\">DomPurify</strong>",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare icone a sinistra e a destra del pulsante utilizzando le proprietà \"<strong lang=\"en\">:icon-left</strong>\" e \"<strong lang=\"en\">:icon-right</strong>\". È possibile impostare diverse icone per diversi dispositivi per ottenere un aspetto personalizzabile.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Utilizzo delle proprietà delle icone",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare un pulsante in stato di caricamento con un indicatore di caricamento. È anche possibile impostare l'allineamento dell'indicatore di caricamento. Questo può essere utile per visualizzare un processo in background che richiede che l'utente attenda il completamento.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Pulsante in stato di caricamento e allineamento dell'indicatore di caricamento",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Hai bisogno di un pulsante, ma senza colori di sfondo vivaci? Sostituisci le classi di modificatori standard con classi <strong lang=\"en\">.a_btn_outline_*</strong> per rimuovere tutte le immagini e i colori di sfondo da qualsiasi pulsante.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Pulsanti con contorno",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di utilizzare contenuto <strong lang=\"en\">HTML</strong> sicuro come stringa all'interno del pulsante. Quando la proprietà \"<strong lang=\"en\">safe-html</strong>\" è abilitata e viene passata una stringa di contenuto <strong lang=\"en\">HTML</strong>, il contenuto <strong lang=\"en\">HTML</strong> trasmesso verrà trattato con fiducia e inserito direttamente tramite l'attributo <strong lang=\"en\">JavaScript</strong> \"<strong lang=\"en\">innerHTML</strong>\".",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Utilizzo di contenuto <strong lang=\"en\">HTML</strong> sicuro come stringa all'interno del pulsante",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Vuoi pulsanti grandi o piccoli? Aggiungi <strong lang=\"en\">.a_btn_large</strong> o <strong lang=\"en\">.a_btn_small</strong> per dimensioni aggiuntive.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Dimensioni dei pulsanti",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare contenuto aggiuntivo dopo il testo del pulsante utilizzando lo slot \"<strong lang=\"en\">buttonAppend</strong>\". Il contenuto inserito nello slot verrà visualizzato dopo il testo del pulsante.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonAppend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di posizionare contenuto personalizzato all'interno del pulsante utilizzando lo slot predefinito \"<strong lang=\"en\">:slots='default'</strong>\". Il contenuto inserito nello slot verrà visualizzato all'interno del pulsante.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Utilizzo dello slot predefinito",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare contenuto aggiuntivo prima del testo del pulsante utilizzando lo slot \"<strong lang=\"en\">buttonPrepend</strong>\". Il contenuto inserito nello slot verrà visualizzato prima del testo del pulsante.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonPrepend</strong>\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di definire contenuto <strong lang=\"en\">HTML</strong> personalizzato per il titolo del pulsante utilizzando lo slot \"<strong lang=\"en\">buttonTitle</strong>\" in combinazione con l'attributo \"<strong lang=\"en\">:is-title-html</strong>\". Il contenuto inserito nello slot verrà utilizzato come titolo <strong lang=\"en\">HTML</strong> per il pulsante.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Utilizzo dello slot \"<strong lang=\"en\">buttonTitle</strong>\" per il titolo <strong lang=\"en\">HTML</strong>",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "L'impostazione delle <strong lang=\"en\">props</strong> 'stop' su un valore booleano può essere utilizzata per controllare se un evento deve propagarsi o meno. L'esempio mostra due scenari diversi: uno con il valore 'stop' impostato su '<strong lang=\"en\">true</strong>' e l'altro impostato su '<strong lang=\"en\">false</strong>'.",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Utilizzo delle <strong lang=\"en\">props</strong> 'stop' per fermare la propagazione degli eventi",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di utilizzare un pulsante come interruttore con due stati (attivato/disattivato). Utilizzando gli attributi \"<strong lang=\"en\">:is-switch</strong>\" e \"<strong lang=\"en\">:model-switch</strong>\", è possibile abilitare la modalità interruttore e controllare lo stato del pulsante. Il pulsante viene renderizzato come un elemento \"<strong lang=\"en\">button</strong>\" con l'attributo \"<strong lang=\"en\">aria-pressed</strong>\" che indica lo stato.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Utilizzo della modalità pulsante-interruttore",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare testo aggiuntivo all'interno del pulsante. Questo può essere utile per aggiungere testo predefinito prima o dopo il testo principale del pulsante.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Testo aggiuntivo all'interno del pulsante",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di personalizzare il testo del pulsante per diversi dispositivi. Utilizzando l'attributo \"<strong lang=\"en\">:text</strong>\" come oggetto, è possibile impostare testo diverso per dispositivi mobili e desktop.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Personalizzazione del testo per diversi dispositivi",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "Questo esempio mostra come personalizzare il tag per il testo nel componente \"<strong lang=\"en\">AButton</strong>\" in <strong lang=\"en\">Vue.js</strong>. Per impostazione predefinita, il testo viene visualizzato in un tag <strong lang=\"en\">span</strong>. Tuttavia, utilizzando la proprietà <strong lang=\"en\">text-tag</strong>, il tag per il testo può essere personalizzato in modo flessibile per utilizzare vari tag <strong lang=\"en\">HTML</strong> come \"<strong lang=\"en\">strong</strong>\", \"<strong lang=\"en\">em</strong>\" o altri.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Modifica del tag di testo nel componente \"<strong lang=\"en\">AButton</strong>\"",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di combinare più titoli in un singolo attributo. Utilizzando l'attributo \"<strong lang=\"en\">:title</strong>\" come array, è possibile specificare più elementi che verranno combinati in un unico titolo per il pulsante.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Combinazione di titoli in un singolo attributo",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Il componente <strong lang=\"en\">AButton</strong> consente di visualizzare un titolo come <strong lang=\"en\">HTML</strong> e controllare il suo posizionamento. Utilizzando gli attributi \"<strong lang=\"en\">:is-title-html</strong>\", \"<strong lang=\"en\">:title</strong>\" e \"<strong lang=\"en\">:title-placement</strong>\", è possibile utilizzare un titolo <strong lang=\"en\">HTML</strong> e impostare la sua posizione.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualizzazione di un titolo <strong lang=\"en\">HTML</strong> con traduzione e parametri",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "Nell'esempio seguente, il titolo viene visualizzato come testo tradotto con un parametro. Il parametro <strong lang=\"en\">number</strong> viene passato tramite l'attributo <strong lang=\"en\">extra</strong>.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Visualizzazione di un titolo <strong lang=\"en\">HTML</strong> e il suo posizionamento",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Se hai bisogno di un pulsante che si armonizzi con lo sfondo invece di coprirlo, sostituisci le classi standard con classi <strong lang=\"en\">.a_btn_transparent*</strong>.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Pulsanti trasparenti",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Determina se il pulsante deve essere disabilitato. Se il valore è impostato su <strong lang=\"en\">true</strong>, il pulsante verrà visualizzato come disabilitato e verrà aggiunta la proprietà di accessibilità \"<strong lang=\"en\">aria-disabled</strong>\".",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Definisce un'etichetta <strong lang=\"en\">ARIA</strong> per il pulsante. È possibile utilizzare una stringa, un numero o un oggetto come valore per impostare l'etichetta desiderata.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Definisce attributi aggiuntivi per il pulsante. È possibile utilizzare un oggetto per impostare gli attributi necessari e i loro valori.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Definisce la classe di stile base per l'elemento, impostando lo stile visivo generale predefinito.",
  "_A_BUTTON_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Imposta la classe di stile per nascondere l'elemento, utilizzata per controllare la visibilità dell'elemento in vari contesti.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong>",
  "_A_BUTTON_PROPS_CLASS_DISABLED_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> che viene applicata al pulsante quando è disabilitato.",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Determina se il pulsante deve essere disabilitato. Se il valore è impostato su <strong lang=\"en\">true</strong>, il pulsante sarà disabilitato.",
  "_A_BUTTON_PROPS_EXTRA_DATA_DESCRIPTION_": "Fornisce dati aggiuntivi per tutti gli slot del componente, consentendo di passare dati e informazioni personalizzati che possono essere utilizzati all'interno degli slot per una personalizzazione più flessibile e dettagliata del contenuto.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Oggetto aggiuntivo per la traduzione",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Contenuto <strong lang=\"en\">HTML</strong> che deve essere visualizzato all'interno del pulsante.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Definisce il contenuto <strong lang=\"en\">HTML</strong> per lo screen reader del pulsante. È possibile utilizzare una stringa, un numero o un oggetto come valore per impostare il contenuto <strong lang=\"en\">HTML</strong> desiderato.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Definisce attributi aggiuntivi per le icone. È possibile utilizzare un oggetto per impostare gli attributi necessari e i loro valori per le icone.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Definisce una classe <strong lang=\"en\">CSS</strong> aggiuntiva per le icone.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Definisce un'icona a sinistra del pulsante. È possibile specificare un nome di icona come stringa o definire diverse icone per diversi dispositivi come oggetto.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Definisce un'icona a destra del pulsante. È possibile specificare un nome di icona come stringa o definire diverse icone per diversi dispositivi come oggetto.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Definisce un tag <strong lang=\"en\">HTML</strong> personalizzato per le icone.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Definisce un identificatore univoco per il pulsante. Se non viene specificato un identificatore, verrà generato automaticamente un identificatore univoco.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Determina se il pulsante deve essere utilizzato in modalità interruttore. Se il valore è impostato su <strong lang=\"en\">true</strong>, il pulsante verrà visualizzato come pulsante-interruttore.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Determina se il titolo deve essere interpretato come <strong lang=\"en\">HTML</strong>. Se il valore è impostato su <strong lang=\"en\">true</strong>, il titolo verrà visualizzato come <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Determina l'allineamento dell'indicatore di caricamento. È possibile specificare il valore \"<strong lang=\"en\">left</strong>\" o \"<strong lang=\"en\">right</strong>\".",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Definisce la classe <strong lang=\"en\">CSS</strong> per lo stato di caricamento del pulsante. È possibile specificare una stringa con una classe <strong lang=\"en\">CSS</strong> o utilizzare un oggetto per specificare diverse classi <strong lang=\"en\">CSS</strong> per diversi stati.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Determina se il pulsante è in stato di caricamento. Se il valore è impostato su <strong lang=\"en\">true</strong>, il pulsante verrà visualizzato come \"<strong lang=\"en\">loading</strong>\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "Il valore del modello che controlla lo stato dell'interruttore del pulsante. Se il valore è impostato su <strong lang=\"en\">true</strong>, il pulsante sarà attivato (<strong lang=\"en\">pressed=true</strong>), altrimenti il pulsante sarà disattivato (<strong lang=\"en\">pressed=false</strong>).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Determina se deve essere impedito il comportamento predefinito dei gestori di eventi per il pulsante (<strong lang=\"en\">preventDefault</strong>).",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Abilita la fiducia nella stringa <strong lang=\"en\">HTML</strong> passata e consente di visualizzarla all'interno del pulsante.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Definisce contenuto <strong lang=\"en\">HTML</strong> sicuro per l'area dello screen reader. È possibile specificare una stringa, un numero o un oggetto per impostare diversi contenuti per diversi stati.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Determina se deve essere fermata l'ulteriore propagazione dell'evento (<strong lang=\"en\">stopPropagation</strong>).",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Definisce il valore dell'indice di tabulazione (<strong lang=\"en\">tabindex</strong>) per il pulsante. L'indice di tabulazione può essere impostato come numero o stringa.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Definisce il tag <strong lang=\"en\">HTML</strong> che verrà utilizzato per visualizzare il pulsante.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Definisce il testo che deve essere visualizzato dopo il testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Determina se il testo del pulsante deve essere contrassegnato come <strong lang=\"en\">aria-hidden=\"true\"</strong>.",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Definisce il testo che deve essere visualizzato prima del testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Definisce la classe <strong lang=\"en\">CSS</strong> che verrà applicata al testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Stringa o oggetto contenente testo per diversi dispositivi. Utilizza le chiavi \"<strong lang=\"en\">mobile</strong>\" e \"<strong lang=\"en\">desktop</strong>\" per specificare il testo corrispondente per ciascun dispositivo.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Definisce il testo che verrà utilizzato per lo screen reader (<strong lang=\"en\">screen reader</strong>).",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Questo parametro consente di personalizzare il tag <strong lang=\"en\">HTML</strong> in cui viene visualizzato il testo all'interno del pulsante.",
  "_A_BUTTON_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Fornisce un oggetto per personalizzare attributi <strong lang=\"en\">HTML</strong> aggiuntivi per il titolo dell'elemento, consentendo di dettagliare il suo comportamento e stile.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Stringa o array di elementi che verranno combinati in un unico titolo.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Posizionamento del titolo <strong lang=\"en\">HTML</strong>.",
  "_A_BUTTON_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Imposta il <strong lang=\"en\">z-index</strong> per il titolo dell'elemento, determinando il suo ordine di sovrapposizione nel contesto di altri elementi sovrapposti.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Definisce il tipo di pulsante. I valori consentiti sono \"<strong lang=\"en\">button</strong>\", \"<strong lang=\"en\">submit</strong>\" e \"<strong lang=\"en\">reset</strong>\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Slot che contiene contenuto che deve essere visualizzato dopo il testo del pulsante.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Slot che contiene contenuto che deve essere visualizzato prima del testo del pulsante.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Slot che contiene contenuto <strong lang=\"en\">HTML</strong> che verrà utilizzato come titolo per il pulsante.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Slot predefinito che contiene contenuto per il pulsante."
}
