{
  "_A_CLOAK_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">ACloak</strong> visualizza un indicatore di caricamento con un testo che indica il caricamento corrente della pagina o di un grande componente. Supporta varie opzioni di personalizzazione, inclusi l'allineamento del testo, la dimensione dell'indicatore e la possibilità di cambiare il tag <strong lang=\"en\">HTML</strong> utilizzato per il rendering.",
  "_A_CLOAK_COMPONENT_NAME_": "Schermata di caricamento",
  "_A_CLOAK_GROUP_ALIGN_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">align</strong>. Permette di regolare l'allineamento del testo e dello spinner al centro, a sinistra o a destra. Ad esempio, il primo spinner è allineato a sinistra, il secondo al centro e il terzo a destra.",
  "_A_CLOAK_GROUP_ALIGN_HEADER_": "Allineamento del componente",
  "_A_CLOAK_GROUP_SIZES_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">size</strong> per gestire le dimensioni del testo e dell'indicatore di caricamento. I valori variano da <strong lang=\"en\">1</strong> (il più grande) a <strong lang=\"en\">7</strong> (il più piccolo).",
  "_A_CLOAK_GROUP_SIZES_HEADER_": "Dimensioni",
  "_A_CLOAK_GROUP_TEXT_ALIGN_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">text-align</strong>. Questa proprietà permette di allineare il testo che accompagna lo spinner di caricamento a sinistra o a destra. Nel primo esempio, il testo è allineato a sinistra, mentre nel secondo è allineato a destra.",
  "_A_CLOAK_GROUP_TEXT_ALIGN_HEADER_": "Allineamento del testo",
  "_A_CLOAK_GROUP_TEXT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">text</strong> e <strong lang=\"en\">extra</strong>. Il parametro <strong lang=\"en\">extra</strong> consente di modificare dinamicamente il testo. In questo caso, il testo visualizza il messaggio 'Caricamento 1', dove il numero <strong>{{ number }}</strong> viene estratto dall'oggetto <strong lang=\"en\">extra</strong> passato.",
  "_A_CLOAK_GROUP_TEXT_HEADER_": "Testo con il parametro <strong lang=\"en\">extra</strong>",
  "_A_CLOAK_PROPS_ALIGN_DESCRIPTION_": "Definisce l'allineamento del testo e dello spinner all'interno del componente. Valori possibili: <strong lang=\"en\">left</strong> (sinistra), <strong lang=\"en\">center</strong> (centro) e <strong lang=\"en\">right</strong> (destra).",
  "_A_CLOAK_PROPS_SIZE_DESCRIPTION_": "Definisce la dimensione del testo e dell'indicatore di caricamento. I valori validi vanno da <strong lang=\"en\">1</strong> (il più grande) a <strong lang=\"en\">7</strong> (il più piccolo).",
  "_A_CLOAK_PROPS_SPINNER_CLASS_DESCRIPTION_": "Classe <strong lang=\"en\">CSS</strong> per personalizzare l'aspetto dell'indicatore di caricamento.",
  "_A_CLOAK_PROPS_TAG_DESCRIPTION_": "Tag <strong lang=\"en\">HTML</strong> utilizzato per il rendering del componente.",
  "_A_CLOAK_PROPS_TEXT_ALIGN_DESCRIPTION_": "Definisce l'allineamento del testo rispetto allo spinner. Valori possibili: <strong lang=\"en\">left</strong> (sinistra) e <strong lang=\"en\">right</strong> (destra). Di default, il testo è allineato a destra.",
  "_A_CLOAK_PROPS_TEXT_DESCRIPTION_": "Testo che verrà visualizzato accanto all'indicatore di caricamento.",
  "_PAGE_CLOAK_TEXT_{{number}}_": "Caricamento {{ number }}"
}