{
  "_A_LINK_COMPONENT_DESCRIPTION_": "Die ALink-Komponente ist eine leistungsstarke Vue.js-Komponente, die benutzerdefinierte Stile und Funktionen für Links bereitstellt. Sie bietet eine einfache und flexible Möglichkeit, Links in Ihrer Vue.js-Anwendung zu erstellen und anzupassen.",
  "_A_LINK_COMPONENT_NAME_": "Link",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>DAS IST MEIN <strong>HTML-TOOLTIP!!!!</strong></div><div>Zweite Zeile</div><div>Dritte Zeile</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "Die ALink-Komponente ist eine Vue.js-Komponente, die benutzerdefinierte Stile für Links bereitstellt. Mit dieser Komponente können Sie verschiedene vordefinierte Klassen verwenden, um den Link-Stil basierend auf dem gewünschten Design anzupassen. Diese Flexibilität ermöglicht es Ihnen, Links nahtlos in Ihr Vue.js-Projekt zu integrieren und eine konsistente visuelle Ästhetik beizubehalten.",
  "_A_LINK_GROUP_CLASS_HEADER_": "Links mit individuellen Stilen",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, verschiedene komplexe Props zu verwenden, um den Link mit erweiterten Funktionen anzupassen und zu steuern. Im folgenden Beispiel werden mehrere Props verwendet, um den Link zu konfigurieren und das Laden zu steuern.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "Verwendung von komplexen Props",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "Mit der neuen Prop <strong>disabled</strong> können Sie Links deaktivieren, sodass sie nicht mehr anklickbar sind. Wenn der Link deaktiviert ist, wird er ohne href-Attribut gerendert. Zusätzlich wird der deaktivierte Link mit der Klasse <strong>disabled</strong> versehen.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "Deaktivierte Links",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "ALink ermöglicht die Gruppierung von Links für eine ansprechende Darstellung.",
  "_A_LINK_GROUP_GROUP_HEADER_": "Gruppierung",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Die Links können auch in einer tabellenähnlichen Struktur gruppiert werden.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Gruppierung in Tabellenform",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "Mit dieser Komponente können Sie Links in Gruppen anordnen und die Größe der Gruppen anpassen, um eine optimale Darstellung zu erzielen.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "Größenanpassung der Link-Gruppen",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Die Komponente ermöglicht die Komponente auch die <strong>vertikale</strong> Gruppierung von Links für eine ansprechende Darstellung.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "Vertikale Gruppierung",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, HTML-Inhalt sicher anzuzeigen, ohne ihm vollständig zu vertrauen. Durch Verwendung der Prop \"html\" und der DomPurify-Bibliothek wird der übergebene HTML-Inhalt gesäubert und sicher im Link dargestellt.",
  "_A_LINK_GROUP_HTML_HEADER_": "HTML-Inhalt sicher anzeigen mit Hilfe von DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "Mit den Props <strong>icon-left</strong> und <strong>icon-right</strong> können Sie jetzt auch Icons in den Links anzeigen lassen, um die visuelle Darstellung weiter anzupassen.",
  "_A_LINK_GROUP_ICONS_HEADER_": "Icons",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "Mit den Props <strong>loading</strong> und <strong>loading-align</strong> können Sie einen Spinner in verschiedenen Ausrichtungen innerhalb des Links anzeigen lassen, um anzuzeigen, dass der Link gerade lädt.",
  "_A_LINK_GROUP_LOADING_HEADER_": "Anzeige eines Spinners in verschiedenen Ausrichtungen",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "Diese Komponente bietet auch die Möglichkeit, Links mit einer Outline-Darstellung zu versehen, um einen besonderen visuellen Effekt zu erzielen.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "Outline-Optionen",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, sicheren HTML-Inhalt als String im Link zu verwenden. Durch die Aktivierung der Prop \"safe-html\" und die Übermittlung eines HTML-Strings wird der übergebene HTML-Inhalt vertrauenswürdig behandelt und direkt über das JavaScript-Attribut \"innerHTML\" eingefügt.",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "Sicherer HTML-Inhalt als String im Link verwenden",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "Die Komponente ermöglicht es Ihnen, Links mit vordefinierten Klassen zu gestalten und bietet Größenoptionen, um Ihren individuellen Designanforderungen gerecht zu werden.",
  "_A_LINK_GROUP_SIZES_HEADER_": "Größenoptionen",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, zusätzlichen Inhalt nach dem Text im Link anzuzeigen, indem Sie den Slot \"linkAppend\" verwenden. Der Inhalt, der im Slot platziert wird, wird nach dem Text im Link angezeigt.\n\n",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "Verwendung des Slots \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, benutzerdefinierten Inhalt im Link zu platzieren, indem Sie den Standard-Slot \"default\" verwenden. Der Inhalt, der im Slot platziert wird, wird im Link angezeigt.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "Verwendung des Standard-Slots",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, zusätzlichen Inhalt vor dem Text im Link anzuzeigen, indem Sie den Slot \"linkPrepend\" verwenden. Der Inhalt, der im Slot platziert wird, wird vor dem Text im Link angezeigt.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "Verwendung des Slots \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, benutzerdefinierten HTML-Inhalt für den Titel des Links zu definieren, indem Sie den Slot \"linkTitle\" zusammen mit der Prop \":is-title-html\" verwenden. Der Inhalt, der im Slot platziert wird, wird als HTML-Titel für den Link verwendet.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "Verwendung des Slots \"linkTitle\" für HTML-Titel",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Mit den Props <strong>text-before</strong> und <strong>text-after</strong> können Sie zusätzlichen Text innerhalb des Links anzeigen lassen.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Anzeige von zusätzlichem Text vor und nach dem Link-Text innerhalb des Links",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "Die Alink-Komponente ermöglicht es Ihnen, den Text des Links für verschiedene Geräte anzupassen. Durch Verwendung der Prop \":text\" als Objekt können Sie unterschiedlichen Text für mobile und Desktop-Geräte definieren.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "Anpassbarer Text für verschiedene Geräte",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie das Text-Tag in der \"ALink\"-Komponente in Vue.js angepasst werden kann. Standardmäßig wird der Text in einem \"span\"-Tag gerendert. Durch die Verwendung der \"text-tag\"-Prop kann das Text-Tag jedoch flexibel angepasst werden, um verschiedene HTML-Tags wie \"strong\", \"em\" oder andere zu verwenden.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "Anpassung des Text-Tags in der \"ALink\"-Komponente",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, mehrere Titel in einer Prop zu konkatenieren. Durch Verwendung der Prop \":title\" als Array können Sie mehrere Elemente angeben, die zu einem einzigen Titel für den Link zusammengeführt werden.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "Konkatenieren von Titeln in einer Prop",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "Die ALink-Komponente ermöglicht es Ihnen, den Titel als HTML anzuzeigen und die Titelplatzierung zu steuern. Durch Verwendung der Props \":is-title-html\", \":title\" und \":title-placement\" können Sie HTML-Titel verwenden und die Positionierung des Titels festlegen.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "Anzeige von HTML-Titel und Titelplatzierung",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "Vordefinierte Klassen für Transparenz können verwendet werden, um Links in den Hintergrund einzublenden.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "Transparent-Optionen",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "Gibt zusätzliche Attribute für den Link an. Sie können ein Objekt verwenden, um die gewünschten Attribute und deren Werte festzulegen.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Definiert die Basis-CSS-Klasse für das Element, indem ein allgemeiner visueller Standardstil festgelegt wird.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Legt eine CSS-Klasse fest, um das Element zu verbergen, wird verwendet, um die Sichtbarkeit des Elements in verschiedenen Kontexten zu steuern.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "Diese Prop ermöglicht es Ihnen, benutzerdefinierte Klassen für die Link-Stile anzugeben.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "Gibt die CSS-Klasse an, die auf den Link angewendet wird, wenn dieser deaktiviert ist.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "Diese Prop ermöglicht es Ihnen, den Link zu deaktivieren. Wenn disabled auf true gesetzt ist, wird der Link ohne href-Attribut gerendert und die zusätzliche Klasse 'disabled' wird hinzugefügt",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "Extra-Objekt für Übersetzung",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "Href-Attribut für den Link",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "Der zu sichernde HTML-Inhalt, der im Button angezeigt werden soll",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Gibt das HTML für den Screenreader-Inhalt des Links an. Sie können einen String, eine Zahl oder ein Objekt als Wert verwenden, um den gewünschten HTML-Inhalt festzulegen.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Gibt zusätzliche Attribute für die Icons an. Sie können ein Objekt verwenden, um die gewünschten Attribute und deren Werte für die Icons festzulegen.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "Gibt eine zusätzliche CSS-Klasse für die Icons an.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "Ein Icon auf der linken Seite des Links",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "Ein Icon auf der rechten Seite des Links",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "Gibt das benutzerdefinierte HTML-Tag für die Icons an.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "Gibt eine eindeutige ID für den Link an. Wenn keine ID angegeben wird, wird automatisch eine eindeutige ID generiert.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Gibt an, ob der Titel als HTML interpretiert werden soll. Wenn der Wert auf true gesetzt ist, wird der Titel als HTML gerendert.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "Diese Prop ermöglicht es Ihnen, die Ausrichtung des Spinners innerhalb des Links festzulegen. Sie können entweder \"right\" (rechts) oder \"left\" (links) als Wert verwenden.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "Mit dieser Prop können Sie die CSS-Klasse für den Spinner angeben.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "Mit dieser Prop können Sie angeben, ob der Link gerade lädt. Wenn loading auf true gesetzt ist, wird ein Spinner innerhalb des Links angezeigt.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "Aktiviert das Vertrauen in den übergebenen HTML-String und ermöglicht dessen Darstellung im Button",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Gibt den sicheren HTML-Inhalt für den Screenreader-Bereich an. Sie können entweder einen String, eine Zahl oder ein Objekt verwenden, um verschiedene Inhalte für verschiedene Zustände anzugeben.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "Target-Attribut für den Link",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "Diese Prop ermöglicht es Ihnen, zusätzlichen Text nach dem Link-Text innerhalb des Links anzuzeigen.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Gibt an, ob der Text des Links als aria-hidden=\"true\" markiert werden soll.",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "Diese Prop ermöglicht es Ihnen, zusätzlichen Text vor dem Link-Text innerhalb des Links anzuzeigen.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "Gibt die CSS-Klasse an, die auf den Text des Links angewendet werden soll.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "Ein String oder ein Objekt, das den Text für verschiedene Geräte enthält. Verwenden Sie die Schlüssel \"mobile\" und \"desktop\", um den entsprechenden Text für jedes Gerät anzugeben.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Gibt den Text an, der für Screenreader verwendet werden soll.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "Diese Prop ermöglicht die Anpassung des HTML-Tags, in dem der Text innerhalb des Links gerendert wird",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Bietet ein Objekt zur Einstellung zusätzlicher HTML-Attribute für den Titel des Elements, ermöglicht eine detaillierte Anpassung seines Verhaltens und Stils.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "Ein String, ein Objekt, oder ein Array von Elementen, die zu einem einzigen Titel konkateniert werden.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Die Positionierung des HTML-Titels",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Setzt \"z-index\" für den Titel des Elements, bestimmt seine Überlagerungsreihenfolge im Kontext anderer überlappender Elemente.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "To-Attribut für RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "Der Standard-Slot, der den Inhalt für den Link enthält.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "Der Slot, der den Inhalt enthält, der nach dem Text im Link angezeigt werden soll.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "Der Slot, der den Inhalt enthält, der vor dem Text im Link angezeigt werden soll.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "Der Slot, der den HTML-Inhalt enthält, der als Titel für den Link verwendet werden soll."
}
