{
  "_A_LINK_COMPONENT_DESCRIPTION_": "Компонент ALink - это мощный компонент Vue.js, предоставляющий пользовательские стили и функции для ссылок. Он предлагает простой и гибкий способ создания и настройки ссылок в вашем приложении Vue.js.",
  "_A_LINK_COMPONENT_NAME_": "Ссылка",
  "_A_LINK_EXAMPLE_BIG_TITLE_": "<div>ЭТО МОЙ <strong>HTML-ЗАГОЛОВОК!!!!</strong></div><div>Вторая строка</div><div>Третья строка</div>",
  "_A_LINK_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_LINK_GROUP_CLASS_DESCRIPTION_": "Компонент ALink - это компонент Vue.js, предоставляющий пользовательские стили для ссылок. С этим компонентом вы можете использовать различные предопределенные классы, чтобы настроить стиль ссылок в зависимости от желаемого дизайна. Эта гибкость позволяет вам бесшовно интегрировать ссылки в ваш проект Vue.js и поддерживать согласованную визуальную эстетику.",
  "_A_LINK_GROUP_CLASS_HEADER_": "Ссылки с индивидуальными стилями",
  "_A_LINK_GROUP_COMPLEX_DESCRIPTION_": "Компонент ALink позволяет использовать различные сложные свойства для настройки и управления ссылками с расширенными функциями. В следующем примере используются несколько свойств для конфигурирования ссылки и управления загрузкой.",
  "_A_LINK_GROUP_COMPLEX_HEADER_": "Использование сложных свойств",
  "_A_LINK_GROUP_DISABLED_DESCRIPTION_": "С новым свойством <strong>disabled</strong> вы можете деактивировать ссылки, чтобы они не были кликабельными. Когда ссылка деактивирована, она рендерится без атрибута href. Дополнительно деактивированная ссылка получает класс <strong>disabled</strong>.",
  "_A_LINK_GROUP_DISABLED_HEADER_": "Деактивированные ссылки",
  "_A_LINK_GROUP_GROUP_DESCRIPTION_": "ALink позволяет группировать ссылки для привлекательного отображения.",
  "_A_LINK_GROUP_GROUP_HEADER_": "Группировка",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Ссылки также могут быть сгруппированы в табличной форме.",
  "_A_LINK_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Группировка в табличной форме",
  "_A_LINK_GROUP_GROUP_SIZES_DESCRIPTION_": "С этим компонентом вы можете организовывать ссылки в группы и настраивать размер групп для оптимального отображения.",
  "_A_LINK_GROUP_GROUP_SIZES_HEADER_": "Настройка размеров групп ссылок",
  "_A_LINK_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Компонент также позволяет <strong>вертикальную</strong> группировку ссылок для привлекательного отображения.",
  "_A_LINK_GROUP_GROUP_VERTICAL_HEADER_": "Вертикальная группировка",
  "_A_LINK_GROUP_HTML_DESCRIPTION_": "Компонент ALink позволяет безопасно отображать HTML-содержимое, не полагаясь на него полностью. Используя свойство \"html\" и библиотеку DomPurify, переданное HTML-содержимое очищается и безопасно отображается в ссылке.",
  "_A_LINK_GROUP_HTML_HEADER_": "Безопасное отображение HTML-содержимого с помощью DomPurify",
  "_A_LINK_GROUP_ICONS_DESCRIPTION_": "С свойствами <strong>icon-left</strong> и <strong>icon-right</strong> вы можете отображать иконки в ссылках для дальнейшей настройки визуального отображения.",
  "_A_LINK_GROUP_ICONS_HEADER_": "Иконки",
  "_A_LINK_GROUP_LOADING_DESCRIPTION_": "С свойствами <strong>loading</strong> и <strong>loading-align</strong> вы можете отображать спиннер в различных положениях внутри ссылки, чтобы показать, что ссылка загружается.",
  "_A_LINK_GROUP_LOADING_HEADER_": "Отображение спиннера в различных положениях",
  "_A_LINK_GROUP_OUTLINE_DESCRIPTION_": "Этот компонент также предоставляет возможность оформления ссылок с помощью контура для создания особого визуального эффекта.",
  "_A_LINK_GROUP_OUTLINE_HEADER_": "Опции контура",
  "_A_LINK_GROUP_SAFE_HTML_DESCRIPTION_": "Компонент ALink позволяет использовать безопасное HTML-содержимое в виде строки в ссылке. Включив свойство \"safe-html\" и передав HTML-строку, переданное HTML-содержимое будет доверительно обработано и вставлено напрямую через атрибут JavaScript \"innerHTML\".",
  "_A_LINK_GROUP_SAFE_HTML_HEADER_": "Использование безопасного HTML-содержимого в виде строки в ссылке",
  "_A_LINK_GROUP_SIZES_DESCRIPTION_": "Компонент позволяет стилизовать ссылки с предопределенными классами и предоставляет опции размеров для удовлетворения ваших индивидуальных требований к дизайну.",
  "_A_LINK_GROUP_SIZES_HEADER_": "Опции размеров",
  "_A_LINK_GROUP_SLOT_APPEND_DESCRIPTION_": "Компонент ALink позволяет отображать дополнительное содержимое после текста в ссылке, используя слот \"linkAppend\". Содержимое, помещенное в слот, будет отображено после текста в ссылке.",
  "_A_LINK_GROUP_SLOT_APPEND_HEADER_": "Использование слота \"linkAppend\"",
  "_A_LINK_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Компонент ALink позволяет помещать пользовательское содержимое в ссылку, используя стандартный слот \"default\". Содержимое, помещенное в слот, будет отображено в ссылке.",
  "_A_LINK_GROUP_SLOT_DEFAULT_HEADER_": "Использование стандартного слота",
  "_A_LINK_GROUP_SLOT_PREPEND_DESCRIPTION_": "Компонент ALink позволяет отображать дополнительное содержимое перед текстом в ссылке, используя слот \"linkPrepend\". Содержимое, помещенное в слот, будет отображено перед текстом в ссылке.",
  "_A_LINK_GROUP_SLOT_PREPEND_HEADER_": "Использование слота \"linkPrepend\"",
  "_A_LINK_GROUP_SLOT_TITLE_DESCRIPTION_": "Компонент ALink позволяет определять пользовательское HTML-содержимое для заголовка ссылки, используя слот \"linkTitle\" вместе со свойством \":is-title-html\". Содержимое, помещенное в слот, будет использовано как HTML-заголовок для ссылки.",
  "_A_LINK_GROUP_SLOT_TITLE_HEADER_": "Использование слота \"linkTitle\" для HTML-заголовков",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "С свойствами <strong>text-before</strong> и <strong>text-after</strong> вы можете отображать дополнительный текст внутри ссылки.",
  "_A_LINK_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Отображение дополнительного текста до и после текста ссылки внутри ссылки",
  "_A_LINK_GROUP_TEXT_OBJECT_DESCRIPTION_": "Компонент ALink позволяет адаптировать текст ссылки для различных устройств. Используя свойство \":text\" в виде объекта, вы можете определить различный текст для мобильных и настольных устройств.",
  "_A_LINK_GROUP_TEXT_OBJECT_HEADER_": "Адаптируемый текст для различных устройств",
  "_A_LINK_GROUP_TEXT_TAG_DESCRIPTION_": "В этом примере показано, как настроить тег текста в компоненте \"ALink\" в Vue.js. По умолчанию текст рендерится в теге \"span\". Используя свойство \"text-tag\", тег текста можно гибко настроить для использования различных HTML-тегов, таких как \"strong\", \"em\" или другие.",
  "_A_LINK_GROUP_TEXT_TAG_HEADER_": "Настройка тега текста в компоненте \"ALink\"",
  "_A_LINK_GROUP_TITLE_ARRAY_DESCRIPTION_": "Компонент ALink позволяет конкатенировать несколько заголовков в одно свойство. Используя свойство \":title\" в виде массива, вы можете указать несколько элементов, которые будут объединены в один заголовок для ссылки.",
  "_A_LINK_GROUP_TITLE_ARRAY_HEADER_": "Конкатенация заголовков в одно свойство",
  "_A_LINK_GROUP_TITLE_HTML_DESCRIPTION_": "Компонент ALink позволяет отображать заголовок в виде HTML и управлять его размещением. Используя свойства \":is-title-html\", \":title\" и \":title-placement\", вы можете использовать HTML-заголовки и задавать их положение.",
  "_A_LINK_GROUP_TITLE_HTML_HEADER_": "Отображение HTML-заголовков и управление их размещением",
  "_A_LINK_GROUP_TRANSPARENT_DESCRIPTION_": "Предопределенные классы прозрачности могут использоваться для создания ссылок, сливающихся с фоном.",
  "_A_LINK_GROUP_TRANSPARENT_HEADER_": "Опции прозрачности",
  "_A_LINK_PROPS_ATTRIBUTES_DESCRIPTION_": "Указывает дополнительные атрибуты для ссылки. Вы можете использовать объект для указания нужных атрибутов и их значений.",
  "_A_LINK_PROPS_CLASS_DEFAULT_DESCRIPTION_": "Определяет базовый CSS-класс для элемента, устанавливая общий визуальный стандартный стиль.",
  "_A_LINK_PROPS_CLASS_DEFAULT_HIDDEN_DESCRIPTION_": "Устанавливает CSS-класс для скрытия элемента, используется для управления видимостью элемента в различных контекстах.",
  "_A_LINK_PROPS_CLASS_DESCRIPTION_": "Это свойство позволяет указать пользовательские классы для стилей ссылок.",
  "_A_LINK_PROPS_CLASS_DISABLED_DESCRIPTION_": "Указывает CSS-класс, который применяется к ссылке, когда она отключена.",
  "_A_LINK_PROPS_DISABLED_DESCRIPTION_": "Это свойство позволяет отключить ссылку. Если disabled установлено в true, ссылка рендерится без атрибута href, и к ней добавляется дополнительный класс 'disabled'.",
  "_A_LINK_PROPS_EXTRA_DESCRIPTION_": "Дополнительный объект для перевода",
  "_A_LINK_PROPS_HREF_DESCRIPTION_": "Атрибут href для ссылки",
  "_A_LINK_PROPS_HTML_DESCRIPTION_": "HTML-содержимое, которое нужно безопасно отображать в кнопке",
  "_A_LINK_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Указывает HTML для содержимого ссылки, предназначенного для скринридера. Вы можете использовать строку, число или объект для указания нужного HTML-содержимого.",
  "_A_LINK_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Указывает дополнительные атрибуты для иконок. Вы можете использовать объект для указания нужных атрибутов и их значений для иконок.",
  "_A_LINK_PROPS_ICON_CLASS_DESCRIPTION_": "Указывает дополнительный CSS-класс для иконок.",
  "_A_LINK_PROPS_ICON_LEFT_DESCRIPTION_": "Иконка слева от ссылки",
  "_A_LINK_PROPS_ICON_RIGHT_DESCRIPTION_": "Иконка справа от ссылки",
  "_A_LINK_PROPS_ICON_TAG_DESCRIPTION_": "Указывает настраиваемый HTML-тег для иконок.",
  "_A_LINK_PROPS_ID_DESCRIPTION_": "Указывает уникальный идентификатор для ссылки. Если идентификатор не указан, автоматически генерируется уникальный идентификатор.",
  "_A_LINK_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Указывает, должен ли заголовок интерпретироваться как HTML. Если значение установлено в true, заголовок рендерится как HTML.",
  "_A_LINK_PROPS_LOADING_ALIGN_DESCRIPTION_": "Это свойство позволяет задать выравнивание спиннера внутри ссылки. Вы можете использовать \"right\" (справа) или \"left\" (слева) в качестве значения.",
  "_A_LINK_PROPS_LOADING_CLASS_DESCRIPTION_": "С помощью этого свойства можно указать CSS-класс для спиннера.",
  "_A_LINK_PROPS_LOADING_DESCRIPTION_": "С помощью этого свойства можно указать, загружается ли ссылка в данный момент. Если значение loading установлено в true, внутри ссылки отображается спиннер.",
  "_A_LINK_PROPS_SAFE_HTML_DESCRIPTION_": "Этот пропс будет рендериться как HTML без преобразования.",
  "_A_LINK_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Указывает безопасное HTML-содержимое для области скринридера. Вы можете использовать строку, число или объект для указания различных содержаний для различных состояний.",
  "_A_LINK_PROPS_TARGET_DESCRIPTION_": "Атрибут target для ссылки",
  "_A_LINK_PROPS_TEXT_AFTER_DESCRIPTION_": "Это свойство позволяет отображать дополнительный текст после текста ссылки внутри ссылки.",
  "_A_LINK_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Указывает, должен ли текст ссылки быть помечен как aria-hidden=\"true\".",
  "_A_LINK_PROPS_TEXT_BEFORE_DESCRIPTION_": "Это свойство позволяет отображать дополнительный текст перед текстом ссылки внутри ссылки.",
  "_A_LINK_PROPS_TEXT_CLASS_DESCRIPTION_": "Указывает CSS-класс, который будет применен к тексту ссылки.",
  "_A_LINK_PROPS_TEXT_DESCRIPTION_": "Строка или объект, содержащий текст для различных устройств. Используйте ключи \"mobile\" и \"desktop\", чтобы указать соответствующий текст для каждого устройства.",
  "_A_LINK_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Указывает текст, который будет использоваться для скринридера.",
  "_A_LINK_PROPS_TEXT_TAG_DESCRIPTION_": "Это свойство позволяет настроить HTML-тег, внутри которого рендерится текст внутри ссылки.",
  "_A_LINK_PROPS_TITLE_ATTRIBUTES_DESCRIPTION_": "Предоставляет объект для установки дополнительных HTML-атрибутов для заголовка элемента, что позволяет детально настроить его поведение и стиль.",
  "_A_LINK_PROPS_TITLE_DESCRIPTION_": "Строка, объект или массив элементов, которые объединяются в один заголовок.",
  "_A_LINK_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Расположение HTML-заголовка",
  "_A_LINK_PROPS_TITLE_Z_INDEX_DESCRIPTION_": "Устанавливает \"z-index\" для заголовка элемента, определяя его порядок наложения в контексте других перекрывающихся элементов.",
  "_A_LINK_PROPS_TO_DESCRIPTION_": "Атрибут to для RouterLink",
  "_A_LINK_SLOT_DEFAULT_DESCRIPTION_": "Стандартный слот, содержащий содержимое для ссылки.",
  "_A_LINK_SLOT_LINK_APPEND_DESCRIPTION_": "Слот, содержащий содержимое, которое отображается после текста в ссылке.",
  "_A_LINK_SLOT_LINK_PREPEND_DESCRIPTION_": "Слот, содержащий содержимое, которое отображается перед текстом в ссылке.",
  "_A_LINK_SLOT_LINK_TITLE_DESCRIPTION_": "Слот, содержащий HTML-содержимое, используемое в качестве заголовка для ссылки."
}