{
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Der Wert oder das JavaScript-Objekt, das in eine JSON-Zeichenkette umgewandelt werden soll",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Eine Funktion, die das Verhalten des Umwandlungsprozesses beeinflusst, oder ein Array aus Zeichenketten und Zahlen, das Eigenschaften von value angibt, die in der Ausgabe enthalten sein sollen. Wenn <strong>replacer</strong> ein Array ist, werden alle Elemente in diesem Array, die keine Zeichenketten oder Zahlen sind (weder primitive Werte noch Wrapper-Objekte), einschließlich Symbol-Werte, vollständig ignoriert. Wenn <strong>replacer</strong> alles außer einer Funktion oder einem Array ist (z. B. null oder nicht angegeben), werden alle zeichenkettenbasierten Eigenschaften des Objekts in der resultierenden JSON-Zeichenkette aufgenommen",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Eine Zeichenkette oder eine Zahl, die für die Einfügung von Leerzeichen (einschließlich Einrückung, Zeilenumbruchzeichen usw.) in die Ausgabe-JSON-Zeichenkette zu Lesbarkeitszwecken verwendet wird. Wenn dies eine Zahl ist, gibt sie die Anzahl der Leerzeichen oder anderer Zeichen an, die als Einrückung verwendet werden sollen, auf maximal 10 begrenzt (dh jede Zahl größer als 10 wird so behandelt, als wäre sie 10). Werte kleiner als 1 zeigen an, dass kein Leerzeichen verwendet werden soll. Wenn dies eine Zeichenkette ist, wird die Zeichenkette (oder die ersten 10 Zeichen der Zeichenkette, wenn sie länger ist als das) vor jedem verschachtelten Objekt oder Array eingefügt. Wenn <strong>space</strong> alles außer einer Zeichenkette oder Zahl ist (kann entweder ein Primitiv oder ein Wrapper-Objekt sein) — z. B. null oder nicht angegeben — wird kein Leerzeichen verwendet",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "Die Funktion <strong>filterJson</strong> konvertiert ein JavaScript-Objekt oder einen Wert in eine formatierte JSON-Zeichenkette. Sie ermöglicht die <strong>replacer</strong> Anpassung (Funktion zum Verändern des Verhaltens der Umwandlung) und des Einzugs (Anzahl der Leerzeichen oder andere Zeichen für die Einrückung)."
}
