{
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Der Wert oder das JavaScript-Objekt, das in eine JSON-Zeichenkette umgewandelt werden soll",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Eine Funktion, die das Verhalten des Umwandlungsprozesses beeinflusst, oder ein Array aus Zeichenketten und Zahlen, das Eigenschaften von value angibt, die in der Ausgabe enthalten sein sollen. Wenn replacer ein Array ist, werden alle Elemente in diesem Array, die keine Zeichenketten oder Zahlen sind (weder primitive Werte noch Wrapper-Objekte), einschließlich Symbol-Werte, vollständig ignoriert. Wenn replacer alles außer einer Funktion oder einem Array ist (z. B. null oder nicht angegeben), werden alle zeichenkettenbasierten Eigenschaften des Objekts in der resultierenden JSON-Zeichenkette aufgenommen",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Eine Zeichenkette oder eine Zahl, die für die Einfügung von Leerzeichen (einschließlich Einrückung, Zeilenumbruchzeichen usw.) in die Ausgabe-JSON-Zeichenkette zu Lesbarkeitszwecken verwendet wird. Wenn dies eine Zahl ist, gibt sie die Anzahl der Leerzeichen oder anderer Zeichen an, die als Einrückung verwendet werden sollen, auf maximal 10 begrenzt (dh jede Zahl größer als 10 wird so behandelt, als wäre sie 10). Werte kleiner als 1 zeigen an, dass kein Leerzeichen verwendet werden soll. Wenn dies eine Zeichenkette ist, wird die Zeichenkette (oder die ersten 10 Zeichen der Zeichenkette, wenn sie länger ist als das) vor jedem verschachtelten Objekt oder Array eingefügt. Wenn space alles außer einer Zeichenkette oder Zahl ist (kann entweder ein Primitiv oder ein Wrapper-Objekt sein) — z. B. null oder nicht angegeben — wird kein Leerzeichen verwendet",
  "_PAGE_FILTER_JSON_ARGUMENTS_": "# Arguments:  \nvalue (Any): The value or JavaScript object that should be converted into a JSON string\n[replacer] (Function | Array): A function that influences the behavior of the conversion process, or an array of strings and numbers specifying properties of value that should be included in the output. If replacer is an array, all elements in this array that are not strings or numbers (neither primitive values nor wrapper objects), including symbol values, are completely ignored. If replacer is anything other than a function or an array (e.g. null or not specified), all string-based properties of the object are included in the resulting JSON string.\n[space=2] (Number | String): A string or number used for inserting spaces (including indentation, line break characters, etc.) into the output JSON string for readability purposes. If this is a number, it indicates the number of spaces or other characters to be used as indentation, limited to a maximum of 10 (i.e., any number greater than 10 is treated as if it were 10). Values less than 1 indicate that no space should be used. If this is a string, the string (or the first 10 characters of the string, if it is longer than that) is inserted before each nested object or array. If space is anything other than a string or number (can be either a primitive or a wrapper object) — e.g., null or not specified — no space is used.",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "The function <strong>filterJson</strong> converts a JavaScript object or value into a formatted JSON string. It allows customization of the replacer (a function to alter the behavior of the conversion) and the indent (number of spaces or other characters for indentation)."
}
