{
  "_PAGE_FILTER_JSON_ARGUMENTS_IS_HTML_": "Détermine si la sortie doit être formatée en HTML. Lorsqu'il est défini sur false, la sortie est renvoyée sous forme de chaîne de texte brut.",
  "_PAGE_FILTER_JSON_ARGUMENTS_JSON_CLASS_": "La classe CSS qui sera appliquée lorsque `isHtml` est défini sur true.",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Une fonction qui influe sur le comportement du processus de conversion, ou un tableau de chaînes et de nombres qui spécifie les propriétés de la valeur à inclure dans le résultat. Si <strong>replacer</strong> est un tableau, tous les éléments de ce tableau qui ne sont pas des chaînes ou des nombres (ni des valeurs primitives ni des objets enveloppants), y compris les valeurs de symboles, sont complètement ignorés. Si <strong>replacer</strong> est autre chose qu'une fonction ou un tableau (par exemple, null ou non spécifié), toutes les propriétés basées sur des chaînes de l'objet sont incluses dans la chaîne JSON résultante",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Une chaîne ou un nombre utilisé pour insérer des espaces blancs (y compris l'indentation, les caractères de saut de ligne, etc.) dans la chaîne JSON de sortie à des fins de lisibilité. Si c'est un nombre, il indique le nombre d'espaces ou d'autres caractères à utiliser comme indentation, limité à un maximum de 10 (c'est-à-dire, tout nombre supérieur à 10 est traité comme s'il était 10). Les valeurs inférieures à 1 indiquent qu'aucun espace blanc ne doit être utilisé. Si c'est une chaîne, la chaîne (ou les 10 premiers caractères de la chaîne si elle est plus longue que cela) est insérée avant chaque objet ou tableau imbriqué. Si <strong>space</strong> est autre chose qu'une chaîne ou un nombre (peut être soit un primitif soit un objet enveloppant) — par exemple, null ou non spécifié — aucun espace blanc n'est utilisé",
  "_PAGE_FILTER_JSON_ARGUMENTS_TAG_": "La balise HTML qui enveloppe la chaîne JSON formatée lorsque `isHtml` est défini sur true.",
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "La valeur ou l'objet JavaScript à convertir en chaîne JSON",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "La fonction <strong>filterJson</strong> convertit un objet ou une valeur JavaScript en une chaîne JSON formatée. Elle permet la personnalisation du <strong>replacer</strong> (fonction pour modifier le comportement de la conversion) et de l'indentation (nombre d'espaces ou d'autres caractères pour l'indentation)."
}
