{
  "_PAGE_FILTER_JSON_ARGUMENTS_IS_HTML_": "Определяет, должна ли выходная информация форматироваться как HTML. Если установлено значение false, вывод будет возвращен в виде обычной текстовой строки.",
  "_PAGE_FILTER_JSON_ARGUMENTS_JSON_CLASS_": "CSS-класс, который будет применяться, если `isHtml` установлен в true.",
  "_PAGE_FILTER_JSON_ARGUMENTS_REPLACER_": "Функция, изменяющая поведение процесса преобразования, или массив строк и чисел, указывающий свойства значения, которые следует включить в вывод. Если <strong>replacer</strong> - это массив, все элементы в этом массиве, не являющиеся строками или числами (примитивами или оберточными объектами), включая символьные значения, полностью игнорируются. Если <strong>replacer</strong> - это что-то, кроме функции или массива (например, null или не предоставлен), в результирующую строку JSON включаются все свойства объекта с ключами-строками",
  "_PAGE_FILTER_JSON_ARGUMENTS_SPACE_": "Строка или число, используемые для вставки пробелов (включая отступ, символы перевода строки и т. д.) в выходную строку JSON в целях улучшения читаемости. Если это число, оно указывает количество пробелов или других символов для отступа, ограниченное 10 (т. е. любое число больше 10 рассматривается, как если бы оно было 10). Значения меньше 1 указывают на то, что пробелы не должны использоваться. Если это строка, строка (или первые 10 символов строки, если она длиннее) вставляется перед каждым вложенным объектом или массивом. Если <strong>space</strong> что-то, кроме строки или числа (может быть как примитивом, так и оберточным объектом) — например, null или не предоставлено — пробелы не используются",
  "_PAGE_FILTER_JSON_ARGUMENTS_TAG_": "HTML-тег, который оборачивает форматированную JSON-строку, если `isHtml` установлен в true.",
  "_PAGE_FILTER_JSON_ARGUMENTS_VALUE_": "Значение или объект JavaScript, который следует преобразовать в строку JSON",
  "_PAGE_FILTER_JSON_DESCRIPTION_": "Функция <strong>filterJson</strong> преобразует объект JavaScript или значение в форматированную строку JSON. Она позволяет настраивать <strong>replacer</strong> (функцию для изменения поведения процесса преобразования) и отступ (количество пробелов или других символов для отступа)."
}
