{
  "_A_DISCLOSURE_COMPONENT_DESCRIPTION_": "Die Komponente ermöglicht es Benutzern, Textinhalte anzuzeigen oder auszublenden, indem sie auf einen Button klicken. Der Button wechselt zwischen \"Mehr anzeigen\" und \"Weniger anzeigen\", abhängig davon, ob der vollständige Textinhalt bereits angezeigt wird oder nicht.",
  "_A_DISCLOSURE_COMPONENT_NAME_": "Inhalt anzeigen/ausblenden",
  "_A_DISCLOSURE_EXPOSES_BUTTON_REF_DESCRIPTION_": "Ein Ref-Objekt, das auf das DOM-Element des \"Mehr anzeigen/Weniger anzeigen\"-Buttons in der Komponente zeigt. Dies ermöglicht es Ihnen, das Button-Element direkt zu manipulieren oder auf Ereignisse wie Klicks zuzugreifen.",
  "_A_DISCLOSURE_EXPOSES_CONTAINER_REF_DESCRIPTION_": "Ein Ref-Objekt, das auf das DOM-Element des Container-Elements der Komponente zeigt. Dies kann nützlich sein, um das Container-Element zu steuern oder auf seine Eigenschaften zuzugreifen.",
  "_A_DISCLOSURE_EXPOSES_IS_OPEN_DESCRIPTION_": "Ein boolescher Wert, der angibt, ob der erweiterte Textinhalt aktuell angezeigt wird (true) oder nicht (false). Sie können diesen Wert verwenden, um den Zustand der Komponente zu überwachen und entsprechend darauf zu reagieren.",
  "_A_DISCLOSURE_EXPOSES_TOGGLE_BUTTON_DESCRIPTION_": "Eine Funktion, die aufgerufen werden kann, um den Zustand der Komponente umzuschalten, und somit den erweiterten Textinhalt ein- oder auszublenden.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_DESCRIPTION_": "In diesem Beispiel wird erläutert, wie Sie die Darstellung des \"Mehr anzeigen/Weniger anzeigen\"-Buttons in der Komponente durch Anpassen der CSS-Klassen beeinflussen können. Dabei wird die Prop <strong>btn-class</strong> verwendet, um die CSS-Klassen für den Button selbst festzulegen, und die Prop <strong>btn-parent-class</strong> verwendet, um die CSS-Klasse für das übergeordnete Element des Buttons anzugeben. Durch diese Anpassungen können Sie das Erscheinungsbild und die Positionierung des Buttons nach Ihren Wünschen gestalten.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_HEADER_": "Anpassungen der CSS-Klassen für den \"Mehr anzeigen/Weniger anzeigen\"-Button und dessen Elternelement",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_DESCRIPTION_": "In diesem Beispiel wird erläutert, wie Sie Icons in der Komponente verwenden können, um den \"Mehr anzeigen/Weniger anzeigen\"-Button zu verschönern und Informationen über den Button-Zustand zu vermitteln. Sie können Icons sowohl auf der linken als auch auf der rechten Seite des Buttons platzieren. Hierbei werden die Props verwendet, um die Icons für den kürzeren und längeren Textinhalt festzulegen.",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_HEADER_": "Button Icons",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_DESCRIPTION_": " In diesem Beispiel wird gezeigt, wie Sie die Standardtexte für den \"Mehr anzeigen/Weniger anzeigen\"-Button in der Komponente anpassen können.",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_HEADER_": "Anpassung der Standardtexte für den \"Mehr anzeigen/Weniger anzeigen\"-Button",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie die Titeltexte für den \"Mehr anzeigen/Weniger anzeigen\"-Button in der Komponente individuell anpassen können. Dies ermöglicht es Ihnen, benutzerfreundliche und aussagekräftige Titel für den Button festzulegen, um den Benutzern eine klare Vorstellung davon zu geben, was beim Klicken auf den Button passiert.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HEADER_": "Titeltexte für den \"Mehr anzeigen/Weniger anzeigen\"-Button",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie HTML-formatierte Titel für den \"Mehr anzeigen/Weniger anzeigen\"-Button in der Komponente verwenden können. Durch die Verwendung der Prop <strong>is-btn-title-html</strong> können Sie festlegen, dass die bereitgestellten Button-Titel als HTML interpretiert und gerendert werden.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_HEADER_": "HTML-formatierte Titel für den \"Mehr anzeigen/Weniger anzeigen\"-Button",
  "_A_DISCLOSURE_GROUP_DISABLED_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie den \"Mehr anzeigen/Weniger anzeigen\"-Button in der Komponente deaktivieren können, sodass Benutzer den Textinhalt nicht mehr aus- oder einblenden können, selbst wenn der Button sichtbar ist.",
  "_A_DISCLOSURE_GROUP_DISABLED_HEADER_": "Deaktivieren des \"Mehr anzeigen/Weniger anzeigen\"-Buttons",
  "_A_DISCLOSURE_GROUP_EVENTS_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie auf den Klick des \"Mehr anzeigen/Weniger anzeigen\"-Buttons in der Komponente reagieren können, indem Sie das <strong>toggle</strong>-Ereignis abhören. Dies ermöglicht es Ihnen, benutzerdefinierte Funktionen auszuführen, wenn der Button geklickt wird, und den aktuellen Zustand der Komponente zu überwachen.",
  "_A_DISCLOSURE_GROUP_EVENTS_HEADER_": "Reagieren auf den \"Mehr anzeigen/Weniger anzeigen\"-Button-Klick mithilfe von Emits",
  "_A_DISCLOSURE_GROUP_EXPOSES_HEADER_": "Exposes",
  "_A_DISCLOSURE_GROUP_HTML_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie HTML-Inhalte in der Komponente sicher anzeigen können, indem Sie die <strong>html-less</strong> und <strong>html-more</strong> Props verwenden. Diese Props ermöglichen die Verwendung von HTML-formatierten Texten, während gleichzeitig Sicherheitsmaßnahmen implementiert werden, um schädlichen Code zu verhindern. Dabei wird die DOMPurify.sanitize()-Methode verwendet, um die Inhalte zu säubern und sicherzustellen, dass keine schädlichen Codes in der angezeigten HTML-Ausgabe vorhanden sind.",
  "_A_DISCLOSURE_GROUP_HTML_HEADER_": "Sichere Anzeige von HTML-Inhalten",
  "_A_DISCLOSURE_GROUP_NOT_LESS_DESCRIPTION_": "In diesem Beispiel wird erläutert, wie Sie die Sichtbarkeit des \"Mehr anzeigen/Weniger anzeigen\"-Buttons in der Komponente steuern können. Hierbei wird die Prop <strong>show-less</strong> verwendet, um festzulegen, ob der Button angezeigt wird oder nicht.",
  "_A_DISCLOSURE_GROUP_NOT_LESS_HEADER_": "Anzeige des \"Mehr anzeigen/Weniger anzeigen\"-Buttons steuern",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_DESCRIPTION_": "In diesem Beispiel wird erläutert, wie Sie die standardmäßige Anzeige des erweiterten Textinhalts in der Komponente steuern können. Mithilfe der Prop <strong>is-open-default</strong> können Sie festlegen, ob beim ersten Laden der Seite standardmäßig der erweiterte Textinhalt <strong>(text-more)</strong> angezeigt wird.",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_HEADER_": "Standardmäßige Anzeige des erweiterten Textinhalts",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_DESCRIPTION_": "In diesem Beispiel wird erläutert, wie Sie vertrauenswürdige HTML-Inhalte sicher in der Komponente anzeigen können. Hierbei werden die Props safe-html-less und safe-html-more verwendet. Diese Props ermöglichen die direkte Anzeige von HTML-formatierten Texten, wenn Sie sicher sind, dass der bereitgestellte HTML-Code vertrauenswürdig ist und keine schädlichen Elemente enthält. Im Gegensatz zu den vorherigen Props (html-less und html-more) wird der HTML-Inhalt hier ohne die Verwendung von DOMPurify.sanitize() gerendert.",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_HEADER_": "Vertrauenswürdige HTML-Inhalte anzeigen",
  "_A_DISCLOSURE_GROUP_SLOTS_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie Sie Slots verwenden können, um die einzelnen Teile der Komponente individuell zu gestalten. Es werden drei Slots verwendet: <strong>button</strong>, <strong>less</strong> und <strong>more</strong>, um den Button und die darunterliegenden Textabschnitte anzupassen.",
  "_A_DISCLOSURE_GROUP_SLOTS_HEADER_": "Verwendung von Slots für individuelle Gestaltung",
  "_A_DISCLOSURE_PROPS_BTN_CLASS_DESCRIPTION_": "die CSS-Klassen für den \"Mehr anzeigen/Weniger anzeigen\"-Button",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_LESS_DESCRIPTION_": "Das Icon, das auf der linken Seite des \"Weniger anzeigen\"-Buttons angezeigt wird.",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_MORE_DESCRIPTION_": "Das Icon, das auf der linken Seite des \"Mehr anzeigen\"-Buttons angezeigt wird.",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_LESS_DESCRIPTION_": "Das Icon, das auf der rechten Seite des \"Weniger anzeigen\"-Buttons angezeigt wird.",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_MORE_DESCRIPTION_": "Das Icon, das auf der rechten Seite des \"Mehr anzeigen\"-Buttons angezeigt wird.",
  "_A_DISCLOSURE_PROPS_BTN_ID_DESCRIPTION_": "ID für den \"Mehr anzeigen/Weniger anzeigen\"-Button",
  "_A_DISCLOSURE_PROPS_BTN_PARENT_CLASS_DESCRIPTION_": "Die CSS-Klasse für das übergeordnete Element des Buttons",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_LESS_DESCRIPTION_": "Der Text für den \"Weniger anzeigen\" Button",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_MORE_DESCRIPTION_": "Der Text für den \"Mehr anzeigen\" Button",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_LESS_DESCRIPTION_": "Der Titeltext für den \"Weniger anzeigen\" Button.",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_MORE_DESCRIPTION_": "Der Titeltext für den \"Mehr anzeigen\" Button.",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_PLACEMENT_DESCRIPTION_": "Die Positionierung des HTML-Titels",
  "_A_DISCLOSURE_PROPS_DISABLED_DESCRIPTION_": " Ein boolescher Wert, der angibt, ob der \"Mehr anzeigen/Weniger anzeigen\"-Button deaktiviert werden soll.",
  "_A_DISCLOSURE_PROPS_HTML_LESS_DESCRIPTION_": "Ein String, der den kürzeren HTML-formatierten Textinhalt enthält, der angezeigt wird, wenn der Benutzer auf \"Weniger anzeigen\" klickt. Dieser Inhalt wird mithilfe von DOMPurify.sanitize() gesichert, um schädlichen Code zu verhindern. ",
  "_A_DISCLOSURE_PROPS_HTML_MORE_DESCRIPTION_": "Ein String, der den längeren HTML-formatierten Textinhalt enthält, der angezeigt wird, wenn der Benutzer auf \"Mehr anzeigen\" klickt. Dieser Inhalt wird mithilfe von DOMPurify.sanitize() gesichert, um schädlichen Code zu verhindern.",
  "_A_DISCLOSURE_PROPS_ID_DESCRIPTION_": "Id für die Komponente",
  "_A_DISCLOSURE_PROPS_IS_BTN_TITLE_HTML_DESCRIPTION_": "Ein boolescher Wert, der angibt, ob die bereitgestellten Button-Titel als HTML interpretiert und gerendert werden soll.",
  "_A_DISCLOSURE_PROPS_IS_OPEN_DEFAULT_DESCRIPTION_": "Ein boolescher Wert, der angibt, ob der erweiterte Textinhalt <strong>(text-more)</strong> standardmäßig angezeigt werden soll.",
  "_A_DISCLOSURE_PROPS_PROPS_BTN_ATTRIBUTES_DESCRIPTION_": "Props oder HTML_Attributen für den \"Mehr anzeigen/Weniger anzeigen\"-Button <strong>(AButton)</strong>",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_LESS_DESCRIPTION_": "Ein String, der den kürzeren HTML-formatierten Textinhalt enthält, der angezeigt wird, wenn der Benutzer auf \"Weniger anzeigen\" klickt. Beachten Sie, dass dieser Inhalt direkt gerendert wird und nur dann verwendet werden sollte, wenn Sie sicher sind, dass der HTML-Code vertrauenswürdig ist und keine Sicherheitsrisiken birgt.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_MORE_DESCRIPTION_": "Ein String, der den längeren HTML-formatierten Textinhalt enthält, der angezeigt wird, wenn der Benutzer auf \"Mehr anzeigen\" klickt. Beachten Sie, dass dieser Inhalt direkt gerendert wird und nur dann verwendet werden sollte, wenn Sie sicher sind, dass der HTML-Code vertrauenswürdig ist und keine Sicherheitsrisiken birgt.",
  "_A_DISCLOSURE_PROPS_SHOW_LESS_DESCRIPTION_": "Ein boolescher Wert, der angibt, ob der \"Mehr anzeigen/Weniger anzeigen\"-Button angezeigt werden soll.",
  "_A_DISCLOSURE_PROPS_TEXT_LESS_DESCRIPTION_": "Der kürzere Textinhalt, der angezeigt wird, wenn der Benutzer auf \"Weniger anzeigen\" klickt.",
  "_A_DISCLOSURE_PROPS_TEXT_MORE_DESCRIPTION_": "Der längere Textinhalt, der angezeigt wird, wenn der Benutzer auf \"Mehr anzeigen\" klickt.",
  "_A_DISCLOSURE_SLOT_BUTTON_DESCRIPTION_": " Hier können Sie den Inhalt des \"Mehr anzeigen/Weniger anzeigen\"-Buttons anpassen. Sie erhalten Zugriff auf die Werte <strong>isButtonVisible</strong> und <strong>isOpen</strong>, die Informationen über die Sichtbarkeit des Buttons und den aktuellen Zustand liefern.",
  "_A_DISCLOSURE_SLOT_LESS_DESCRIPTION_": "Dieser Slot ermöglicht die Anpassung des kürzeren Textinhalts, der angezeigt wird, wenn der Benutzer auf \"Weniger anzeigen\" klickt. Sie haben Zugriff auf die Werte <strong>isButtonVisible</strong> und <strong>isOpen</strong>, die Informationen über die Sichtbarkeit des Buttons und den aktuellen Zustand bereitstellen.",
  "_A_DISCLOSURE_SLOT_MORE_DESCRIPTION_": "Dieser Slot ermöglicht die Anpassung des längeren Textinhalts, der angezeigt wird, wenn der Benutzer auf \"Mehr anzeigen\" klickt. Sie haben Zugriff auf die Werte <strong>isButtonVisible</strong> und <strong>isOpen</strong>, die Informationen über die Sichtbarkeit des Buttons und den aktuellen Zustand bereitstellen.",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_IS_OPEN_": "Komponentenstatus ändern (isOpen)",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_TOGGLE_BUTTON_": "Komponentenstatus ändern (Schaltfläche)",
  "_A_DISCLOSURE_TOGGLE_DESCRIPTION_": " Dieses Ereignis wird ausgelöst, wenn der Benutzer auf den \"Mehr anzeigen/Weniger anzeigen\"-Button klickt. Es gibt ein Objekt zurück, das Informationen über den aktuellen Zustand der Komponente enthält, einschließlich <strong>isOpen</strong>."
}
