{
  "_A_DISCLOSURE_COMPONENT_DESCRIPTION_": "El componente permite a los usuarios mostrar u ocultar contenido de texto haciendo clic en un botón. El botón alterna entre \"Mostrar más\" y \"Mostrar menos\", dependiendo de si el contenido de texto completo ya está visible o no.",
  "_A_DISCLOSURE_COMPONENT_NAME_": "Mostrar/ocultar contenido",
  "_A_DISCLOSURE_EXPOSES_BUTTON_REF_DESCRIPTION_": "Un objeto Ref que apunta al elemento DOM del botón \"Mostrar más/Mostrar menos\" en el componente. Esto te permite manipular directamente el elemento del botón o acceder a eventos como clics.",
  "_A_DISCLOSURE_EXPOSES_CONTAINER_REF_DESCRIPTION_": "Un objeto Ref que apunta al elemento DOM del contenedor del componente. Esto puede ser útil para controlar el elemento del contenedor o acceder a sus propiedades.",
  "_A_DISCLOSURE_EXPOSES_IS_OPEN_DESCRIPTION_": "Un valor booleano que indica si el contenido de texto extendido se muestra actualmente (true) o no (false). Puedes utilizar este valor para supervisar el estado del componente y reaccionar en consecuencia.",
  "_A_DISCLOSURE_EXPOSES_TOGGLE_BUTTON_DESCRIPTION_": "Una función que se puede llamar para cambiar el estado del componente y, por lo tanto, mostrar u ocultar el contenido de texto extendido.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_DESCRIPTION_": "Este ejemplo explica cómo influir en la apariencia del botón \"Mostrar más/Mostrar menos\" en el componente personalizando las clases CSS. Utiliza la propiedad <strong>btn-class</strong> para establecer las clases CSS para el botón en sí y la propiedad <strong>btn-parent-class</strong> para especificar la clase CSS para el elemento padre del botón. Estas personalizaciones te permiten dar estilo a la apariencia y posición del botón según tus preferencias.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_HEADER_": "Personalización de las clases CSS para el botón \"Mostrar más/Mostrar menos\" y su elemento padre",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_DESCRIPTION_": "Este ejemplo muestra cómo usar íconos en el componente para mejorar el botón \"Mostrar más/Mostrar menos\" y transmitir información sobre el estado del botón. Puedes colocar íconos tanto en el lado izquierdo como en el derecho del botón. Utiliza propiedades para configurar los íconos para el contenido de texto más corto y más largo.",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_HEADER_": "Íconos del botón",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_DESCRIPTION_": "En este ejemplo, aprenderás cómo personalizar los textos por defecto para el botón \"Mostrar más/Mostrar menos\" en el componente.",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_HEADER_": "Personalización de los textos por defecto para el botón \"Mostrar más/Mostrar menos\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_DESCRIPTION_": "Este ejemplo muestra cómo personalizar individualmente los textos de título para el botón \"Mostrar más/Mostrar menos\" en el componente. Esto te permite proporcionar títulos amigables y significativos para el botón y dar a los usuarios una idea clara de lo que sucede cuando hacen clic en el botón.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HEADER_": "Personalización de los textos de título para el botón \"Mostrar más/Mostrar menos\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_DESCRIPTION_": "Este ejemplo muestra cómo usar títulos HTML con formato para el botón \"Mostrar más/Mostrar menos\" en el componente. Al usar la propiedad <strong>is-btn-title-html</strong>, puedes especificar que los títulos de botón proporcionados se interpreten y muestren como HTML.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_HEADER_": "Títulos HTML con formato para el botón \"Mostrar más/Mostrar menos\"",
  "_A_DISCLOSURE_GROUP_DISABLED_DESCRIPTION_": "En este ejemplo, aprenderás cómo desactivar el botón \"Mostrar más/Mostrar menos\" en el componente, evitando que los usuarios cambien el contenido de texto, incluso si el botón está visible.",
  "_A_DISCLOSURE_GROUP_DISABLED_HEADER_": "Desactivar el botón \"Mostrar más/Mostrar menos\"",
  "_A_DISCLOSURE_GROUP_EVENTS_DESCRIPTION_": "Este ejemplo muestra cómo responder al clic en el botón \"Mostrar más/Mostrar menos\" en el componente escuchando el evento <strong>toggle</strong>. Esto te permite ejecutar funciones personalizadas cuando se hace clic en el botón y supervisar el estado actual del componente.",
  "_A_DISCLOSURE_GROUP_EVENTS_HEADER_": "Responder al clic en el botón \"Mostrar más/Mostrar menos\" utilizando Emits",
  "_A_DISCLOSURE_GROUP_EXPOSES_HEADER_": "Expone",
  "_A_DISCLOSURE_GROUP_HTML_DESCRIPTION_": "En este ejemplo, aprenderás cómo mostrar contenido HTML de forma segura en el componente utilizando las propiedades <strong>html-less</strong> y <strong>html-more</strong>. Estas propiedades te permiten usar texto con formato HTML al tiempo que implementas medidas de seguridad para prevenir código malicioso. Utiliza el método DOMPurify.sanitize() para limpiar el contenido y asegurarte de que no haya código dañino en la salida HTML mostrada.",
  "_A_DISCLOSURE_GROUP_HTML_HEADER_": "Mostrar contenido HTML de forma segura",
  "_A_DISCLOSURE_GROUP_NOT_LESS_DESCRIPTION_": "En este ejemplo, aprenderás cómo controlar la visibilidad del botón \"Mostrar más/Mostrar menos\" en el componente utilizando la propiedad <strong>show-less</strong> para determinar si el botón debe mostrarse o no.",
  "_A_DISCLOSURE_GROUP_NOT_LESS_HEADER_": "Controlar la visibilidad del botón \"Mostrar más/Mostrar menos\"",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_DESCRIPTION_": "Este ejemplo explica cómo controlar la visualización predeterminada del contenido de texto extendido en el componente. Usando la propiedad <strong>is-open-default</strong>, puedes especificar si el contenido de texto extendido <strong>(text-more)</strong> debe mostrarse de forma predeterminada cuando la página se carga inicialmente.",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_HEADER_": "Visualización predeterminada del contenido de texto extendido",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_DESCRIPTION_": "Este ejemplo explica cómo mostrar contenido HTML de confianza de forma segura en el componente utilizando las propiedades safe-html-less y safe-html-more. Estas propiedades permiten la visualización directa de texto con formato HTML cuando tienes confianza en que el código HTML proporcionado es seguro y no contiene elementos dañinos. A diferencia de las propiedades anteriores (html-less y html-more), en este caso el contenido HTML se muestra sin utilizar DOMPurify.sanitize().",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_HEADER_": "Mostrar contenido HTML de confianza",
  "_A_DISCLOSURE_GROUP_SLOTS_DESCRIPTION_": "Este ejemplo muestra cómo utilizar slots para personalizar individualmente las diferentes partes del componente. Utiliza tres slots: <strong>button</strong>, <strong>less</strong> y <strong>more</strong> para personalizar el botón y las secciones de texto subyacentes.",
  "_A_DISCLOSURE_GROUP_SLOTS_HEADER_": "Uso de slots para estilos personalizados",
  "_A_DISCLOSURE_PROPS_BTN_CLASS_DESCRIPTION_": "Las clases CSS para el botón \"Mostrar más/Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_LESS_DESCRIPTION_": "El ícono que se muestra en el lado izquierdo del botón \"Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_MORE_DESCRIPTION_": "El ícono que se muestra en el lado izquierdo del botón \"Mostrar más\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_LESS_DESCRIPTION_": "El ícono que se muestra en el lado derecho del botón \"Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_MORE_DESCRIPTION_": "El ícono que se muestra en el lado derecho del botón \"Mostrar más\".",
  "_A_DISCLOSURE_PROPS_BTN_ID_DESCRIPTION_": "ID para el botón \"Mostrar más/Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_PARENT_CLASS_DESCRIPTION_": "La clase CSS para el elemento padre del botón.",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_LESS_DESCRIPTION_": "El texto para el botón \"Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_MORE_DESCRIPTION_": "El texto para el botón \"Mostrar más\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_LESS_DESCRIPTION_": "El texto de título para el botón \"Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_MORE_DESCRIPTION_": "El texto de título para el botón \"Mostrar más\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_PLACEMENT_DESCRIPTION_": "La posición del título HTML.",
  "_A_DISCLOSURE_PROPS_DISABLED_DESCRIPTION_": "Un valor booleano que indica si el botón \"Mostrar más/Mostrar menos\" debe estar desactivado.",
  "_A_DISCLOSURE_PROPS_HTML_LESS_DESCRIPTION_": "Una cadena que contiene el contenido de texto HTML más corto que se mostrará cuando el usuario haga clic en \"Mostrar menos\". Este contenido se asegura mediante DOMPurify.sanitize() para prevenir código malicioso.",
  "_A_DISCLOSURE_PROPS_HTML_MORE_DESCRIPTION_": "Una cadena que contiene el contenido de texto HTML más largo que se mostrará cuando el usuario haga clic en \"Mostrar más\". Este contenido se asegura mediante DOMPurify.sanitize() para prevenir código malicioso.",
  "_A_DISCLOSURE_PROPS_ID_DESCRIPTION_": "ID para el componente.",
  "_A_DISCLOSURE_PROPS_IS_BTN_TITLE_HTML_DESCRIPTION_": "Un valor booleano que indica si los títulos de botón proporcionados deben interpretarse y mostrarse como HTML.",
  "_A_DISCLOSURE_PROPS_IS_OPEN_DEFAULT_DESCRIPTION_": "Un valor booleano que indica si el contenido de texto extendido <strong>(text-more)</strong> debe mostrarse de forma predeterminada.",
  "_A_DISCLOSURE_PROPS_PROPS_BTN_ATTRIBUTES_DESCRIPTION_": "Props o atributos HTML para el botón \"Mostrar más/Mostrar menos\" <strong>(AButton)</strong>",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_LESS_DESCRIPTION_": "Una cadena que contiene el contenido de texto HTML más corto que se mostrará cuando el usuario haga clic en \"Mostrar menos\". Ten en cuenta que este contenido se muestra directamente y solo debe usarse cuando estés seguro de que el código HTML es seguro y no representa riesgos de seguridad.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_MORE_DESCRIPTION_": "Una cadena que contiene el contenido de texto HTML más largo que se mostrará cuando el usuario haga clic en \"Mostrar más\". Ten en cuenta que este contenido se muestra directamente y solo debe usarse cuando estés seguro de que el código HTML es seguro y no representa riesgos de seguridad.",
  "_A_DISCLOSURE_PROPS_SHOW_LESS_DESCRIPTION_": "Un valor booleano que indica si el botón \"Mostrar más/Mostrar menos\" debe mostrarse.",
  "_A_DISCLOSURE_PROPS_TEXT_LESS_DESCRIPTION_": "El contenido de texto más corto que se mostrará cuando el usuario haga clic en \"Mostrar menos\".",
  "_A_DISCLOSURE_PROPS_TEXT_MORE_DESCRIPTION_": "El contenido de texto más largo que se mostrará cuando el usuario haga clic en \"Mostrar más\".",
  "_A_DISCLOSURE_SLOT_BUTTON_DESCRIPTION_": "Aquí puedes personalizar el contenido del botón \"Mostrar más/Mostrar menos\". Tienes acceso a los valores <strong>isButtonVisible</strong> e <strong>isOpen</strong>, que proporcionan información sobre la visibilidad del botón y su estado actual.",
  "_A_DISCLOSURE_SLOT_LESS_DESCRIPTION_": "Este slot te permite personalizar el contenido de texto más corto que se mostrará cuando el usuario haga clic en \"Mostrar menos\". Tienes acceso a los valores <strong>isButtonVisible</strong> y <strong>isOpen</strong>, que proporcionan información sobre la visibilidad del botón y su estado actual.",
  "_A_DISCLOSURE_SLOT_MORE_DESCRIPTION_": "Este slot te permite personalizar el contenido de texto más largo que se mostrará cuando el usuario haga clic en \"Mostrar más\". Tienes acceso a los valores <strong>isButtonVisible</strong> y <strong>isOpen</strong>, que proporcionan información sobre la visibilidad del botón y su estado actual.",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_IS_OPEN_": "Cambiar el estado del componente (isOpen)",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_TOGGLE_BUTTON_": "Cambiar el estado del componente (botón)",
  "_A_DISCLOSURE_TOGGLE_DESCRIPTION_": "Este evento se desencadena cuando el usuario hace clic en el botón \"Mostrar más/Mostrar menos\". Devuelve un objeto que contiene información sobre el estado actual del componente, incluyendo <strong>isOpen</strong>."
}
