{
  "_A_DISCLOSURE_COMPONENT_NAME_": "[Aloha]",
  "_A_DISCLOSURE_COMPONENT_DESCRIPTION_": "Le composant permet aux utilisateurs d'afficher ou de masquer des contenus textuels en cliquant sur un bouton. Le bouton bascule entre \"Afficher plus\" et \"Afficher moins\", en fonction de la visibilité du contenu textuel complet.",
  "_A_DISCLOSURE_GROUP_DISABLED_HEADER_": "Désactivation du bouton \"Afficher plus/Afficher moins\"",
  "_A_DISCLOSURE_GROUP_DISABLED_DESCRIPTION_": "Dans cet exemple, vous apprendrez comment désactiver le bouton \"Afficher plus/Afficher moins\" dans le composant, empêchant ainsi les utilisateurs de basculer le contenu textuel, même si le bouton est visible.",
  "_A_DISCLOSURE_GROUP_HTML_HEADER_": "Affichage sécurisé de contenu HTML",
  "_A_DISCLOSURE_GROUP_HTML_DESCRIPTION_": "Dans cet exemple, vous apprendrez comment afficher du contenu HTML en toute sécurité dans le composant en utilisant les propriétés <strong>html-less</strong> et <strong>html-more</strong>. Ces propriétés vous permettent d'utiliser du texte au format HTML tout en mettant en place des mesures de sécurité pour éviter tout code malveillant. Utilisez la méthode DOMPurify.sanitize() pour nettoyer le contenu et vous assurer qu'aucun code malveillant n'est présent dans la sortie HTML affichée.",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_HEADER_": "Affichage de contenu HTML de confiance",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_DESCRIPTION_": "Dans cet exemple, vous apprendrez comment afficher en toute sécurité du contenu HTML de confiance dans le composant. Utilisez les propriétés safe-html-less et safe-html-more. Ces propriétés permettent l'affichage direct de texte au format HTML lorsque vous êtes certain que le code HTML fourni est fiable et ne contient pas d'éléments malveillants. Contrairement aux propriétés précédentes (html-less et html-more), le contenu HTML est affiché ici sans utiliser DOMPurify.sanitize().",
  "_A_DISCLOSURE_GROUP_NOT_LESS_HEADER_": "Contrôle de la visibilité du bouton \"Afficher plus/Afficher moins\"",
  "_A_DISCLOSURE_GROUP_NOT_LESS_DESCRIPTION_": "Dans cet exemple, vous apprendrez comment contrôler la visibilité du bouton \"Afficher plus/Afficher moins\" dans le composant en utilisant la propriété <strong>show-less</strong> pour déterminer si le bouton doit être affiché ou non.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_HEADER_": "Personnalisation des classes CSS pour le bouton \"Afficher plus/Afficher moins\" et son élément parent",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_DESCRIPTION_": "Dans cet exemple, vous découvrirez comment influencer l'apparence du bouton \"Afficher plus/Afficher moins\" dans le composant en personnalisant les classes CSS. Utilisez la propriété <strong>btn-class</strong> pour définir les classes CSS pour le bouton lui-même, et la propriété <strong>btn-parent-class</strong> pour spécifier la classe CSS pour l'élément parent du bouton. Ces personnalisations vous permettent de styliser l'apparence et la position du bouton selon vos préférences.",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_HEADER_": "Icônes de bouton",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_DESCRIPTION_": "Dans cet exemple, vous découvrirez comment utiliser des icônes dans le composant pour embellir le bouton \"Afficher plus/Afficher moins\" et transmettre des informations sur l'état du bouton. Vous pouvez placer des icônes à la fois à gauche et à droite du bouton. Utilisez les propriétés pour définir les icônes pour le contenu textuel plus court et plus long.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HEADER_": "Personnalisation des textes de titre pour le bouton \"Afficher plus/Afficher moins\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_DESCRIPTION_": "Dans cet exemple, vous verrez comment personnaliser individuellement les textes de titre pour le bouton \"Afficher plus/Afficher moins\" dans le composant. Cela vous permet de fournir des titres conviviaux et informatifs pour le bouton, donnant aux utilisateurs une idée claire de ce qui se passe lorsqu'ils cliquent dessus.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_HEADER_": "Titres HTML formatés pour le bouton \"Afficher plus/Afficher moins\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_DESCRIPTION_": "Dans cet exemple, vous verrez comment utiliser des titres HTML formatés pour le bouton \"Afficher plus/Afficher moins\" dans le composant. En utilisant la propriété <strong>is-btn-title-html</strong>, vous pouvez spécifier que les titres de bouton fournis doivent être interprétés et affichés comme du HTML.",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_HEADER_": "Personnalisation des textes par défaut pour le bouton \"Afficher plus/Afficher moins\"",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_DESCRIPTION_": "Dans cet exemple, vous verrez comment personnaliser les textes par défaut pour le bouton \"Afficher plus/Afficher moins\" dans le composant.",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_HEADER_": "Affichage par défaut du contenu textuel étendu",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_DESCRIPTION_": "Dans cet exemple, vous verrez comment contrôler l'affichage par défaut du contenu textuel étendu dans le composant. Utilisez la propriété <strong>is-open-default</strong> pour déterminer si le contenu textuel étendu <strong>(text-more)</strong> doit être affiché par défaut lors du premier chargement de la page.",
  "_A_DISCLOSURE_GROUP_SLOTS_HEADER_": "Utilisation des slots pour une personnalisation individuelle",
  "_A_DISCLOSURE_GROUP_SLOTS_DESCRIPTION_": "Dans cet exemple, vous verrez comment utiliser des slots pour personnaliser individuellement les différentes parties du composant. Trois slots sont utilisés : <strong>button</strong>, <strong>less</strong> et <strong>more</strong>, pour personnaliser le bouton et les sections de texte sous-jacentes.",
  "_A_DISCLOSURE_GROUP_EVENTS_HEADER_": "Réagir au clic sur le bouton \"Afficher plus/Afficher moins\" en utilisant les Emits",
  "_A_DISCLOSURE_GROUP_EVENTS_DESCRIPTION_": "Dans cet exemple, vous verrez comment réagir au clic sur le bouton \"Afficher plus/Afficher moins\" dans le composant en écoutant l'événement <strong>toggle</strong>. Cela vous permet d'exécuter des fonctions personnalisées lorsque le bouton est cliqué et de surveiller l'état actuel du composant.",
  "_A_DISCLOSURE_TOGGLE_DESCRIPTION_": "Cet événement est déclenché lorsque l'utilisateur clique sur le bouton \"Afficher plus/Afficher moins\". Il renvoie un objet contenant des informations sur l'état actuel du composant, y compris <strong>isOpen</strong>.",
  "_A_DISCLOSURE_GROUP_EXPOSES_HEADER_": "Expositions",
  "_A_DISCLOSURE_EXPOSES_BUTTON_REF_DESCRIPTION_": "Un objet Ref qui pointe vers l'élément DOM du bouton \"Afficher plus/Afficher moins\" dans le composant. Cela vous permet de manipuler directement l'élément du bouton ou d'accéder aux événements tels que les clics.",
  "_A_DISCLOSURE_EXPOSES_CONTAINER_REF_DESCRIPTION_": "Un objet Ref qui pointe vers l'élément DOM du conteneur du composant. Cela peut être utile pour contrôler l'élément du conteneur ou accéder à ses propriétés.",
  "_A_DISCLOSURE_EXPOSES_IS_OPEN_DESCRIPTION_": "Une valeur booléenne indiquant si le contenu textuel étendu est actuellement affiché (true) ou non (false). Vous pouvez utiliser cette valeur pour surveiller l'état du composant et réagir en conséquence.",
  "_A_DISCLOSURE_EXPOSES_TOGGLE_BUTTON_DESCRIPTION_": "Une fonction qui peut être appelée pour basculer l'état du composant et ainsi afficher ou masquer le contenu textuel étendu.",
  "_A_DISCLOSURE_PROPS_PROPS_BTN_ATTRIBUTES_DESCRIPTION_": "Props ou attributs HTML pour le bouton \"Afficher plus/Afficher moins\" <strong>(AButton)</strong>",
  "_A_DISCLOSURE_PROPS_BTN_CLASS_DESCRIPTION_": "Les classes CSS pour le bouton \"Afficher plus/Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_LESS_DESCRIPTION_": "L'icône affichée à gauche du bouton \"Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_MORE_DESCRIPTION_": "L'icône affichée à gauche du bouton \"Afficher plus\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_LESS_DESCRIPTION_": "L'icône affichée à droite du bouton \"Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_MORE_DESCRIPTION_": "L'icône affichée à droite du bouton \"Afficher plus\".",
  "_A_DISCLOSURE_PROPS_BTN_ID_DESCRIPTION_": "ID pour le bouton \"Afficher plus/Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_PARENT_CLASS_DESCRIPTION_": "La classe CSS pour l'élément parent du bouton.",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_LESS_DESCRIPTION_": "Le texte pour le bouton \"Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_MORE_DESCRIPTION_": "Le texte pour le bouton \"Afficher plus\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_LESS_DESCRIPTION_": "Le texte du titre pour le bouton \"Afficher moins\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_MORE_DESCRIPTION_": "Le texte du titre pour le bouton \"Afficher plus\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_PLACEMENT_DESCRIPTION_": "La position du titre HTML.",
  "_A_DISCLOSURE_PROPS_DISABLED_DESCRIPTION_": "Une valeur booléenne indiquant si le bouton \"Afficher plus/Afficher moins\" doit être désactivé.",
  "_A_DISCLOSURE_PROPS_HTML_LESS_DESCRIPTION_": "Une chaîne de caractères contenant le contenu textuel HTML plus court qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher moins\". Ce contenu est sécurisé en utilisant DOMPurify.sanitize() pour éviter tout code malveillant.",
  "_A_DISCLOSURE_PROPS_HTML_MORE_DESCRIPTION_": "Une chaîne de caractères contenant le contenu textuel HTML plus long qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher plus\". Ce contenu est sécurisé en utilisant DOMPurify.sanitize() pour éviter tout code malveillant.",
  "_A_DISCLOSURE_PROPS_ID_DESCRIPTION_": "ID pour le composant.",
  "_A_DISCLOSURE_PROPS_IS_BTN_TITLE_HTML_DESCRIPTION_": "Une valeur booléenne indiquant si les titres des boutons fournis doivent être interprétés et affichés en tant que HTML.",
  "_A_DISCLOSURE_PROPS_IS_OPEN_DEFAULT_DESCRIPTION_": "Une valeur booléenne indiquant si le contenu textuel étendu <strong>(text-more)</strong> doit être affiché par défaut.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_LESS_DESCRIPTION_": "Une chaîne de caractères contenant le contenu textuel HTML plus court qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher moins\". Notez que ce contenu est affiché directement et ne doit être utilisé que lorsque vous êtes certain que le code HTML est sûr et ne présente aucun risque pour la sécurité.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_MORE_DESCRIPTION_": "Une chaîne de caractères contenant le contenu textuel HTML plus long qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher plus\". Notez que ce contenu est affiché directement et ne doit être utilisé que lorsque vous êtes certain que le code HTML est sûr et ne présente aucun risque pour la sécurité.",
  "_A_DISCLOSURE_PROPS_SHOW_LESS_DESCRIPTION_": "Une valeur booléenne indiquant si le bouton \"Afficher plus/Afficher moins\" doit être affiché.",
  "_A_DISCLOSURE_PROPS_TEXT_LESS_DESCRIPTION_": "Le contenu textuel plus court qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher moins\".",
  "_A_DISCLOSURE_PROPS_TEXT_MORE_DESCRIPTION_": "Le contenu textuel plus long qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher plus\".",
  "_A_DISCLOSURE_SLOT_BUTTON_DESCRIPTION_": "Ici, vous pouvez personnaliser le contenu du bouton \"Afficher plus/Afficher moins\". Vous avez accès aux valeurs <strong>isButtonVisible</strong> et <strong>isOpen</strong>, qui fournissent des informations sur la visibilité du bouton et l'état actuel.",
  "_A_DISCLOSURE_SLOT_LESS_DESCRIPTION_": "Ce slot permet de personnaliser le contenu textuel plus court qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher moins\". Vous avez accès aux valeurs <strong>isButtonVisible</strong> et <strong>isOpen</strong>, qui fournissent des informations sur la visibilité du bouton et l'état actuel.",
  "_A_DISCLOSURE_SLOT_MORE_DESCRIPTION_": "Ce slot permet de personnaliser le contenu textuel plus long qui sera affiché lorsque l'utilisateur cliquera sur \"Afficher plus\". Vous avez accès aux valeurs <strong>isButtonVisible</strong> et <strong>isOpen</strong>, qui fournissent des informations sur la visibilité du bouton et l'état actuel."
}
