{
  "_A_DISCLOSURE_COMPONENT_DESCRIPTION_": "Компонент позволяет пользователям отображать или скрывать текстовый контент, нажимая на кнопку. Кнопка переключается между \"Показать больше\" и \"Показать меньше\" в зависимости от того, отображается ли полный текстовый контент.",
  "_A_DISCLOSURE_COMPONENT_NAME_": "Показать/скрыть контент",
  "_A_DISCLOSURE_EXPOSES_BUTTON_REF_DESCRIPTION_": "Объект ref, указывающий на DOM-элемент кнопки \"Показать больше/Показать меньше\" в компоненте. Это позволяет вам напрямую манипулировать элементом кнопки или получать доступ к событиям, таким как клики.",
  "_A_DISCLOSURE_EXPOSES_CONTAINER_REF_DESCRIPTION_": "Объект ref, указывающий на DOM-элемент контейнера компонента. Это может быть полезно для управления контейнером или доступа к его свойствам.",
  "_A_DISCLOSURE_EXPOSES_IS_OPEN_DESCRIPTION_": "Логическое значение, указывающее, отображается ли в данный момент расширенный текстовый контент (true) или нет (false). Вы можете использовать это значение для отслеживания состояния компонента и соответствующей реакции.",
  "_A_DISCLOSURE_EXPOSES_TOGGLE_BUTTON_DESCRIPTION_": "Функция, которую можно вызвать для переключения состояния компонента, таким образом отображая или скрывая расширенный текстовый контент.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_DESCRIPTION_": "В этом примере объясняется, как изменить внешний вид кнопки \"Показать больше/Показать меньше\" в компоненте, настраивая CSS-классы. Используется свойство <strong>btn-class</strong> для задания CSS-классов для самой кнопки и свойство <strong>btn-parent-class</strong> для указания CSS-класса для родительского элемента кнопки. Эти настройки позволяют вам изменять внешний вид и расположение кнопки по своему усмотрению.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_HEADER_": "Настройка CSS-классов для кнопки \"Показать больше/Показать меньше\" и её родительского элемента",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_DESCRIPTION_": "В этом примере объясняется, как использовать иконки в компоненте для улучшения внешнего вида кнопки \"Показать больше/Показать меньше\" и передачи информации о состоянии кнопки. Вы можете размещать иконки как с левой, так и с правой стороны кнопки. Используются свойства для задания иконок для короткого и длинного текстового контента.",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_HEADER_": "Иконки для кнопки",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_DESCRIPTION_": "В этом примере показано, как изменить стандартные тексты для кнопки \"Показать больше/Показать меньше\" в компоненте.",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_HEADER_": "Настройка стандартных текстов для кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_DESCRIPTION_": "В этом примере показано, как индивидуально настроить заголовки для кнопки \"Показать больше/Показать меньше\" в компоненте. Это позволяет вам задавать удобные и информативные заголовки для кнопки, чтобы пользователи четко понимали, что произойдет при нажатии на кнопку.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HEADER_": "Заголовки для кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_DESCRIPTION_": "В этом примере показано, как использовать HTML-форматированные заголовки для кнопки \"Показать больше/Показать меньше\" в компоненте. Используя свойство <strong>is-btn-title-html</strong>, вы можете задать, что заголовки кнопок будут интерпретироваться и отображаться как HTML.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_HEADER_": "HTML-форматированные заголовки для кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_GROUP_DISABLED_DESCRIPTION_": "В этом примере показано, как отключить кнопку \"Показать больше/Показать меньше\" в компоненте, чтобы пользователи не могли отображать или скрывать текстовый контент, даже если кнопка видима.",
  "_A_DISCLOSURE_GROUP_DISABLED_HEADER_": "Отключение кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_GROUP_EVENTS_DESCRIPTION_": "В этом примере показано, как реагировать на нажатие кнопки \"Показать больше/Показать меньше\" в компоненте, прослушивая событие <strong>toggle</strong>. Это позволяет вам выполнять пользовательские функции при нажатии на кнопку и отслеживать текущее состояние компонента.",
  "_A_DISCLOSURE_GROUP_EVENTS_HEADER_": "Реагирование на нажатие кнопки \"Показать больше/Показать меньше\" с помощью событий",
  "_A_DISCLOSURE_GROUP_EXPOSES_HEADER_": "Экспорты",
  "_A_DISCLOSURE_GROUP_HTML_DESCRIPTION_": "В этом примере показано, как безопасно отображать HTML-контент в компоненте, используя свойства <strong>html-less</strong> и <strong>html-more</strong>. Эти свойства позволяют использовать HTML-форматированные тексты, при этом реализованы меры безопасности для предотвращения вредоносного кода. Используется метод DOMPurify.sanitize(), чтобы очистить содержимое и убедиться, что в отображаемом HTML нет вредоносного кода.",
  "_A_DISCLOSURE_GROUP_HTML_HEADER_": "Безопасное отображение HTML-контента",
  "_A_DISCLOSURE_GROUP_NOT_LESS_DESCRIPTION_": "В этом примере объясняется, как управлять видимостью кнопки \"Показать больше/Показать меньше\" в компоненте. Используется свойство <strong>show-less</strong>, чтобы указать, будет ли кнопка отображаться.",
  "_A_DISCLOSURE_GROUP_NOT_LESS_HEADER_": "Управление отображением кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_DESCRIPTION_": "В этом примере объясняется, как управлять стандартным отображением расширенного текстового контента в компоненте. Используя свойство <strong>is-open-default</strong>, вы можете задать, будет ли при загрузке страницы отображаться расширенный текстовый контент <strong>(text-more)</strong>.",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_HEADER_": "Стандартное отображение расширенного текстового контента",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_DESCRIPTION_": "В этом примере объясняется, как безопасно отображать доверенный HTML-контент в компоненте. Используются свойства safe-html-less и safe-html-more. Эти свойства позволяют напрямую отображать HTML-форматированные тексты, если вы уверены, что предоставленный HTML-код надежен и не содержит вредоносных элементов. В отличие от предыдущих свойств (html-less и html-more), HTML-контент здесь отображается без использования DOMPurify.sanitize().",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_HEADER_": "Отображение доверенного HTML-контента",
  "_A_DISCLOSURE_GROUP_SLOTS_DESCRIPTION_": "В этом примере показано, как использовать слоты для индивидуальной настройки частей компонента. Используются три слота: <strong>button</strong>, <strong>less</strong> и <strong>more</strong> для настройки кнопки и текстовых разделов под ней.",
  "_A_DISCLOSURE_GROUP_SLOTS_HEADER_": "Использование слотов для индивидуальной настройки",
  "_A_DISCLOSURE_PROPS_BTN_CLASS_DESCRIPTION_": "CSS-классы для кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_LESS_DESCRIPTION_": "Иконка, отображаемая с левой стороны кнопки \"Показать меньше\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_MORE_DESCRIPTION_": "Иконка, отображаемая с левой стороны кнопки \"Показать больше\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_LESS_DESCRIPTION_": "Иконка, отображаемая с правой стороны кнопки \"Показать меньше\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_MORE_DESCRIPTION_": "Иконка, отображаемая с правой стороны кнопки \"Показать больше\".",
  "_A_DISCLOSURE_PROPS_BTN_ID_DESCRIPTION_": "ID для кнопки \"Показать больше/Показать меньше\"",
  "_A_DISCLOSURE_PROPS_BTN_PARENT_CLASS_DESCRIPTION_": "CSS-класс для родительского элемента кнопки",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_LESS_DESCRIPTION_": "Текст для кнопки \"Показать меньше\"",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_MORE_DESCRIPTION_": "Текст для кнопки \"Показать больше\"",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_LESS_DESCRIPTION_": "Текст заголовка для кнопки \"Показать меньше\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_MORE_DESCRIPTION_": "Текст заголовка для кнопки \"Показать больше\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_PLACEMENT_DESCRIPTION_": "Расположение HTML-заголовка",
  "_A_DISCLOSURE_PROPS_DISABLED_DESCRIPTION_": "Логическое значение, указывающее, должна ли быть отключена кнопка \"Показать больше/Показать меньше\".",
  "_A_DISCLOSURE_PROPS_HTML_LESS_DESCRIPTION_": "Строка, содержащая HTML-форматированный текстовый контент, который отображается, когда пользователь нажимает \"Показать меньше\". Это содержимое защищено с помощью DOMPurify.sanitize(), чтобы предотвратить вредоносный код.",
  "_A_DISCLOSURE_PROPS_HTML_MORE_DESCRIPTION_": "Строка, содержащая HTML-форматированный текстовый контент, который отображается, когда пользователь нажимает \"Показать больше\". Это содержимое защищено с помощью DOMPurify.sanitize(), чтобы предотвратить вредоносный код.",
  "_A_DISCLOSURE_PROPS_ID_DESCRIPTION_": "ID для компонента",
  "_A_DISCLOSURE_PROPS_IS_BTN_TITLE_HTML_DESCRIPTION_": "Логическое значение, указывающее, должны ли предоставленные заголовки кнопок интерпретироваться и отображаться как HTML.",
  "_A_DISCLOSURE_PROPS_IS_OPEN_DEFAULT_DESCRIPTION_": "Логическое значение, указывающее, должен ли расширенный текстовый контент <strong>(text-more)</strong> отображаться по умолчанию.",
  "_A_DISCLOSURE_PROPS_PROPS_BTN_ATTRIBUTES_DESCRIPTION_": "Свойства или HTML-атрибуты для кнопки \"Показать больше/Показать меньше\" <strong>(AButton)</strong>",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_LESS_DESCRIPTION_": "Строка, содержащая HTML-форматированный текстовый контент, который отображается, когда пользователь нажимает \"Показать меньше\". Обратите внимание, что это содержимое отображается напрямую и должно использоваться только в том случае, если вы уверены, что HTML-код надежен и не содержит угроз безопасности.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_MORE_DESCRIPTION_": "Строка, содержащая HTML-форматированный текстовый контент, который отображается, когда пользователь нажимает \"Показать больше\". Обратите внимание, что это содержимое отображается напрямую и должно использоваться только в том случае, если вы уверены, что HTML-код надежен и не содержит угроз безопасности.",
  "_A_DISCLOSURE_PROPS_SHOW_LESS_DESCRIPTION_": "Логическое значение, указывающее, должна ли быть видима кнопка \"Показать больше/Показать меньше\".",
  "_A_DISCLOSURE_PROPS_TEXT_LESS_DESCRIPTION_": "Короткий текстовый контент, отображаемый при нажатии кнопки \"Показать меньше\".",
  "_A_DISCLOSURE_PROPS_TEXT_MORE_DESCRIPTION_": "Длинный текстовый контент, отображаемый при нажатии кнопки \"Показать больше\".",
  "_A_DISCLOSURE_SLOT_BUTTON_DESCRIPTION_": "Здесь вы можете настроить содержимое кнопки \"Показать больше/Показать меньше\". Вы получите доступ к значениям <strong>isButtonVisible</strong> и <strong>isOpen</strong>, которые предоставляют информацию о видимости кнопки и текущем состоянии.",
  "_A_DISCLOSURE_SLOT_LESS_DESCRIPTION_": "Этот слот позволяет настроить короткий текстовый контент, отображаемый при нажатии кнопки \"Показать меньше\". Вы получите доступ к значениям <strong>isButtonVisible</strong> и <strong>isOpen</strong>, которые предоставляют информацию о видимости кнопки и текущем состоянии.",
  "_A_DISCLOSURE_SLOT_MORE_DESCRIPTION_": "Этот слот позволяет настроить длинный текстовый контент, отображаемый при нажатии кнопки \"Показать больше\". Вы получите доступ к значениям <strong>isButtonVisible</strong> и <strong>isOpen</strong>, которые предоставляют информацию о видимости кнопки и текущем состоянии.",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_IS_OPEN_": "Изменить состояние компонента (isOpen)",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_TOGGLE_BUTTON_": "Изменить состояние компонента (кнопка)",
  "_A_DISCLOSURE_TOGGLE_DESCRIPTION_": "Это событие запускается, когда пользователь нажимает на кнопку \"Показать больше/Показать меньше\". Оно возвращает объект, содержащий информацию о текущем состоянии компонента, включая <strong>isOpen</strong>."
}