{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "الحدث الذي يتم تشغيله عند فقدان المكون للتركيز. يُستخدم للتحقق من البيانات أو حفظها عندما يترك المستخدم الحقل.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "الحدث الذي يتم تشغيله عند حصول المكون على التركيز. مفيد لتتبع تفاعل المستخدم مع العنصر.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "الحدث الذي يتم تشغيله عند تحديث قيمة نموذج المكون. يُستخدم لمزامنة البيانات بين المكون والمكون الرئيسي.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "في هذا المثال، تكون وظيفة <strong lang=\"en\">change</strong> مسؤولة عن تحديث نموذج المكون. تأخذ الوظيفة ثلاثة معطيات: النموذج <strong lang=\"en\">model</strong>، ومعرف المكون <strong lang=\"en\">id</strong>، وجميع الخصائص <strong lang=\"en\">props</strong> الممررة. يتيح هذا النهج معالجة التغييرات في النموذج بمرونة وتنفيذ إجراءات إضافية، مثل التسجيل أو التحقق.",
  "_A_UI_GROUP_CHANGE_HEADER_": "وظيفة تغيير النموذج",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">errors</strong> لعرض رسائل الخطأ أسفل حقل الإدخال. تساعد رسائل الخطأ المستخدم على فهم البيانات التي تم إدخالها بشكل غير صحيح وكيفية تصحيحها.",
  "_A_UI_GROUP_ERRORS_HEADER_": "عرض الخطأ",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">help-text</strong> لإضافة نص مساعدة أسفل حقل الإدخال. يوفر نص المساعدة معلومات إضافية للمستخدم حول البيانات المتوقعة في هذا الحقل.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "نص المساعدة",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "يوضح هذا المثال كيفية استخدام <strong lang=\"en\">is-label-float</strong> للتحكم في سلوك التسمية في حقل الإدخال. إذا تم تعيين قيمة الخاصية إلى <strong lang=\"en\">false</strong>، تظل التسمية ثابتة. إذا تم تعيين القيمة إلى <strong lang=\"en\">true</strong>، تتحرك التسمية فوق حقل الإدخال عندما يبدأ المستخدم في الكتابة أو عندما يحصل الحقل على التركيز.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "التسمية العائمة",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "وظيفة تُستدعى عند تغيير النموذج. تقبل القيمة الجديدة للنموذج والمعلمات الإضافية لمعالجة التغيير.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "يحدد فئة <strong lang=\"en\">CSS</strong> التي سيتم تطبيقها على زر المسح. يتيح هذا تخصيص مظهر الزر وفقًا لمتطلبات التصميم.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "يحدد التبعيات التي قد تؤثر على رؤية أو سلوك المكون بناءً على قيم العناصر الأخرى.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "يحدد ما إذا كان المكون معطلاً. إذا تم تعيينه على <strong lang=\"en\">true</strong>، يصبح المكون غير نشط ولا يمكن للمستخدم التفاعل معه.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "يحتوي على نص أو مجموعة من الأخطاء التي يجب عرضها للمستخدم. إذا كانت هناك أخطاء، يتم عرضها أسفل المكون.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "مجموعة من السمات التي لا ينبغي أن يتم عرضها لهذا المكون. مفيد لاستبعاد السمات غير الضرورية من <strong lang=\"en\">DOM</strong> النهائي.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "نص المساعدة الذي يتم عرضه أسفل المكون. يوفر للمستخدم معلومات أو تعليمات إضافية.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "يحدد <strong lang=\"en\">HTML ID</strong> للعنصر. يمكن استخدامه لتحديد المكون بشكل فريد في الصفحة.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "معرف المكون، الذي يمكن استخدامه لتتبع المكون أو الإشارة إليه في الكود.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "بادئة لـ<strong lang=\"en\">ID</strong> المكون. يستخدم لإنشاء معرف فريد بناءً على البادئة المحددة.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "كائن السمات المطبقة مباشرة على عنصر الإدخال. يتيح إضافة أو تخصيص سمات إدخال إضافية.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "فئة/فئات <strong lang=\"en\">CSS</strong> المطبقة على عنصر الإدخال. تتيح تنسيق المكون وفقًا لمتطلباتك.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "يحدد ما إذا كان يجب عرض زر المسح. إذا كان <strong lang=\"en\">true</strong>، فسيتم عرض زر بجانب حقل النص، مما يسمح للمستخدم بمسح المحتوى.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "يحدد ما إذا كان يجب إخفاء المكون. إذا تم تعيينه على <strong lang=\"en\">true</strong>، فلن يتم عرض المكون على الصفحة.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "يحدد ما إذا كانت تسمية المكون يجب أن تكون فوق الحقل. إذا كان <strong lang=\"en\">true</strong>، فستتحرك التسمية فوق حقل النص عند التركيز أو عند وجود محتوى.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "يشير إلى ما إذا كان يجب عرض المكون. إذا تم تعيينه على <strong lang=\"en\">false</strong>، فلن يتم إنشاء المكون في <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "فئة/فئات <strong lang=\"en\">CSS</strong> المطبقة على التسمية. تتيح تخصيص نمط التسمية.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "نص التسمية الذي يظهر بجانب المكون. يُستخدم عادةً لوصف هدف عنصر الإدخال.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "تسمية مخصصة لبرامج قراءة الشاشة. مفيد لتحسين إمكانية الوصول.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "يحدد الحد الأقصى لعدد الأحرف التي يمكن إدخالها في الحقل. إذا تم تجاوز هذا الحد، فسيتم حظر المزيد من الإدخال.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "يحدد تبعيات النموذج التي قد تؤثر على رؤية أو سلوك المكون.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "القيمة المستخدمة لإعادة تعيين النموذج إلى حالة غير معرّفة. مفيد لتفريغ قيمة النموذج.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "القيمة الحالية للنموذج المرتبطة بالمكون. تُستخدم لإدارة البيانات المعروضة في المكون.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "يحدد النص البديل الذي سيتم عرضه في حقل الإدخال حتى يقوم المستخدم بإدخال البيانات. يساعد النص البديل المستخدم على فهم البيانات المطلوبة في الحقل.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "يشير إلى ما إذا كان المكون مطلوبًا. إذا تم تعيينه على <strong lang=\"en\">true</strong>، يتطلب المكون إدخالًا من المستخدم."
}