{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn die Komponente den Fokus verliert. Wird verwendet, um Daten zu überprüfen oder zu speichern, wenn der Benutzer das Feld verlässt.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn die Komponente den Fokus erhält. Nützlich, um die Benutzerinteraktion mit dem Element zu verfolgen.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Ereignis, das ausgelöst wird, wenn der Modellwert der Komponente aktualisiert wird. Wird verwendet, um Daten zwischen der Komponente und der übergeordneten Komponente zu synchronisieren.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funktion, die aufgerufen wird, wenn sich das Modell ändert. Es akzeptiert den neuen Modellwert und zusätzliche Parameter zur Verarbeitung der Änderung.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Gibt Abhängigkeiten an, die die Sichtbarkeit oder das Verhalten der Komponente basierend auf den Werten anderer Elemente beeinflussen können.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Bestimmt, ob die Komponente deaktiviert ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird die Komponente inaktiv und der Benutzer kann nicht mit ihr interagieren.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Enthält Text oder ein Array von Fehlern, die dem Benutzer angezeigt werden sollen. Wenn Fehler vorhanden sind, werden sie unter der Komponente angezeigt.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Array von Attributen, die für diese Komponente nicht gerendert werden sollen. Nützlich, um unnötige Attribute aus dem endgültigen <strong lang=\"en\">DOM</strong> auszuschließen.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Hilfetext, der unter der Komponente angezeigt wird. Bietet dem Benutzer zusätzliche Informationen oder Anweisungen.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Setzt die <strong lang=\"en\">HTML ID</strong> des Elements. Kann verwendet werden, um die Komponente auf der Seite eindeutig zu identifizieren.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Die Kennung der Komponente, die verwendet werden kann, um die Komponente im Code zu verfolgen oder darauf zu verweisen.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Präfix für die <strong lang=\"en\">ID</strong> der Komponente. Wird verwendet, um eine eindeutige Kennung basierend auf dem angegebenen Präfix zu erstellen.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Ein Objekt von Attributen, das direkt auf das Eingabeelement angewendet wird. Ermöglicht das Hinzufügen oder Anpassen zusätzlicher Eingabeattribute.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klasse(n), die auf das Eingabeelement angewendet werden. Ermöglicht die Gestaltung der Komponente nach Ihren Anforderungen.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Bestimmt, ob die Komponente ausgeblendet werden soll. Wenn auf <strong lang=\"en\">true</strong> gesetzt, wird die Komponente nicht auf der Seite angezeigt.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Gibt an, ob die Komponente gerendert werden soll. Wenn auf <strong lang=\"en\">false</strong> gesetzt, wird die Komponente nicht im <strong lang=\"en\">DOM</strong> erstellt.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-Klasse(n), die auf die Beschriftung angewendet werden. Ermöglicht die Anpassung des Stils der Beschriftung.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Beschriftungstext, der neben der Komponente angezeigt wird. Wird typischerweise verwendet, um den Zweck des Eingabeelements zu beschreiben.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Beschriftung für Screenreader. Nützlich zur Verbesserung der Barrierefreiheit.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Bestimmt Modellabhängigkeiten, die die Sichtbarkeit oder das Verhalten der Komponente beeinflussen können.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Der Wert, der verwendet wird, um das Modell in einen undefinierten Zustand zurückzusetzen. Nützlich, um den Modellwert zu löschen.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Der aktuelle Modellwert, der mit der Komponente verknüpft ist. Wird verwendet, um die in der Komponente angezeigten Daten zu verwalten.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Gibt an, ob die Komponente erforderlich ist. Wenn auf <strong lang=\"en\">true</strong> gesetzt, erfordert die Komponente eine Benutzereingabe."
}