{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Event triggered when the component loses focus. Used to validate or save data when the user leaves the field.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Event triggered when the component gains focus. Useful for tracking user interaction with the element.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Event triggered when the component's model value is updated. Used to synchronize data between the component and the parent component.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "In this example, the <strong lang=\"en\">change</strong> function is responsible for updating the component's model. The function takes three arguments: the model <strong lang=\"en\">model</strong>, the component identifier <strong lang=\"en\">id</strong>, and all passed <strong lang=\"en\">props</strong>. This approach allows flexible handling of model changes and performing additional actions such as logging or validation.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Model change function",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Function called when the model changes. It accepts the new model value and additional parameters for processing the change.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Specifies the <strong lang=\"en\">CSS</strong> class that will be applied to the clear button. This allows customization of the button's appearance according to design requirements.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Specifies dependencies that may affect the visibility or behavior of the component based on the values of other elements.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Determines whether the component is disabled. If set to <strong lang=\"en\">true</strong>, the component becomes inactive and the user cannot interact with it.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contains text or an array of errors that should be displayed to the user. If there are errors, they are displayed below the component.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Array of attributes that should not be rendered for this component. Useful for excluding unnecessary attributes from the final <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Help text displayed below the component. Provides the user with additional information or instruction.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Sets the <strong lang=\"en\">HTML ID</strong> of the element. Can be used to uniquely identify the component on the page.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "The identifier of the component, which can be used to track or refer to the component in the code.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefix for the component's <strong lang=\"en\">ID</strong>. Used to create a unique identifier based on the specified prefix.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "An object of attributes applied directly to the input element. Allows adding or customizing additional input attributes.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(es) applied to the input element. Allows styling the component according to your requirements.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Determines whether the clear button should be displayed. If <strong lang=\"en\">true</strong>, a button will be shown next to the text field, allowing the user to clear its content.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Determines whether the component should be hidden. If set to <strong lang=\"en\">true</strong>, the component is not displayed on the page.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Determines whether the label of the component should be positioned above the field. If <strong lang=\"en\">true</strong>, the label will move above the text field when focused or when content is present.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indicates whether the component should be rendered. If set to <strong lang=\"en\">false</strong>, the component will not be created in the <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(es) applied to the label. Allows customizing the label's style.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Label text displayed next to the component. Typically used to describe the purpose of the input element.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Label intended for screen readers. Useful for improving accessibility.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Sets the maximum number of characters that can be entered into the field. If this limit is exceeded, further input will be prohibited.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Determines model dependencies that may affect the visibility or behavior of the component.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "The value used to reset the model to an undefined state. Useful for clearing the model value.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "The current model value associated with the component. Used to manage the data displayed in the component.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indicates whether the component is required. If set to <strong lang=\"en\">true</strong>, the component requires user input."
}