{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Evento que se desencadena cuando el componente pierde el foco. Se utiliza para validar o guardar datos cuando el usuario sale del campo.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Evento que se desencadena cuando el componente recibe el foco. Útil para rastrear la interacción del usuario con el elemento.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Evento que se desencadena cuando se actualiza el valor del modelo del componente. Se utiliza para sincronizar datos entre el componente y el componente principal.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Función que se llama cuando el modelo cambia. Acepta el nuevo valor del modelo y parámetros adicionales para procesar el cambio.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Especifica las dependencias que pueden afectar la visibilidad o el comportamiento del componente en función de los valores de otros elementos.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Determina si el componente está deshabilitado. Si se establece en <strong lang=\"en\">true</strong>, el componente se vuelve inactivo y el usuario no puede interactuar con él.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contiene texto o una matriz de errores que deben mostrarse al usuario. Si hay errores, se muestran debajo del componente.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Matriz de atributos que no deben renderizarse para este componente. Útil para excluir atributos innecesarios del <strong lang=\"en\">DOM</strong> final.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Texto de ayuda que se muestra debajo del componente. Proporciona al usuario información o instrucciones adicionales.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Establece el <strong lang=\"en\">ID HTML</strong> del elemento. Se puede utilizar para identificar de manera única el componente en la página.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "El identificador del componente, que se puede utilizar para rastrear o hacer referencia al componente en el código.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefijo para el <strong lang=\"en\">ID</strong> del componente. Se utiliza para crear un identificador único basado en el prefijo especificado.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Un objeto de atributos que se aplican directamente al elemento de entrada. Permite agregar o personalizar atributos adicionales de entrada.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "Clase(s) <strong lang=\"en\">CSS</strong> aplicada(s) al elemento de entrada. Permite diseñar el componente según sus requisitos.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Determina si el componente debe estar oculto. Si se establece en <strong lang=\"en\">true</strong>, el componente no se muestra en la página.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indica si el componente debe renderizarse. Si se establece en <strong lang=\"en\">false</strong>, el componente no se creará en el <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "Clase(s) <strong lang=\"en\">CSS</strong> aplicada(s) a la etiqueta. Permite personalizar el estilo de la etiqueta.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Texto de la etiqueta que se muestra junto al componente. Generalmente se usa para describir el propósito del elemento de entrada.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Etiqueta destinada a lectores de pantalla. Útil para mejorar la accesibilidad.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Determina las dependencias del modelo que pueden afectar la visibilidad o el comportamiento del componente.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "El valor que se utiliza para restablecer el modelo a un estado indefinido. Útil para borrar el valor del modelo.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "El valor actual del modelo asociado con el componente. Se utiliza para gestionar los datos mostrados en el componente.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indica si el componente es obligatorio. Si se establece en <strong lang=\"en\">true</strong>, el componente requiere la entrada del usuario."
}