{
  "_A_UI_ELEMENT_0_": "Élément 0",
  "_A_UI_ELEMENT_1_": "Élément 1",
  "_A_UI_ELEMENT_2_": "Élément 2",
  "_A_UI_ELEMENT_3_": "Élément 3",
  "_A_UI_ELEMENT_4_": "Élément 4",
  "_A_UI_ELEMENT_5_": "Élément 5",
  "_A_UI_ELEMENT_6_": "Élément 6",
  "_A_UI_ELEMENT_7_": "Élément 7",
  "_A_UI_ELEMENT_8_": "Élément 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Événement déclenché lorsque la composante perd le focus. Utilisé pour valider ou enregistrer les données lorsque l'utilisateur quitte le champ.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Événement déclenché lorsque la composante reçoit le focus. Utile pour suivre l'interaction de l'utilisateur avec l'élément.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "Événement qui se déclenche lorsque l'utilisateur effectue une recherche en dehors du composant, par exemple via une <strong lang=\"en\">API</strong> ou une autre source de données externe. Cet événement permet de traiter le résultat de la recherche et de mettre à jour les données du composant.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "L'événement se déclenche lorsque l'utilisateur réduit ou agrandit un groupe d'éléments.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "Événement qui se déclenche lors de la mise à jour des données du composant. Il peut être utilisé pour effectuer des actions après que les données ont été modifiées ou mises à jour, telles que le tri ou le filtrage des éléments.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Événement déclenché lorsque la valeur du modèle de la composante est mise à jour. Utilisé pour synchroniser les données entre la composante et la composante parente.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "Dans cet exemple, la fonction <strong lang=\"en\">change</strong> est responsable de la mise à jour du modèle du composant. La fonction prend trois arguments : le modèle <strong lang=\"en\">model</strong>, l'identifiant du composant <strong lang=\"en\">id</strong> et tous les <strong lang=\"en\">props</strong> passés. Cette approche permet de gérer les changements de modèle de manière flexible et d'effectuer des actions supplémentaires, comme la journalisation ou la validation.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Fonction de modification du modèle",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">class-column-default</strong>. Cela permet de définir des classes <strong lang=\"en\">CSS</strong> pour tous les éléments enfants dans <strong lang=\"en\">children</strong>, si un élément spécifique n'a pas sa propre classe. Dans l'exemple, la classe <strong lang=\"en\">a_column a_column_12</strong> est explicitement définie pour le premier élément, tandis que les autres utiliseront la classe définie dans <strong lang=\"en\">class-column</strong> de la composante.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "Classe pour les éléments enfants",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">class-columns</strong> pour gérer les classes <strong lang=\"en\">CSS</strong> du conteneur parent où les éléments enfants sont affichés. Ces classes permettent de configurer la grille, les marges et le comportement des colonnes en fonction de l'appareil.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "Classes pour le conteneur parent",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">collapsible</strong> et <strong lang=\"en\">is-collapsed</strong> dans le composant. La propriété <strong lang=\"en\">collapsible</strong> permet de rendre le groupe d'éléments réductible, tandis que <strong lang=\"en\">is-collapsed</strong> définit l'état initial de réduction. L'exemple montre également l'utilisation de l'événement <strong lang=\"en\">toggle-collapse</strong>, qui se déclenche lors de la réduction ou de l'agrandissement du groupe.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "Réduire/Agrandir",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">data-extra</strong> dans le composant. Dans le premier exemple, les données supplémentaires sont passées sous forme de tableau de tableaux, où chaque tableau contient un identifiant et un nom d'élément. Dans le deuxième exemple, les données supplémentaires sont passées sous forme de tableau d'objets. Les deux approches permettent de gérer de manière flexible la liste des éléments disponibles pour la sélection.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "Données supplémentaires",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">errors-all</strong> pour passer un objet contenant des erreurs pour les éléments enfants spécifiés dans <strong lang=\"en\">children</strong>. Chaque élément enfant peut avoir son propre message d'erreur qui s'affiche en cas d'échec de la validation.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "Erreurs pour les éléments enfants",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">errors</strong> pour afficher des messages d'erreur sous le champ de saisie. Les messages d'erreur aident l'utilisateur à comprendre quelles données ont été saisies incorrectement et comment les corriger.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Affichage des Erreurs",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">key-group</strong> et <strong lang=\"en\">key-group-label-callback</strong> pour regrouper les éléments et personnaliser les noms de groupes dans le composant. Dans le premier cas, un groupement simple est utilisé par les clés <strong lang=\"en\">alohaBR</strong> et <strong lang=\"en\">aloha</strong>. Dans le deuxième exemple, la fonction de rappel <strong lang=\"en\">key-group-label-callback</strong> est en outre appliquée pour définir dynamiquement les noms des groupes en fonction des données.",
  "_A_UI_GROUP_GROUP_HEADER_": "Groupement des éléments",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">has-border</strong> pour contrôler l'affichage de la bordure. Dans le premier exemple, la bordure est activée, ce qui rend les éléments plus visibles. Dans le deuxième exemple, la bordure est désactivée, ce qui donne aux éléments un aspect plus minimaliste.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "Afficher les bordures",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">help-text</strong> pour ajouter un texte d'aide sous le champ de saisie. Le texte d'aide fournit des informations supplémentaires à l'utilisateur sur les données attendues dans ce champ.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Texte d'Aide",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">inline</strong> pour afficher les éléments en ligne.",
  "_A_UI_GROUP_INLINE_HEADER_": "En ligne",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">is-button-group</strong> et <strong lang=\"en\">class-button-group-default</strong> dans le composant. La première propriété permet d'afficher les éléments sous forme de groupe de boutons, créant ainsi une interface plus interactive. La deuxième propriété personnalise l'apparence du groupe de boutons en définissant une classe de style.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "Groupe de boutons",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">is-data-simple-array</strong> pour travailler avec un tableau simple de chaînes. Les données sont présentées sous forme de tableau de chaînes, où chaque chaîne est un élément distinct de la liste. Cela simplifie le processus d'affichage et de gestion des éléments sans avoir besoin d'utiliser des objets.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Tableau simple de données",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">is-label-float</strong> pour contrôler le comportement de l'étiquette dans le champ de saisie. Si la valeur de la propriété est définie sur <strong lang=\"en\">false</strong>, l'étiquette reste statique. Si la valeur est définie sur <strong lang=\"en\">true</strong>, l'étiquette se déplace au-dessus du champ de saisie lorsque l'utilisateur commence à taper ou lorsque le champ reçoit le focus.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Étiquette Flottante",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">is-width-auto</strong> pour contrôler la largeur des éléments. Avec une valeur de <strong lang=\"en\">true</strong>, la largeur des éléments s'ajuste automatiquement au contenu. Avec une valeur de <strong lang=\"en\">false</strong>, la largeur des éléments est fixe et déterminée par les styles ou le conteneur parent.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "Largeur automatique",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">key-disabled</strong> pour désactiver certains éléments dans le composant. Cela permet de gérer de manière flexible la disponibilité des éléments en fonction des données.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "Désactivation des éléments individuels",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">key-label-callback</strong> pour générer dynamiquement des étiquettes pour les éléments. La fonction transmise comme valeur reçoit les données de l'élément et renvoie une chaîne qui sera utilisée comme étiquette.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "Fonction pour configurer les étiquettes",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">key-title</strong> et <strong lang=\"en\">key-title-callback</strong> pour définir les titres des éléments. Dans le premier cas, le titre de chaque élément est défini statiquement via la propriété <strong lang=\"en\">key-title</strong>. Dans le deuxième exemple, le titre est généré dynamiquement à l'aide de la fonction <strong lang=\"en\">key-title-callback</strong>, qui reçoit les données de l'élément et renvoie une chaîne à afficher.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "Configuration des titres",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">label-screen-reader</strong>. Il permet de définir une étiquette cachée qui ne sera visible que pour les lecteurs d'écran.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "Étiquette pour lecteur d'écran",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">search</strong> pour ajouter une fonctionnalité de recherche dans les éléments du composant. Cette fonctionnalité permet aux utilisateurs de trouver facilement les éléments souhaités dans un grand ensemble de données.",
  "_A_UI_GROUP_SEARCH_HEADER_": "Recherche dans les éléments",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">sort-order</strong> pour définir l'ordre de tri des éléments. Dans le premier cas, aucun ordre de tri n'est spécifié, dans le deuxième les éléments sont triés par ordre croissant (<strong lang=\"en\">asc</strong>), et dans le troisième par ordre décroissant (<strong lang=\"en\">desc</strong>). Cela permet de personnaliser l'affichage des éléments dans l'ordre souhaité.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">sort-order-group</strong> pour définir l'ordre de tri des groupes d'éléments. Dans le premier cas, aucun ordre de tri n'est spécifié, dans le deuxième les groupes sont triés par ordre croissant (<strong lang=\"en\">asc</strong>), et dans le troisième par ordre décroissant (<strong lang=\"en\">desc</strong>). Cela permet de personnaliser l'affichage des groupes d'éléments dans l'ordre souhaité.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "Ordre de tri des groupes",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "Ordre de tri",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">translate-data</strong> dans le composant. Les données fournies contiennent des étiquettes avec des clés qui sont automatiquement traduites en fonction des paramètres de localisation. Cela permet d'afficher des valeurs traduites en fonction de la langue sélectionnée.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "Éléments traduisibles",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "Cet exemple montre comment utiliser <strong lang=\"en\">class-data-parent</strong> pour définir des classes <strong lang=\"en\">CSS</strong> qui contrôlent la disposition des éléments. Dans le premier exemple, les éléments sont disposés en deux colonnes à l'aide des classes <strong lang=\"en\">a_list_columns a_list_columns_2</strong>. Dans le deuxième exemple, des classes supplémentaires sont utilisées pour une visualisation adaptable sur différentes résolutions d'écran, telles que <strong lang=\"en\">desktop</strong>, <strong lang=\"en\">widescreen</strong> et <strong lang=\"en\">fullhd</strong>.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "En deux colonnes",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "Un identifiant unique pour enregistrer les données obtenues via une <strong lang=\"en\">API</strong>. Cela peut être utile pour la mise en cache ou la réutilisation des données au sein d'une même session.",
  "_A_UI_PROPS_AUTOCOMPLETE_DESCRIPTION_": "Spécifie si le champ doit prendre en charge la complétion automatique, similaire à l'attribut <strong lang=\"en\">autocomplete</strong> en <strong lang=\"en\">HTML</strong>.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Fonction appelée lorsque le modèle change. Elle accepte la nouvelle valeur du modèle et des paramètres supplémentaires pour traiter le changement.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "Un tableau d'éléments enfants qui seront rendus à l'intérieur de la composante. Chaque élément du tableau représente un objet avec des paramètres tels que <strong lang=\"en\">type</strong>, <strong lang=\"en\">label</strong>, <strong lang=\"en\">id</strong> et d'autres propriétés pour configurer et afficher l'élément enfant.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "Classes <strong lang=\"en\">CSS</strong> appliquées par défaut aux boutons du groupe. Ces classes peuvent être utilisées pour styliser les boutons dans un groupe de cases à cocher ou de boutons radio.",
  "_A_UI_PROPS_CLASS_COLUMN_DEFAULT_DESCRIPTION_": "Définit une classe <strong lang=\"en\">CSS</strong> pour tous les éléments enfants, si la classe <strong lang=\"en\">classColumn</strong> n'est pas définie individuellement dans le tableau <strong lang=\"en\">children</strong>. Cela permet de gérer facilement l'affichage de tous les éléments enfants simultanément.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "Classes <strong lang=\"en\">CSS</strong> qui seront appliquées au conteneur contenant les éléments enfants du prop <strong lang=\"en\">children</strong>. Ces classes contrôlent le nombre de colonnes, les espacements entre elles et leur comportement adaptatif.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "Classes <strong lang=\"en\">CSS</strong> appliquées au conteneur parent des données. Cela permet de personnaliser l'apparence du conteneur qui contient les éléments de données.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "Classes <strong lang=\"en\">CSS</strong> appliquées à la balise <strong lang=\"en\">fieldset</strong> contenant un groupe de contrôles. Permet de personnaliser l'apparence du groupe d'éléments du formulaire.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Spécifie la classe <strong lang=\"en\">CSS</strong> qui sera appliquée au bouton d'effacement. Cela permet de personnaliser l'apparence du bouton selon les exigences de conception.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "Un tableau de données utilisé pour générer des éléments.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "Un tableau supplémentaire de données qui peut être utilisé pour afficher des éléments supplémentaires qui ne sont pas inclus dans le tableau de données principal.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Spécifie les dépendances qui peuvent affecter la visibilité ou le comportement de la composante en fonction des valeurs d'autres éléments.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Détermine si la composante est désactivée. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante devient inactive et l'utilisateur ne peut pas interagir avec elle.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "Un objet contenant des erreurs pour tous les éléments enfants passés via <strong lang=\"en\">children</strong>. Chaque erreur doit être spécifiée pour l'élément correspondant en utilisant son <strong lang=\"en\">id</strong>.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contient un texte ou un tableau d'erreurs devant être affiché à l'utilisateur. Si des erreurs sont présentes, elles sont affichées sous la composante.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Tableau d'attributs qui ne doivent pas être rendus pour cette composante. Utile pour exclure les attributs inutiles du <strong lang=\"en\">DOM</strong> final.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "Indique si l'élément aura une bordure. Si défini sur <strong lang=\"en\">true</strong>, une bordure sera affichée autour de l'élément.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Texte d'aide affiché sous la composante. Fournit à l'utilisateur des informations ou des instructions supplémentaires.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Définit l'<strong lang=\"en\">ID HTML</strong> de l'élément. Peut être utilisé pour identifier de manière unique la composante sur la page.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "L'identifiant de la composante, qui peut être utilisé pour suivre ou référencer la composante dans le code.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Préfixe pour l'<strong lang=\"en\">ID</strong> de la composante. Utilisé pour créer un identifiant unique basé sur le préfixe spécifié.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Un objet d'attributs appliqués directement à l'élément d'entrée. Permet d'ajouter ou de personnaliser des attributs d'entrée supplémentaires.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "Classe(s) <strong lang=\"en\">CSS</strong> appliquée(s) à l'élément d'entrée. Permet de styliser la composante selon vos besoins.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Détermine si le bouton d'effacement doit être affiché. Si <strong lang=\"en\">true</strong>, un bouton sera affiché à côté du champ de texte, permettant à l'utilisateur de vider son contenu.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Indique si le tableau de données est un tableau simple de valeurs. Si défini sur <strong lang=\"en\">true</strong>, chaque élément du tableau sera considéré comme une valeur simple sans clés.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Détermine si la composante doit être cachée. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante n'est pas affichée sur la page.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Détermine si l'étiquette du composant doit être positionnée au-dessus du champ. Si <strong lang=\"en\">true</strong>, l'étiquette se déplacera au-dessus du champ de texte lors de la mise au point ou lorsque du contenu est présent.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indique si la composante doit être rendue. Si la valeur est définie sur <strong lang=\"en\">false</strong>, la composante ne sera pas créée dans le <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "Indique la clé dans l'objet de données qui détermine si l'élément est désactivé (non sélectionnable).",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "Clé ou tableau de clés utilisé pour regrouper les données par catégories spécifiques. Cette propriété permet de regrouper les éléments en groupes.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "Une fonction de rappel qui reçoit deux arguments <strong lang=\"en\">({ group, item })</strong> et renvoie le nom du groupe. Utilisé pour définir dynamiquement les noms de groupes en fonction des données fournies.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "La clé dans l'objet de données utilisée comme identifiant pour chaque élément.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "Une fonction de rappel utilisée pour générer le texte de l'étiquette en fonction des données de l'élément. Cela permet de créer des étiquettes dynamiquement en fonction d'une logique complexe.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "La clé dans l'objet de données qui détermine le texte de l'étiquette pour chaque élément.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "Une fonction de rappel utilisée pour générer le titre en fonction des données de l'élément. Cela permet de créer des titres dynamiquement en fonction d'une logique complexe.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "La clé dans l'objet de données qui détermine le titre de chaque élément.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "Classe(s) <strong lang=\"en\">CSS</strong> appliquée(s) à l'étiquette. Permet de personnaliser le style de l'étiquette.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Texte de l'étiquette affiché à côté de la composante. Utilisé généralement pour décrire l'objectif de l'élément d'entrée.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Étiquette destinée aux lecteurs d'écran. Utile pour améliorer l'accessibilité.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "Indique si l'élément est en état de chargement. Si défini sur <strong lang=\"en\">true</strong>, l'élément affiche un indicateur de chargement.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Définit le nombre maximum de caractères pouvant être saisis dans le champ. Si cette limite est dépassée, toute saisie supplémentaire sera interdite.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Détermine les dépendances du modèle qui peuvent affecter la visibilité ou le comportement de la composante.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "La valeur utilisée pour réinitialiser le modèle à un état indéfini. Utile pour effacer la valeur du modèle.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "La valeur actuelle du modèle associée à la composante. Utilisée pour gérer les données affichées dans la composante.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Spécifie le texte de l'espace réservé qui sera affiché dans le champ de saisie jusqu'à ce que l'utilisateur entre des données. L'espace réservé aide l'utilisateur à comprendre quelles données sont attendues dans le champ.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indique si la composante est obligatoire. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante nécessite une entrée utilisateur.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "Indique si la recherche d'éléments sera effectuée à l'aide d'une <strong lang=\"en\">API</strong>. Si défini sur <strong lang=\"en\">true</strong>, les données seront chargées à partir du serveur au fur et à mesure de la saisie de la requête.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "La clé utilisée pour effectuer la recherche via une <strong lang=\"en\">API</strong>. Il s'agit généralement d'un paramètre transmis dans la requête au serveur pour filtrer les données.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "Indique si la fonction de recherche sera prise en charge. Si défini sur <strong lang=\"en\">true</strong>, les utilisateurs pourront rechercher des éléments au sein du groupe.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "Indique si la recherche sera effectuée en dehors du composant, par exemple via une <strong lang=\"en\">API</strong> ou une autre source de données externe.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "Définit le délai en millisecondes avant d'effectuer la recherche. Utile pour éviter les requêtes excessives lorsque l'utilisateur saisit du texte rapidement.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "Le nom de la fente qui sera ajoutée après le contenu principal du composant. Cela permet d'étendre la fonctionnalité du composant en ajoutant du contenu personnalisé.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "Le nom de la fente principale utilisée pour insérer du contenu personnalisé dans le composant.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "Détermine l'ordre de tri des éléments. Valeurs possibles : <strong lang=\"en\">asc</strong> (croissant) ou <strong lang=\"en\">desc</strong> (décroissant).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "Détermine l'ordre de tri des groupes si les éléments sont regroupés. Valeurs possibles : <strong lang=\"en\">asc</strong> (croissant) ou <strong lang=\"en\">desc</strong> (décroissant).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "Indique si les données doivent être traduites avant d'être affichées. Si défini sur <strong lang=\"en\">true</strong>, les valeurs textuelles seront traduites en fonction des paramètres de langue actuels.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "L'adresse <strong lang=\"en\">URL</strong> à partir de laquelle la source de données externe sera chargée pour remplir les cases à cocher ou les boutons radio.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "Les paramètres qui seront ajoutés à la requête <strong lang=\"en\">URL</strong> lors du chargement des données à partir du serveur. Ces paramètres permettent de filtrer ou de modifier les données obtenues via l'<strong lang=\"en\">API</strong>.",
  "_A_UI_TYPES_FOR_USE_": "Types disponibles à utiliser."
}