{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Événement déclenché lorsque la composante perd le focus. Utilisé pour valider ou enregistrer les données lorsque l'utilisateur quitte le champ.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Événement déclenché lorsque la composante reçoit le focus. Utile pour suivre l'interaction de l'utilisateur avec l'élément.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Événement déclenché lorsque la valeur du modèle de la composante est mise à jour. Utilisé pour synchroniser les données entre la composante et la composante parente.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "Dans cet exemple, la fonction <strong lang=\"en\">change</strong> est responsable de la mise à jour du modèle du composant. La fonction prend trois arguments : le modèle <strong lang=\"en\">model</strong>, l'identifiant du composant <strong lang=\"en\">id</strong> et tous les <strong lang=\"en\">props</strong> passés. Cette approche permet de gérer les changements de modèle de manière flexible et d'effectuer des actions supplémentaires, comme la journalisation ou la validation.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Fonction de modification du modèle",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Fonction appelée lorsque le modèle change. Elle accepte la nouvelle valeur du modèle et des paramètres supplémentaires pour traiter le changement.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Spécifie la classe <strong lang=\"en\">CSS</strong> qui sera appliquée au bouton d'effacement. Cela permet de personnaliser l'apparence du bouton selon les exigences de conception.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Spécifie les dépendances qui peuvent affecter la visibilité ou le comportement de la composante en fonction des valeurs d'autres éléments.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Détermine si la composante est désactivée. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante devient inactive et l'utilisateur ne peut pas interagir avec elle.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contient un texte ou un tableau d'erreurs devant être affiché à l'utilisateur. Si des erreurs sont présentes, elles sont affichées sous la composante.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Tableau d'attributs qui ne doivent pas être rendus pour cette composante. Utile pour exclure les attributs inutiles du <strong lang=\"en\">DOM</strong> final.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Texte d'aide affiché sous la composante. Fournit à l'utilisateur des informations ou des instructions supplémentaires.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Définit l'<strong lang=\"en\">ID HTML</strong> de l'élément. Peut être utilisé pour identifier de manière unique la composante sur la page.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "L'identifiant de la composante, qui peut être utilisé pour suivre ou référencer la composante dans le code.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Préfixe pour l'<strong lang=\"en\">ID</strong> de la composante. Utilisé pour créer un identifiant unique basé sur le préfixe spécifié.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Un objet d'attributs appliqués directement à l'élément d'entrée. Permet d'ajouter ou de personnaliser des attributs d'entrée supplémentaires.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "Classe(s) <strong lang=\"en\">CSS</strong> appliquée(s) à l'élément d'entrée. Permet de styliser la composante selon vos besoins.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Détermine si le bouton d'effacement doit être affiché. Si <strong lang=\"en\">true</strong>, un bouton sera affiché à côté du champ de texte, permettant à l'utilisateur de vider son contenu.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Détermine si la composante doit être cachée. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante n'est pas affichée sur la page.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Détermine si l'étiquette du composant doit être positionnée au-dessus du champ. Si <strong lang=\"en\">true</strong>, l'étiquette se déplacera au-dessus du champ de texte lors de la mise au point ou lorsque du contenu est présent.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indique si la composante doit être rendue. Si la valeur est définie sur <strong lang=\"en\">false</strong>, la composante ne sera pas créée dans le <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "Classe(s) <strong lang=\"en\">CSS</strong> appliquée(s) à l'étiquette. Permet de personnaliser le style de l'étiquette.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Texte de l'étiquette affiché à côté de la composante. Utilisé généralement pour décrire l'objectif de l'élément d'entrée.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Étiquette destinée aux lecteurs d'écran. Utile pour améliorer l'accessibilité.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Définit le nombre maximum de caractères pouvant être saisis dans le champ. Si cette limite est dépassée, toute saisie supplémentaire sera interdite.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Détermine les dépendances du modèle qui peuvent affecter la visibilité ou le comportement de la composante.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "La valeur utilisée pour réinitialiser le modèle à un état indéfini. Utile pour effacer la valeur du modèle.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "La valeur actuelle du modèle associée à la composante. Utilisée pour gérer les données affichées dans la composante.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indique si la composante est obligatoire. Si la valeur est définie sur <strong lang=\"en\">true</strong>, la composante nécessite une entrée utilisateur."
}