{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Događaj koji se aktivira kada komponenta izgubi fokus. Koristi se za provjeru ili spremanje podataka kada korisnik napusti polje.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Događaj koji se aktivira kada komponenta dobije fokus. Korisno za praćenje interakcije korisnika s elementom.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Događaj koji se aktivira kada se ažurira vrijednost modela komponente. Koristi se za sinkronizaciju podataka između komponente i roditeljske komponente.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funkcija koja se poziva kada se model promijeni. Prihvaća novu vrijednost modela i dodatne parametre za obradu promjene.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Određuje ovisnosti koje mogu utjecati na vidljivost ili ponašanje komponente na temelju vrijednosti drugih elemenata.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Određuje je li komponenta onemogućena. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta postaje neaktivna i korisnik ne može komunicirati s njom.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Sadrži tekst ili niz pogrešaka koje treba prikazati korisniku. Ako postoje pogreške, one se prikazuju ispod komponente.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Niz atributa koji se ne bi trebali prikazivati za ovu komponentu. Korisno za isključivanje nepotrebnih atributa iz konačnog <strong lang=\"en\">DOM-a</strong>.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Pomoćni tekst prikazan ispod komponente. Korisniku pruža dodatne informacije ili upute.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Postavlja <strong lang=\"en\">HTML ID</strong> elementa. Može se koristiti za jedinstvenu identifikaciju komponente na stranici.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Identifikator komponente koji se može koristiti za praćenje ili pozivanje na komponentu u kodu.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefiks za <strong lang=\"en\">ID</strong> komponente. Koristi se za stvaranje jedinstvenog identifikatora na temelju zadanog prefiksa.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Objekt atributa primijenjen izravno na ulazni element. Omogućuje dodavanje ili prilagodbu dodatnih atributa unosa.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-klasa(e) primijenjena(e) na ulazni element. Omogućuje stiliziranje komponente prema vašim zahtjevima.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Određuje treba li komponenta biti skrivena. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta se ne prikazuje na stranici.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Naznačuje treba li komponenta biti prikazana. Ako je postavljeno na <strong lang=\"en\">false</strong>, komponenta neće biti stvorena u <strong lang=\"en\">DOM-u</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-klasa(e) primijenjena(e) na oznaku. Omogućuje prilagodbu stila oznake.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Tekst oznake prikazan pored komponente. Obično se koristi za opisivanje svrhe ulaznog elementa.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Oznaka namijenjena za čitače ekrana. Korisno za poboljšanje pristupačnosti.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Određuje ovisnosti modela koje mogu utjecati na vidljivost ili ponašanje komponente.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Vrijednost koja se koristi za vraćanje modela u neodređeno stanje. Korisno za brisanje vrijednosti modela.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Trenutna vrijednost modela povezana s komponentom. Koristi se za upravljanje podacima prikazanim u komponenti.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Naznačuje je li komponenta obvezna. Ako je postavljeno na <strong lang=\"en\">true</strong>, komponenta zahtijeva unos korisnika."
}