{
  "_A_UI_ELEMENT_0_": "Elemento 0",
  "_A_UI_ELEMENT_1_": "Elemento 1",
  "_A_UI_ELEMENT_2_": "Elemento 2",
  "_A_UI_ELEMENT_3_": "Elemento 3",
  "_A_UI_ELEMENT_4_": "Elemento 4",
  "_A_UI_ELEMENT_5_": "Elemento 5",
  "_A_UI_ELEMENT_6_": "Elemento 6",
  "_A_UI_ELEMENT_7_": "Elemento 7",
  "_A_UI_ELEMENT_8_": "Elemento 8",
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Evento attivato quando la componente perde il focus. Usato per verificare o salvare i dati quando l'utente esce dal campo.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Evento attivato quando la componente ottiene il focus. Utile per monitorare l'interazione dell'utente con l'elemento.",
  "_A_UI_EVENTS_ON_SEARCH_OUTSIDE_DESCRIPTION_": "Evento che viene attivato quando l'utente esegue una ricerca al di fuori del componente, ad esempio tramite un'<strong lang=\"en\">API</strong> o un'altra fonte di dati esterna. Questo evento consente di elaborare il risultato della ricerca e aggiornare i dati del componente.",
  "_A_UI_EVENTS_TOGGLE_COLLAPSE_DESCRIPTION_": "L'evento viene attivato quando l'utente comprime o espande un gruppo di elementi.",
  "_A_UI_EVENTS_UPDATE_DATA_DESCRIPTION_": "Evento che viene attivato durante l'aggiornamento dei dati del componente. Può essere utilizzato per eseguire azioni dopo che i dati sono stati modificati o aggiornati, come ad esempio riordinare o filtrare nuovamente gli elementi.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Evento attivato quando il valore del modello della componente viene aggiornato. Usato per sincronizzare i dati tra la componente e la componente principale.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "In questo esempio, la funzione <strong lang=\"en\">change</strong> è responsabile dell'aggiornamento del modello del componente. La funzione accetta tre argomenti: il modello <strong lang=\"en\">model</strong>, l'identificatore del componente <strong lang=\"en\">id</strong> e tutti i <strong lang=\"en\">props</strong> passati. Questo approccio consente di gestire le modifiche al modello in modo flessibile ed eseguire azioni aggiuntive, come il logging o la validazione.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Funzione di modifica del modello",
  "_A_UI_GROUP_CLASS_COLUMN_DESCRIPTION_": "In questo esempio viene mostrato come utilizzare <strong lang=\"en\">class-column</strong>. Permette di assegnare classi <strong lang=\"en\">CSS</strong> a tutti gli elementi figli in <strong lang=\"en\">children</strong>, se un elemento specifico non ha una classe definita. Nell'esempio, il primo elemento ha esplicitamente la classe <strong lang=\"en\">a_column a_column_12</strong>, mentre gli altri useranno la classe specificata in <strong lang=\"en\">class-column</strong> del componente.",
  "_A_UI_GROUP_CLASS_COLUMN_HEADER_": "Classe per elementi figli",
  "_A_UI_GROUP_CLASS_COLUMNS_DESCRIPTION_": "In questo esempio viene mostrato come utilizzare <strong lang=\"en\">class-columns</strong> per gestire le classi <strong lang=\"en\">CSS</strong> del contenitore principale in cui vengono visualizzati gli elementi figli. Queste classi consentono di personalizzare la griglia, i margini e il comportamento delle colonne in base al dispositivo.",
  "_A_UI_GROUP_CLASS_COLUMNS_HEADER_": "Classi per il contenitore principale",
  "_A_UI_GROUP_COLLAPSE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">collapsible</strong> e <strong lang=\"en\">is-collapsed</strong> nel componente. La proprietà <strong lang=\"en\">collapsible</strong> consente di rendere il gruppo di elementi comprimibile, mentre <strong lang=\"en\">is-collapsed</strong> imposta lo stato iniziale di compressione. Viene inoltre mostrato l'uso dell'evento <strong lang=\"en\">toggle-collapse</strong>, che viene attivato quando il gruppo viene compresso o espanso.",
  "_A_UI_GROUP_COLLAPSE_HEADER_": "Comprimi/Espandi",
  "_A_UI_GROUP_DATA_EXTRA_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">data-extra</strong> nel componente. Nel primo esempio, i dati aggiuntivi vengono passati come un array di array, dove ogni array contiene un identificatore e un nome dell'elemento. Nel secondo esempio, i dati aggiuntivi vengono passati come un array di oggetti. Entrambi gli approcci consentono una gestione flessibile dell'elenco degli elementi disponibili per la selezione.",
  "_A_UI_GROUP_DATA_EXTRA_HEADER_": "Dati aggiuntivi",
  "_A_UI_GROUP_ERRORS_ALL_DESCRIPTION_": "In questo esempio viene mostrato come utilizzare <strong lang=\"en\">errors-all</strong> per passare un oggetto con errori per gli elementi figli specificati in <strong lang=\"en\">children</strong>. È possibile fornire un messaggio di errore personalizzato per ciascun elemento figlio, che verrà visualizzato se la validazione fallisce.",
  "_A_UI_GROUP_ERRORS_ALL_HEADER_": "Errori per elementi figli",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">errors</strong> per visualizzare messaggi di errore sotto il campo di input. I messaggi di errore aiutano l'utente a capire quali dati sono stati inseriti in modo errato e come correggerli.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Visualizzazione degli Errori",
  "_A_UI_GROUP_GROUP_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-group</strong> e <strong lang=\"en\">key-group-label-callback</strong> per raggruppare elementi e personalizzare i nomi dei gruppi nel componente. Nel primo caso viene utilizzato un raggruppamento semplice per le chiavi <strong lang=\"en\">alohaBR</strong> e <strong lang=\"en\">aloha</strong>. Nel secondo esempio viene inoltre applicata la funzione di callback <strong lang=\"en\">key-group-label-callback</strong> per determinare dinamicamente i nomi dei gruppi in base ai dati.",
  "_A_UI_GROUP_GROUP_HEADER_": "Raggruppamento di elementi",
  "_A_UI_GROUP_HAS_BORDER_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">has-border</strong> per controllare la visualizzazione dei bordi. Nel primo esempio, il bordo è abilitato, il che rende gli elementi più evidenti. Nel secondo esempio, il bordo è disabilitato, conferendo agli elementi un aspetto più minimalista.",
  "_A_UI_GROUP_HAS_BORDER_HEADER_": "Visualizzazione dei bordi",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">help-text</strong> per aggiungere un testo di aiuto sotto il campo di input. Il testo di aiuto fornisce ulteriori informazioni all'utente sui dati previsti in questo campo.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Testo di Aiuto",
  "_A_UI_GROUP_INLINE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">inline</strong> per visualizzare gli elementi in linea.",
  "_A_UI_GROUP_INLINE_HEADER_": "In linea",
  "_A_UI_GROUP_IS_BUTTON_GROUP_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-button-group</strong> e <strong lang=\"en\">class-button-group-default</strong> nel componente. La prima proprietà consente di visualizzare gli elementi come un gruppo di pulsanti, creando un'interfaccia più interattiva. La seconda proprietà personalizza l'aspetto del gruppo di pulsanti impostando una classe di stile.",
  "_A_UI_GROUP_IS_BUTTON_GROUP_HEADER_": "Gruppo di pulsanti",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-data-simple-array</strong> per lavorare con un array semplice di stringhe. I dati sono presentati come un array di stringhe, dove ogni stringa è un elemento separato dell'elenco. Ciò semplifica il processo di visualizzazione e gestione degli elementi senza la necessità di utilizzare oggetti.",
  "_A_UI_GROUP_IS_DATA_SIMPLE_ARRAY_HEADER_": "Array di dati semplice",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-label-float</strong> per controllare il comportamento dell'etichetta nel campo di input. Se il valore della proprietà è impostato su <strong lang=\"en\">false</strong>, l'etichetta rimane statica. Se il valore è impostato su <strong lang=\"en\">true</strong>, l'etichetta si sposta sopra il campo di input quando l'utente inizia a digitare o quando il campo riceve il focus.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Etichetta Fluttuante",
  "_A_UI_GROUP_IS_WIDTH_AUTO_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-width-auto</strong> per controllare la larghezza degli elementi. Con un valore di <strong lang=\"en\">true</strong>, la larghezza degli elementi si adatta automaticamente al contenuto. Con un valore di <strong lang=\"en\">false</strong>, la larghezza degli elementi è fissa e determinata dallo stile o dal contenitore principale.",
  "_A_UI_GROUP_IS_WIDTH_AUTO_HEADER_": "Larghezza automatica",
  "_A_UI_GROUP_KEY_DISABLED_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-disabled</strong> per disattivare determinati elementi nel componente. Ciò consente di gestire in modo flessibile la disponibilità degli elementi in base ai dati.",
  "_A_UI_GROUP_KEY_DISABLED_HEADER_": "Disattivazione di singoli elementi",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-label-callback</strong> per generare dinamicamente le etichette degli elementi. La funzione passata come valore riceve i dati dell'elemento e restituisce una stringa che sarà utilizzata come etichetta.",
  "_A_UI_GROUP_KEY_LABEL_CALLBACK_HEADER_": "Funzione per configurare le etichette",
  "_A_UI_GROUP_KEY_TITLE_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">key-title</strong> e <strong lang=\"en\">key-title-callback</strong> per impostare i titoli degli elementi. Nel primo caso, il titolo di ciascun elemento è impostato staticamente tramite la proprietà <strong lang=\"en\">key-title</strong>. Nel secondo esempio, il titolo viene generato dinamicamente utilizzando la funzione <strong lang=\"en\">key-title-callback</strong>, che riceve i dati dell'elemento e restituisce una stringa da visualizzare.",
  "_A_UI_GROUP_KEY_TITLE_HEADER_": "Impostazione dei titoli",
  "_A_UI_GROUP_LABEL_SCREEN_READER_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">label-screen-reader</strong>. Consente di impostare un'etichetta nascosta che sarà visibile solo ai lettori di schermo.",
  "_A_UI_GROUP_LABEL_SCREEN_READER_HEADER_": "Etichetta per screen reader",
  "_A_UI_GROUP_SEARCH_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">search</strong> per aggiungere la funzionalità di ricerca negli elementi del componente. Questa funzionalità consente agli utenti di trovare facilmente gli elementi desiderati in un ampio insieme di dati.",
  "_A_UI_GROUP_SEARCH_HEADER_": "Ricerca negli elementi",
  "_A_UI_GROUP_SORT_ORDER_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">sort-order</strong> per impostare l'ordine di ordinamento degli elementi. Nel primo caso, non è specificato alcun ordine di ordinamento, nel secondo gli elementi sono ordinati in ordine crescente (<strong lang=\"en\">asc</strong>), mentre nel terzo in ordine decrescente (<strong lang=\"en\">desc</strong>). Ciò consente di personalizzare la visualizzazione degli elementi nell'ordine desiderato.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">sort-order-group</strong> per impostare l'ordine di ordinamento dei gruppi di elementi. Nel primo caso, non è specificato alcun ordine di ordinamento, nel secondo i gruppi sono ordinati in ordine crescente (<strong lang=\"en\">asc</strong>), mentre nel terzo in ordine decrescente (<strong lang=\"en\">desc</strong>). Ciò consente di personalizzare la visualizzazione dei gruppi di elementi nell'ordine desiderato.",
  "_A_UI_GROUP_SORT_ORDER_GROUP_HEADER_": "Ordine di ordinamento dei gruppi",
  "_A_UI_GROUP_SORT_ORDER_HEADER_": "Ordine di ordinamento",
  "_A_UI_GROUP_TRANSLATE_DATA_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">translate-data</strong> nel componente. I dati forniti contengono etichette con chiavi che vengono automaticamente tradotte in base alle impostazioni di localizzazione. Ciò consente di visualizzare valori tradotti in base alla lingua selezionata.",
  "_A_UI_GROUP_TRANSLATE_DATA_HEADER_": "Elementi traducibili",
  "_A_UI_GROUP_TWO_COLUMNS_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">class-data-parent</strong> per impostare le classi <strong lang=\"en\">CSS</strong> che controllano il layout degli elementi. Nel primo esempio, gli elementi sono disposti in due colonne utilizzando le classi <strong lang=\"en\">a_list_columns a_list_columns_2</strong>. Nel secondo esempio, vengono utilizzate classi aggiuntive per una visualizzazione adattabile su diverse risoluzioni dello schermo, come <strong lang=\"en\">desktop</strong>, <strong lang=\"en\">widescreen</strong> e <strong lang=\"en\">fullhd</strong>.",
  "_A_UI_GROUP_TWO_COLUMNS_HEADER_": "In due colonne",
  "_A_UI_PROPS_API_SAVE_ID_DESCRIPTION_": "Un identificatore univoco per salvare i dati ottenuti da un'<strong lang=\"en\">API</strong>. Ciò può essere utile per memorizzare nella cache o riutilizzare i dati all'interno di una sessione.",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funzione chiamata quando il modello cambia. Accetta il nuovo valore del modello e parametri aggiuntivi per elaborare la modifica.",
  "_A_UI_PROPS_CHILDREN_DESCRIPTION_": "Un array di elementi figli che verranno renderizzati all'interno del componente. Ogni elemento dell'array rappresenta un oggetto con parametri come <strong lang=\"en\">type</strong>, <strong lang=\"en\">label</strong>, <strong lang=\"en\">id</strong> e altre proprietà per configurare e visualizzare l'elemento figlio.",
  "_A_UI_PROPS_CLASS_BUTTON_GROUP_DEFAULT_DESCRIPTION_": "Classi <strong lang=\"en\">CSS</strong> applicate per impostazione predefinita ai pulsanti nel gruppo. Queste classi possono essere utilizzate per stilizzare i pulsanti in un gruppo di caselle di controllo o di pulsanti di opzione.",
  "_A_UI_PROPS_CLASS_COLUMN_DESCRIPTION_": "Definisce una classe <strong lang=\"en\">CSS</strong> per tutti gli elementi figli, se non è stata definita una <strong lang=\"en\">classColumn</strong> specifica per un elemento nella matrice <strong lang=\"en\">children</strong>. Questo consente di gestire facilmente la visualizzazione di tutti gli elementi figli simultaneamente.",
  "_A_UI_PROPS_CLASS_COLUMNS_DESCRIPTION_": "Classi <strong lang=\"en\">CSS</strong> che verranno applicate al contenitore che ospita gli elementi figli definiti tramite il prop <strong lang=\"en\">children</strong>. Queste classi controllano il numero di colonne, gli spazi tra di esse e il loro comportamento adattivo.",
  "_A_UI_PROPS_CLASS_DATA_PARENT_DESCRIPTION_": "Classi <strong lang=\"en\">CSS</strong> applicate al contenitore principale dei dati. Ciò consente di personalizzare l'aspetto del contenitore in cui sono collocati gli elementi dei dati.",
  "_A_UI_PROPS_CLASS_FIELDSET_DESCRIPTION_": "Classi <strong lang=\"en\">CSS</strong> applicate al tag <strong lang=\"en\">fieldset</strong> che contiene un gruppo di controlli. Consente di personalizzare l'aspetto del gruppo di elementi del modulo.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> che verrà applicata al pulsante di cancellazione. Questo consente di personalizzare l'aspetto del pulsante secondo le esigenze di design.",
  "_A_UI_PROPS_DATA_DESCRIPTION_": "Un array di dati utilizzato per generare elementi.",
  "_A_UI_PROPS_DATA_EXTRA_DESCRIPTION_": "Un array aggiuntivo di dati che può essere utilizzato per visualizzare elementi aggiuntivi non inclusi nell'array di dati principale.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Specifica le dipendenze che possono influenzare la visibilità o il comportamento della componente in base ai valori di altri elementi.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Determina se la componente è disabilitata. Se impostato su <strong lang=\"en\">true</strong>, la componente diventa inattiva e l'utente non può interagire con essa.",
  "_A_UI_PROPS_ERRORS_ALL_DESCRIPTION_": "Un oggetto che contiene errori per tutti gli elementi figli passati tramite <strong lang=\"en\">children</strong>. Ogni errore deve essere associato all'elemento corrispondente utilizzando il suo <strong lang=\"en\">id</strong>.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contiene il testo o un array di errori che devono essere visualizzati all'utente. Se ci sono errori, vengono visualizzati sotto la componente.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Array di attributi che non dovrebbero essere resi per questa componente. Utile per escludere attributi non necessari dal <strong lang=\"en\">DOM</strong> finale.",
  "_A_UI_PROPS_HAS_BORDER_DESCRIPTION_": "Indica se l'elemento avrà un bordo. Se impostato su <strong lang=\"en\">true</strong>, verrà visualizzato un bordo attorno all'elemento.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Testo di aiuto visualizzato sotto la componente. Fornisce all'utente informazioni o istruzioni aggiuntive.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Imposta l'<strong lang=\"en\">HTML ID</strong> dell'elemento. Può essere utilizzato per identificare in modo univoco la componente sulla pagina.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "L'identificatore della componente, che può essere utilizzato per tenere traccia o fare riferimento alla componente nel codice.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefisso per l'<strong lang=\"en\">ID</strong> della componente. Usato per creare un identificatore univoco basato sul prefisso specificato.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Oggetto degli attributi applicati direttamente all'elemento di input. Consente di aggiungere o personalizzare ulteriori attributi di input.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(i) applicata(e) all'elemento di input. Consente di stilizzare la componente in base alle tue esigenze.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Determina se il pulsante di cancellazione deve essere visualizzato. Se <strong lang=\"en\">true</strong>, verrà mostrato un pulsante accanto al campo di testo, consentendo all'utente di cancellarne il contenuto.",
  "_A_UI_PROPS_IS_DATA_SIMPLE_ARRAY_DESCRIPTION_": "Indica se l'array di dati è un array semplice di valori. Se impostato su <strong lang=\"en\">true</strong>, ogni elemento dell'array sarà considerato un valore semplice senza chiavi.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Determina se la componente deve essere nascosta. Se impostato su <strong lang=\"en\">true</strong>, la componente non viene visualizzata sulla pagina.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Determina se l'etichetta del componente deve essere posizionata sopra il campo. Se <strong lang=\"en\">true</strong>, l'etichetta si sposterà sopra il campo di testo quando è focalizzato o quando è presente del contenuto.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indica se la componente deve essere resa. Se impostato su <strong lang=\"en\">false</strong>, la componente non verrà creata nel <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_KEY_DISABLED_DESCRIPTION_": "Indica la chiave nell'oggetto dati che determina se l'elemento è disattivato (non selezionabile).",
  "_A_UI_PROPS_KEY_GROUP_DESCRIPTION_": "Chiave o array di chiavi utilizzati per raggruppare i dati in categorie specifiche. Questa proprietà consente di raggruppare gli elementi in gruppi.",
  "_A_UI_PROPS_KEY_GROUP_LABEL_CALLBACK_DESCRIPTION_": "Una funzione di callback che riceve due argomenti <strong lang=\"en\">({ group, item })</strong> e restituisce il nome del gruppo. Viene utilizzata per determinare dinamicamente i nomi dei gruppi in base ai dati forniti.",
  "_A_UI_PROPS_KEY_ID_DESCRIPTION_": "La chiave nell'oggetto dati che verrà utilizzata come identificatore per ciascun elemento.",
  "_A_UI_PROPS_KEY_LABEL_CALLBACK_DESCRIPTION_": "Una funzione di callback utilizzata per generare il testo dell'etichetta in base ai dati dell'elemento. Ciò consente di creare etichette dinamicamente in base a una logica complessa.",
  "_A_UI_PROPS_KEY_LABEL_DESCRIPTION_": "La chiave nell'oggetto dati che determina il testo dell'etichetta per ciascun elemento.",
  "_A_UI_PROPS_KEY_TITLE_CALLBACK_DESCRIPTION_": "Una funzione di callback utilizzata per generare il titolo in base ai dati dell'elemento. Ciò consente di creare titoli dinamicamente in base a una logica complessa.",
  "_A_UI_PROPS_KEY_TITLE_DESCRIPTION_": "La chiave nell'oggetto dati che determina il titolo per ciascun elemento.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(i) applicata(e) all'etichetta. Consente di personalizzare lo stile dell'etichetta.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Testo dell'etichetta visualizzato accanto alla componente. Tipicamente utilizzato per descrivere lo scopo dell'elemento di input.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Etichetta destinata ai lettori di schermo. Utile per migliorare l'accessibilità.",
  "_A_UI_PROPS_LOADING_DESCRIPTION_": "Indica se l'elemento è in stato di caricamento. Se impostato su <strong lang=\"en\">true</strong>, l'elemento visualizza un indicatore di caricamento.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Imposta il numero massimo di caratteri che possono essere inseriti nel campo. Se questo limite viene superato, ulteriori inserimenti saranno proibiti.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Determina le dipendenze del modello che possono influenzare la visibilità o il comportamento della componente.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Il valore utilizzato per reimpostare il modello in uno stato indefinito. Utile per cancellare il valore del modello.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Il valore corrente del modello associato alla componente. Usato per gestire i dati visualizzati nella componente.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Specifica il testo del segnaposto che verrà visualizzato nel campo di input fino a quando l'utente non inserisce i dati. Il segnaposto aiuta l'utente a capire quali dati sono richiesti nel campo.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indica se la componente è obbligatoria. Se impostato su <strong lang=\"en\">true</strong>, la componente richiede l'input dell'utente.",
  "_A_UI_PROPS_SEARCH_API_DESCRIPTION_": "Indica se la ricerca degli elementi verrà eseguita utilizzando un'<strong lang=\"en\">API</strong>. Se impostato su <strong lang=\"en\">true</strong>, i dati verranno caricati dal server man mano che viene inserita la query.",
  "_A_UI_PROPS_SEARCH_API_KEY_DESCRIPTION_": "La chiave utilizzata per eseguire la ricerca tramite un'<strong lang=\"en\">API</strong>. Di solito è un parametro passato nella richiesta al server per filtrare i dati.",
  "_A_UI_PROPS_SEARCH_DESCRIPTION_": "Indica se la funzione di ricerca sarà supportata. Se impostato su <strong lang=\"en\">true</strong>, gli utenti potranno cercare gli elementi all'interno del gruppo.",
  "_A_UI_PROPS_SEARCH_OUTSIDE_DESCRIPTION_": "Indica se la ricerca verrà eseguita al di fuori del componente, ad esempio tramite un'<strong lang=\"en\">API</strong> o un'altra fonte di dati esterna.",
  "_A_UI_PROPS_SEARCH_TIMEOUT_DESCRIPTION_": "Imposta il tempo di attesa in millisecondi prima di eseguire la ricerca. Utile per evitare richieste eccessive quando l'utente digita rapidamente.",
  "_A_UI_PROPS_SLOT_APPEND_NAME_DESCRIPTION_": "Il nome dello slot che verrà aggiunto dopo il contenuto principale del componente. Ciò consente di estendere la funzionalità del componente aggiungendo contenuti personalizzati.",
  "_A_UI_PROPS_SLOT_NAME_DESCRIPTION_": "Il nome dello slot principale utilizzato per inserire contenuti personalizzati nel componente.",
  "_A_UI_PROPS_SORT_ORDER_DESCRIPTION_": "Determina l'ordine di ordinamento degli elementi. Valori possibili: <strong lang=\"en\">asc</strong> (crescente) o <strong lang=\"en\">desc</strong> (decrescente).",
  "_A_UI_PROPS_SORT_ORDER_GROUP_DESCRIPTION_": "Determina l'ordine di ordinamento dei gruppi se gli elementi sono raggruppati. Valori possibili: <strong lang=\"en\">asc</strong> (crescente) o <strong lang=\"en\">desc</strong> (decrescente).",
  "_A_UI_PROPS_TRANSLATE_DATA_DESCRIPTION_": "Indica se i dati devono essere tradotti prima della visualizzazione. Se impostato su <strong lang=\"en\">true</strong>, i valori testuali verranno tradotti in base alle impostazioni della lingua corrente.",
  "_A_UI_PROPS_URL_DESCRIPTION_": "L'indirizzo <strong lang=\"en\">URL</strong> da cui verrà caricata la fonte di dati esterna per popolare i gruppi di caselle di controllo o pulsanti di opzione.",
  "_A_UI_PROPS_URL_PARAMS_DESCRIPTION_": "I parametri che verranno aggiunti alla richiesta <strong lang=\"en\">URL</strong> durante il caricamento dei dati dal server. Questi parametri consentono di filtrare o modificare i dati ottenuti tramite l'<strong lang=\"en\">API</strong>.",
  "_A_UI_TYPES_FOR_USE_": "Tipi disponibili per l'uso."
}