{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Evento attivato quando la componente perde il focus. Usato per verificare o salvare i dati quando l'utente esce dal campo.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Evento attivato quando la componente ottiene il focus. Utile per monitorare l'interazione dell'utente con l'elemento.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Evento attivato quando il valore del modello della componente viene aggiornato. Usato per sincronizzare i dati tra la componente e la componente principale.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "In questo esempio, la funzione <strong lang=\"en\">change</strong> è responsabile dell'aggiornamento del modello del componente. La funzione accetta tre argomenti: il modello <strong lang=\"en\">model</strong>, l'identificatore del componente <strong lang=\"en\">id</strong> e tutti i <strong lang=\"en\">props</strong> passati. Questo approccio consente di gestire le modifiche al modello in modo flessibile ed eseguire azioni aggiuntive, come il logging o la validazione.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Funzione di modifica del modello",
  "_A_UI_GROUP_ERRORS_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">errors</strong> per visualizzare messaggi di errore sotto il campo di input. I messaggi di errore aiutano l'utente a capire quali dati sono stati inseriti in modo errato e come correggerli.",
  "_A_UI_GROUP_ERRORS_HEADER_": "Visualizzazione degli Errori",
  "_A_UI_GROUP_HELP_TEXT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">help-text</strong> per aggiungere un testo di aiuto sotto il campo di input. Il testo di aiuto fornisce ulteriori informazioni all'utente sui dati previsti in questo campo.",
  "_A_UI_GROUP_HELP_TEXT_HEADER_": "Testo di Aiuto",
  "_A_UI_GROUP_IS_LABEL_FLOAT_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">is-label-float</strong> per controllare il comportamento dell'etichetta nel campo di input. Se il valore della proprietà è impostato su <strong lang=\"en\">false</strong>, l'etichetta rimane statica. Se il valore è impostato su <strong lang=\"en\">true</strong>, l'etichetta si sposta sopra il campo di input quando l'utente inizia a digitare o quando il campo riceve il focus.",
  "_A_UI_GROUP_IS_LABEL_FLOAT_HEADER_": "Etichetta Fluttuante",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Funzione chiamata quando il modello cambia. Accetta il nuovo valore del modello e parametri aggiuntivi per elaborare la modifica.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Specifica la classe <strong lang=\"en\">CSS</strong> che verrà applicata al pulsante di cancellazione. Questo consente di personalizzare l'aspetto del pulsante secondo le esigenze di design.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Specifica le dipendenze che possono influenzare la visibilità o il comportamento della componente in base ai valori di altri elementi.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Determina se la componente è disabilitata. Se impostato su <strong lang=\"en\">true</strong>, la componente diventa inattiva e l'utente non può interagire con essa.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Contiene il testo o un array di errori che devono essere visualizzati all'utente. Se ci sono errori, vengono visualizzati sotto la componente.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Array di attributi che non dovrebbero essere resi per questa componente. Utile per escludere attributi non necessari dal <strong lang=\"en\">DOM</strong> finale.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Testo di aiuto visualizzato sotto la componente. Fornisce all'utente informazioni o istruzioni aggiuntive.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Imposta l'<strong lang=\"en\">HTML ID</strong> dell'elemento. Può essere utilizzato per identificare in modo univoco la componente sulla pagina.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "L'identificatore della componente, che può essere utilizzato per tenere traccia o fare riferimento alla componente nel codice.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Prefisso per l'<strong lang=\"en\">ID</strong> della componente. Usato per creare un identificatore univoco basato sul prefisso specificato.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Oggetto degli attributi applicati direttamente all'elemento di input. Consente di aggiungere o personalizzare ulteriori attributi di input.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(i) applicata(e) all'elemento di input. Consente di stilizzare la componente in base alle tue esigenze.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Determina se il pulsante di cancellazione deve essere visualizzato. Se <strong lang=\"en\">true</strong>, verrà mostrato un pulsante accanto al campo di testo, consentendo all'utente di cancellarne il contenuto.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Determina se la componente deve essere nascosta. Se impostato su <strong lang=\"en\">true</strong>, la componente non viene visualizzata sulla pagina.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Determina se l'etichetta del componente deve essere posizionata sopra il campo. Se <strong lang=\"en\">true</strong>, l'etichetta si sposterà sopra il campo di testo quando è focalizzato o quando è presente del contenuto.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Indica se la componente deve essere resa. Se impostato su <strong lang=\"en\">false</strong>, la componente non verrà creata nel <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong> class(i) applicata(e) all'etichetta. Consente di personalizzare lo stile dell'etichetta.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Testo dell'etichetta visualizzato accanto alla componente. Tipicamente utilizzato per descrivere lo scopo dell'elemento di input.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Etichetta destinata ai lettori di schermo. Utile per migliorare l'accessibilità.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Imposta il numero massimo di caratteri che possono essere inseriti nel campo. Se questo limite viene superato, ulteriori inserimenti saranno proibiti.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Determina le dipendenze del modello che possono influenzare la visibilità o il comportamento della componente.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Il valore utilizzato per reimpostare il modello in uno stato indefinito. Utile per cancellare il valore del modello.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Il valore corrente del modello associato alla componente. Usato per gestire i dati visualizzati nella componente.",
  "_A_UI_PROPS_PLACEHOLDER_DESCRIPTION_": "Specifica il testo del segnaposto che verrà visualizzato nel campo di input fino a quando l'utente non inserisce i dati. Il segnaposto aiuta l'utente a capire quali dati sono richiesti nel campo.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Indica se la componente è obbligatoria. Se impostato su <strong lang=\"en\">true</strong>, la componente richiede l'input dell'utente."
}