{
  "_A_UI_EVENTS_BLUR_DESCRIPTION_": "Событие, которое вызывается, когда компонент теряет фокус. Используется для проверки или сохранения данных при выходе пользователя из поля.",
  "_A_UI_EVENTS_FOCUS_DESCRIPTION_": "Событие, которое вызывается, когда компонент получает фокус. Полезно для отслеживания взаимодействия пользователя с элементом.",
  "_A_UI_EVENTS_UPDATE_MODEL_VALUE_DESCRIPTION_": "Событие, которое вызывается при обновлении значения модели компонента. Используется для синхронизации данных между компонентом и родительским компонентом.",
  "_A_UI_GROUP_CHANGE_DESCRIPTION_": "В данном примере функция <strong lang=\"en\">change</strong> отвечает за обновление модели компонента. Функция принимает три аргумента: модель <strong lang=\"en\">model</strong>, идентификатор компонента <strong lang=\"en\">id</strong> и все переданные <strong lang=\"en\">props</strong>. Этот подход позволяет гибко обрабатывать изменения модели и выполнять дополнительные действия, такие как логирование или валидация.",
  "_A_UI_GROUP_CHANGE_HEADER_": "Функция изменения модели",
  "_A_UI_PROPS_CHANGE_DESCRIPTION_": "Функция, которая вызывается при изменении модели. Она принимает новое значение модели и дополнительные параметры для обработки изменения.",
  "_A_UI_PROPS_CLEAR_BUTTON_CLASS_DESCRIPTION_": "Определяет <strong lang=\"en\">CSS</strong>-класс, который будет применен к кнопке очистки. Это позволяет настроить внешний вид кнопки в соответствии с требованиями дизайна.",
  "_A_UI_PROPS_DEPENDENCIES_DESCRIPTION_": "Задает зависимости, которые могут влиять на видимость или поведение компонента на основе значений других элементов.",
  "_A_UI_PROPS_DISABLED_DESCRIPTION_": "Определяет, отключен ли компонент. Если значение установлено в <strong lang=\"en\">true</strong>, компонент становится неактивным и пользователь не может взаимодействовать с ним.",
  "_A_UI_PROPS_ERRORS_DESCRIPTION_": "Содержит текст или массив ошибок, которые должны быть отображены пользователю. Если есть ошибки, они отображаются под компонентом.",
  "_A_UI_PROPS_EXCLUDE_RENDER_ATTRIBUTES_DESCRIPTION_": "Массив атрибутов, которые не должны рендериться для этого компонента. Полезно для исключения ненужных атрибутов из конечного <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_HELP_TEXT_DESCRIPTION_": "Текст помощи, отображаемый под компонентом. Предоставляет пользователю дополнительную информацию или инструкцию.",
  "_A_UI_PROPS_HTML_ID_DESCRIPTION_": "Задает <strong lang=\"en\">HTML ID</strong> элемента. Может использоваться для уникальной идентификации компонента на странице.",
  "_A_UI_PROPS_ID_DESCRIPTION_": "Идентификатор компонента, который можно использовать для отслеживания или обращения к компоненту в коде.",
  "_A_UI_PROPS_ID_PREFIX_DESCRIPTION_": "Префикс для <strong lang=\"en\">ID</strong> компонента. Используется для создания уникального идентификатора на основе заданного префикса.",
  "_A_UI_PROPS_INPUT_ATTRIBUTES_DESCRIPTION_": "Объект атрибутов, который применяется непосредственно к элементу ввода. Позволяет добавлять или настраивать дополнительные атрибуты ввода.",
  "_A_UI_PROPS_INPUT_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-класс(ы), который применяется к элементу ввода. Позволяет стилизовать компонент в соответствии с вашими требованиями.",
  "_A_UI_PROPS_IS_CLEAR_BUTTON_DESCRIPTION_": "Определяет, должна ли отображаться кнопка очистки. Если <strong lang=\"en\">true</strong>, рядом с текстовым полем будет отображаться кнопка, позволяющая пользователю очистить содержимое.",
  "_A_UI_PROPS_IS_HIDE_DESCRIPTION_": "Определяет, должен ли компонент быть скрыт. Если значение установлено в <strong lang=\"en\">true</strong>, компонент не отображается на странице.",
  "_A_UI_PROPS_IS_LABEL_FLOAT_DESCRIPTION_": "Определяет, должна ли метка компонента располагаться над полем. Если <strong lang=\"en\">true</strong>, метка будет перемещаться выше текстового поля при фокусировке или при наличии содержимого.",
  "_A_UI_PROPS_IS_RENDER_DESCRIPTION_": "Указывает, должен ли компонент быть отрендерен. Если значение установлено в <strong lang=\"en\">false</strong>, компонент не будет создан в <strong lang=\"en\">DOM</strong>.",
  "_A_UI_PROPS_LABEL_CLASS_DESCRIPTION_": "<strong lang=\"en\">CSS</strong>-класс(ы), который применяется к метке. Позволяет настраивать стиль метки компонента.",
  "_A_UI_PROPS_LABEL_DESCRIPTION_": "Текст метки, который отображается рядом с компонентом. Обычно используется для обозначения цели элемента ввода.",
  "_A_UI_PROPS_LABEL_SCREEN_READER_DESCRIPTION_": "Метка, предназначенная для чтения скрин ридером. Полезно для улучшения доступности.",
  "_A_UI_PROPS_MAXLENGTH_DESCRIPTION_": "Устанавливает максимальное количество символов, которое может быть введено в поле. Если это значение превышено, дальнейший ввод символов будет запрещен.",
  "_A_UI_PROPS_MODEL_DEPENDENCIES_DESCRIPTION_": "Определяет зависимости модели, которые могут влиять на видимость или поведение компонента.",
  "_A_UI_PROPS_MODEL_UNDEFINED_DESCRIPTION_": "Значение, которое используется для сброса модели в неопределенное состояние. Полезно для очистки значения модели.",
  "_A_UI_PROPS_MODEL_VALUE_DESCRIPTION_": "Текущее значение модели, связанное с компонентом. Используется для управления данными, отображаемыми в компоненте.",
  "_A_UI_PROPS_REQUIRED_DESCRIPTION_": "Указывает, является ли компонент обязательным для заполнения. Если значение установлено в <strong lang=\"en\">true</strong>, компонент требует ввода данных."
}