{
  "_A_BUTTON_COMPONENT_NAME_": "Schaltfläche",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Wird emittiert, wenn der Button geklickt wird.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>DAS IST MEIN <strong>HTML-TOOLTIP!!!!</strong></div><div>Zweite Zeile</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>DAS IST MEIN <strong>HTML-TOOLTIP!!!!</strong></div><div>Zweite Zeile</div><div>Nummer: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Button als inaktiv darzustellen und die entsprechenden Accessibility-Eigenschaften zu setzen. Dazu können Sie die Prop \"aria-disabled\" verwenden, um den inaktiven Zustand anzugeben. Dies ermöglicht es Ihnen, Events wie Fokus oder Hover zu verwenden, während der Button nicht klickbar ist.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Inaktiver Button mit aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Es gibt viele CSS-Klassen, die man mit der Schaltfläche verwenden kann.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, verschiedene komplexe Props und Events zu verwenden, um den Button mit erweiterten Funktionen anzupassen und zu steuern. Im folgenden Beispiel werden mehrere Props und ein Event verwendet, um den Button zu konfigurieren und das Laden zu steuern.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Verwendung von komplexen Props und Events",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Button zu deaktivieren, indem Sie die Prop \"disabled\" verwenden. Dadurch wird der Button optisch und funktional deaktiviert, sodass er nicht mehr interaktiv ist.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Deaktivierung des Buttons",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Gruppieren Sie eine Reihe von Schaltflächen in einer einzelnen Zeile.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Gruppierung der Schaltflächen horizontal",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Sie können Schaltflächen in einer Tabelle gruppieren.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Tabellarische Gruppierung der Schaltflächen",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Anstatt Schaltflächengrößenklassen auf jede Schaltfläche in einer Gruppe anzuwenden, fügen Sie einfach .a_btn_group_large oder .a_btn_group_small zu jeder .a_btn_group hinzu, einschließlich jeder einzelnen, wenn Sie mehrere Gruppen verschachteln.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Größe der Schaltflächengruppe",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Stapeln Sie Schaltflächen in einer vertikalen Spalte.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Gruppierung der Schaltflächen vertikal",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, HTML-Inhalt sicher anzuzeigen, ohne ihm vollständig zu vertrauen. Durch Verwendung der Prop \"html\" und der DomPurify-Bibliothek wird der übergebene HTML-Inhalt gesäubert und sicher im Button dargestellt.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "HTML-Inhalt sicher anzeigen mit Hilfe von DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, Icons auf der linken und rechten Seite des Buttons anzuzeigen, indem Sie die Props \":icon-left\" und \":icon-right\" verwenden. Sie können verschiedene Icons für verschiedene Geräte definieren, um eine anpassbare Darstellung zu erreichen.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Verwendung von Icon-Props",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Button mit einem Ladezustand und einem Ladeindikator anzuzeigen. Sie können auch die Ausrichtung des Ladeindikators festlegen. Dies kann nützlich sein, um anzuzeigen, dass ein bestimmter Vorgang im Hintergrund läuft und der Benutzer auf den Abschluss warten muss.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Button mit Ladezustand und Ausrichtung des Ladeindikators",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Brauchen Sie einen Button, aber nicht die kräftigen Hintergrundfarben, die sie mit sich bringen? Ersetzen Sie die Standardmodifikatorklassen durch die .a_btn_outline_*-Klassen, um alle Hintergrundbilder und Farben auf einer beliebigen Schaltfläche zu entfernen.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Gliederungsschaltflächen",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, sicheren HTML-Inhalt als String im Button zu verwenden. Durch die Aktivierung der Prop \"safe-html\" und die Übermittlung eines HTML-Strings wird der übergebene HTML-Inhalt vertrauenswürdig behandelt und direkt über das JavaScript-Attribut \"innerHTML\" eingefügt.",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Sicherer HTML-Inhalt als String im Button verwenden",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Lust auf größere oder kleinere Knöpfe? Fügen Sie .a_btn_large oder .a_btn_small für zusätzliche Größen hinzu.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Schaltfläche Größen",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, zusätzlichen Inhalt nach dem Text im Button anzuzeigen, indem Sie den Slot \"buttonAppend\" verwenden. Der Inhalt, der im Slot platziert wird, wird nach dem Text im Button angezeigt.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Verwendung des Slots \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, benutzerdefinierten Inhalt im Button zu platzieren, indem Sie den Standard-Slot \":slots='default'\" verwenden. Der Inhalt, der im Slot platziert wird, wird im Button angezeigt.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Verwendung des Standard-Slots",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, zusätzlichen Inhalt vor dem Text im Button anzuzeigen, indem Sie den Slot \"buttonPrepend\" verwenden. Der Inhalt, der im Slot platziert wird, wird vor dem Text im Button angezeigt.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Verwendung des Slots \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, benutzerdefinierten HTML-Inhalt für den Titel des Buttons zu definieren, indem Sie den Slot \"buttonTitle\" zusammen mit der Prop \":is-title-html\" verwenden. Der Inhalt, der im Slot platziert wird, wird als HTML-Titel für den Button verwendet.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Verwendung des Slots \"buttonTitle\" für HTML-Titel",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Durch das Setzen der \"stop\"-Prop auf einen booleschen Wert kann gesteuert werden, ob das Event propagiert werden soll oder nicht. Das Beispiel zeigt zwei verschiedene Szenarien: einmal mit \"stop\" auf \"true\" gesetzt und einmal auf \"false\".",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Verwendung der \"stop\"-Prop zum Stoppen der Event-Weitergabe",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Button als Button-Switch zu verwenden, mit zwei Zuständen (aktiv/inaktiv). Durch Verwendung der Props \":is-switch\" und \":model-switch\" können Sie den Button-Switch aktivieren und den Zustand steuern. Der Button wird als \"button\"-Element mit dem Attribut \"aria-pressed\" gerendert, um den Zustand anzugeben.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Verwendung des Button-Switch-Modus",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, zusätzlichen Text innerhalb des Buttons anzuzeigen. Dies kann nützlich sein, um vordefinierten Text vor oder nach dem eigentlichen Button-Text hinzuzufügen.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Zusätzlicher Text innerhalb des Buttons",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Text des Buttons für verschiedene Geräte anzupassen. Durch Verwendung der Prop \":text\" als Objekt können Sie unterschiedlichen Text für mobile und Desktop-Geräte definieren.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Anpassbarer Text für verschiedene Geräte",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "In diesem Beispiel wird gezeigt, wie das Text-Tag in der \"AButton\"-Komponente in Vue.js angepasst werden kann. Standardmäßig wird der Text in einem \"span\"-Tag gerendert. Durch die Verwendung der \"text-tag\"-Prop kann das Text-Tag jedoch flexibel angepasst werden, um verschiedene HTML-Tags wie \"strong\", \"em\" oder andere zu verwenden.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Anpassung des Text-Tags in der \"AButton\"-Komponente",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, mehrere Titel in einer Prop zu konkatenieren. Durch Verwendung der Prop \":title\" als Array können Sie mehrere Elemente angeben, die zu einem einzigen Titel für den Button zusammengeführt werden.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Konkatenieren von Titeln in einer Prop",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Die AButton-Komponente ermöglicht es Ihnen, den Titel als HTML anzuzeigen und die Titelplatzierung zu steuern. Durch Verwendung der Props \":is-title-html\", \":title\" und \":title-placement\" können Sie HTML-Titel verwenden und die Positionierung des Titels festlegen.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Anzeige von HTML-Titel mit Übersetzung und Parameter",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "Im folgenden Beispiel wird der Titel als übersetzter Text mit einem Parameter angezeigt. Dabei wird der Parameter number über das extra-Attribut übergeben.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Anzeige von HTML-Titel und Titelplatzierung",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Transparente Schaltflächen",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Wenn Sie eine Schaltfläche benötigen, die mit dem Hintergrund verschmilzt, anstatt ihn zu verdecken, ersetzen Sie die Standardmodifikatorklassen durch die .a_btn_transparent*-Klassen.",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Gibt an, ob der Button als inaktiv markiert werden soll. Wenn der Wert auf true gesetzt ist, wird der Button als inaktiv dargestellt und die Accessibility-Eigenschaft \"aria-disabled\" wird hinzugefügt.",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": " Gibt das ARIA-Label für den Button an. Sie können einen String, eine Zahl oder ein Objekt als Wert verwenden, um das gewünschte Label festzulegen.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Gibt zusätzliche Attribute für den Button an. Sie können ein Objekt verwenden, um die gewünschten Attribute und deren Werte festzulegen.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "CSS-Klasse",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Gibt an, ob der Button deaktiviert werden soll. Wenn der Wert auf true gesetzt ist, wird der Button deaktiviert.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Extra-Objekt für Übersetzung",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Der zu sichernde HTML-Inhalt, der im Button angezeigt werden soll",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Gibt das HTML für den Screenreader-Inhalt des Buttons an. Sie können einen String, eine Zahl oder ein Objekt als Wert verwenden, um den gewünschten HTML-Inhalt festzulegen.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Gibt zusätzliche Attribute für die Icons an. Sie können ein Objekt verwenden, um die gewünschten Attribute und deren Werte für die Icons festzulegen.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Gibt eine zusätzliche CSS-Klasse für die Icons an.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Definiert das Icon auf der linken Seite des Buttons. Sie können entweder einen Icon-Namen als String angeben oder verschiedene Icons für verschiedene Geräte als Objekt definieren.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Definiert das Icon auf der rechten Seite des Buttons. Sie können entweder einen Icon-Namen als String angeben oder verschiedene Icons für verschiedene Geräte als Objekt definieren.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": " Gibt das benutzerdefinierte HTML-Tag für die Icons an.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Gibt eine eindeutige ID für den Button an. Wenn keine ID angegeben wird, wird automatisch eine eindeutige ID generiert.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Gibt an, ob der Button im Switch-Modus verwendet werden soll. Wenn der Wert auf true gesetzt ist, wird der Button als Button-Switch gerendert.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Gibt an, ob der Titel als HTML interpretiert werden soll. Wenn der Wert auf true gesetzt ist, wird der Titel als HTML gerendert.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Gibt die Ausrichtung des Ladeindikators an. Sie können entweder \"left\" oder \"right\" als Wert angeben.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Gibt die CSS-Klasse für den Ladezustand des Buttons an. Sie können entweder einen String mit der CSS-Klasse angeben oder ein Objekt verwenden, um verschiedene CSS-Klassen für verschiedene Zustände anzugeben.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Gibt an, ob der Button im Ladezustand ist. Wenn der Wert auf true gesetzt ist, wird der Button als \"loading\" angezeigt.",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "Der Modellwert, der den Zustand des Button-Switchs steuert. Wenn der Wert auf true gesetzt ist, ist der Button aktiviert (pressed=true), andernfalls ist der Button deaktiviert (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Gibt an, ob das Standardverhalten von Event-Handling-Funktionen für den Button verhindert werden soll.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Aktiviert das Vertrauen in den übergebenen HTML-String und ermöglicht dessen Darstellung im Button",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Gibt den sicheren HTML-Inhalt für den Screenreader-Bereich an. Sie können entweder einen String, eine Zahl oder ein Objekt verwenden, um verschiedene Inhalte für verschiedene Zustände anzugeben.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Gibt an, ob das weitere Ausbreiten des Events gestoppt werden soll.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Gibt den Tabindex-Wert für den Button an. Der Tabindex kann entweder als Zahl oder als String angegeben werden.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Gibt das HTML-Tag an, das für die Darstellung des Buttons verwendet werden soll.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Definiert den Text, der nach dem Button-Text angezeigt werden soll.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Gibt an, ob der Text des Buttons als aria-hidden=\"true\" markiert werden soll.\n",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Definiert den Text, der vor dem Button-Text angezeigt werden soll.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Gibt die CSS-Klasse an, die auf den Text des Buttons angewendet werden soll.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Ein String oder ein Objekt, das den Text für verschiedene Geräte enthält. Verwenden Sie die Schlüssel \"mobile\" und \"desktop\", um den entsprechenden Text für jedes Gerät anzugeben.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Gibt den Text an, der für Screenreader verwendet werden soll.",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Diese Prop ermöglicht die Anpassung des HTML-Tags, in dem der Text innerhalb des Buttons gerendert wird",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Ein String oder ein Array von Elementen, die zu einem einzigen Titel konkateniert werden.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Die Positionierung des HTML-Titels",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Gibt den Typ des Buttons an. Erlaubte Werte sind \"button\", \"submit\" und \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Der Slot, der den Inhalt enthält, der nach dem Text im Button angezeigt werden soll.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Der Slot, der den Inhalt enthält, der vor dem Text im Button angezeigt werden soll.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Der Slot, der den HTML-Inhalt enthält, der als Titel für den Button verwendet werden soll.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Der Standard-Slot, der den Inhalt für den Button enthält."
}
