{
  "_A_BUTTON_COMPONENT_NAME_": "Botón",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Se emite cuando se hace clic en el botón.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>¡ESTE ES MI <strong>TOOLTIP HTML!!!!</strong></div><div>Segunda línea</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>¡ESTE ES MI <strong>TOOLTIP HTML!!!!</strong></div><div>Segunda línea</div><div>Número: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"¡Hola!\")'>¡Hola!</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "El componente AButton te permite mostrar el botón como desactivado y establecer las propiedades de accesibilidad correspondientes. Puedes utilizar la propiedad \"aria-disabled\" para indicar el estado desactivado. Esto te permite usar eventos como enfoque o pasar el cursor sobre el botón mientras no es posible hacer clic en él.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Botón desactivado con aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Hay muchas clases de CSS que puedes usar con el botón.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "El componente AButton te permite utilizar varias propiedades y eventos complejos para personalizar y controlar el botón con funcionalidad avanzada. En el siguiente ejemplo, se utilizan múltiples propiedades y un evento para configurar el botón y controlar el estado de carga.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Uso de propiedades y eventos complejos",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "El componente AButton te permite desactivar el botón utilizando la propiedad \",disabled\". Esto deshabilita visual y funcionalmente el botón, haciendo que no se pueda interactuar con él.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Desactivar el botón",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Agrupa un conjunto de botones en una sola fila.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Agrupación de botones en horizontal",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Puedes agrupar botones en un formato de tabla.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Agrupación de botones basada en tablas",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "En lugar de aplicar clases de tamaño de botón a cada botón dentro de un grupo, simplemente agrega .a_btn_group_large o .a_btn_group_small a cada .a_btn_group, incluyendo los anidados si tienes varios niveles de anidamiento.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Tamaño del grupo de botones",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Apila los botones en una columna vertical.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Agrupación de botones en vertical",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "El componente AButton te permite mostrar contenido HTML de forma segura sin confiar plenamente en él. Mediante la propiedad \"html\" y la biblioteca DomPurify, el contenido HTML proporcionado se sanitiza y se muestra de forma segura en el botón.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Mostrar contenido HTML de forma segura utilizando DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "El componente AButton te permite mostrar iconos en el lado izquierdo y derecho del botón mediante las propiedades \":icon-left\" y \":icon-right\". Puedes definir diferentes iconos para diferentes dispositivos para lograr una visualización personalizable.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Uso de propiedades de icono",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "El componente AButton te permite mostrar el botón con un estado de carga y un indicador de carga. También puedes establecer la alineación del indicador de carga. Esto puede ser útil para indicar que se está ejecutando una operación específica en segundo plano y que el usuario debe esperar a que se complete.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Botón con estado de carga y alineación del indicador de carga",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "¿Necesitas un botón pero no los colores de fondo en negrita que traen consigo? Reemplaza las clases modificadoras predeterminadas con las clases .a_btn_outline* para eliminar todas las imágenes y colores de fondo en cualquier botón.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Botones de contorno",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "El componente AButton te permite utilizar contenido HTML seguro como una cadena dentro del botón. Al habilitar la propiedad \"safe-html\" y pasar una cadena HTML, el contenido HTML proporcionado se trata como confiable y se inserta directamente a través del atributo \"innerHTML\" de JavaScript.",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Uso de contenido HTML seguro como una cadena dentro del botón",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "¿Quieres botones más grandes o más pequeños? Agrega .a_btn_large o .a_btn_small para obtener tamaños adicionales.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Tamaños de botón",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "El componente AButton te permite mostrar contenido adicional después del texto dentro del botón utilizando el slot \"buttonAppend\". El contenido colocado en el slot se mostrará después del texto dentro del botón.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Usando el Slot \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "El componente AButton te permite colocar contenido personalizado dentro del botón utilizando el slot por defecto \":slots='default'\". El contenido colocado en el slot se mostrará dentro del botón.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Usando el Slot por Defecto",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "El componente AButton te permite mostrar contenido adicional antes del texto dentro del botón utilizando el slot \"buttonPrepend\". El contenido colocado en el slot se mostrará antes del texto dentro del botón.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Usando el Slot \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "El componente AButton te permite definir contenido HTML personalizado para el título del botón utilizando el slot \"buttonTitle\" junto con la propiedad \":is-title-html,\". El contenido colocado en el slot se utilizará como título HTML para el botón.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Usando el Slot \"buttonTitle\" para el Título HTML",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Establecer la propiedad \"stop\" en un valor booleano se puede utilizar para controlar si el evento debe propagarse o no. El ejemplo muestra dos escenarios diferentes: uno con \"stop\" establecido en \"true\" y otro en \"false\".",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Usando la propiedad \"stop\" para detener la propagación del evento",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "El componente AButton te permite utilizar el botón como un interruptor con dos estados (activo/inactivo). Utilizando las propiedades \":is-switch\" y \":model-switch,\", puedes habilitar el modo de interruptor del botón y controlar el estado. El botón se renderiza como un elemento \"button\" con el atributo \"aria-pressed\" para indicar el estado.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Usando el Modo de Interruptor del Botón",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "El componente AButton te permite mostrar texto adicional dentro del botón. Esto puede ser útil para agregar texto predefinido antes o después del texto del botón actual.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texto Adicional Dentro del Botón",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "El componente AButton te permite personalizar el texto del botón para diferentes dispositivos. Utilizando la propiedad \":text\" como un objeto, puedes definir diferentes textos para dispositivos móviles y de escritorio.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Texto Personalizable para Diferentes Dispositivos",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "El componente AButton te permite concatenar múltiples títulos en una propiedad. Utilizando la propiedad \":title\" como un array, puedes especificar múltiples elementos que se fusionarán en un solo título para el botón.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Concatenación de Títulos en una Propiedad",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "El componente AButton te permite mostrar el título como HTML y controlar la ubicación del título. Utilizando las propiedades \":is-title-html\", \":title\" y \":title-placement\", puedes utilizar títulos HTML y establecer la posición del título.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualización de títulos HTML con traducción y parámetros",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "En el siguiente ejemplo, el título se muestra como texto traducido con un parámetro. El parámetro numérico se pasa a través del atributo extra.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Mostrando el Título HTML y la Ubicación del Título",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Especifica si el botón debe marcarse como desactivado. Cuando se establece en true, el botón se muestra como desactivado y se agrega la propiedad de accesibilidad \"aria-disabled\".",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Especifica la etiqueta ARIA para el botón. Puedes utilizar una cadena, número u objeto como valor para establecer la etiqueta deseada.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Especifica atributos adicionales para el botón. Puedes utilizar un objeto para establecer los atributos deseados y sus valores.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Clase CSS",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Especifica si el botón debe estar desactivado. Cuando se establece en true, el botón está desactivado.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Objeto adicional para la traducción",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Especifica el contenido HTML que se mostrará dentro del botón.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Especifica el HTML para el contenido del lector de pantalla del botón. Puedes utilizar una cadena, número u objeto como valor para establecer el contenido HTML deseado.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Especifica atributos adicionales para los iconos. Puedes utilizar un objeto para establecer los atributos deseados y sus valores para los iconos.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Especifica una clase CSS adicional para los iconos.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Define el icono en el lado izquierdo del botón. Puedes especificar un nombre de icono como cadena o definir diferentes iconos para diferentes dispositivos como un objeto.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Define el icono en el lado derecho del botón. Puedes especificar un nombre de icono como cadena o definir diferentes iconos para diferentes dispositivos como un objeto.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Especifica la etiqueta HTML personalizada para los iconos.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Especifica un ID único para el botón. Si no se proporciona un ID, se generará automáticamente un ID único.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Especifica si el botón debe utilizarse en modo de interruptor. Cuando se establece en true, el botón se renderiza como un interruptor de botón.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Especifica si el título debe interpretarse como HTML. Cuando se establece en true, el título se renderiza como HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Especifica la alineación del indicador de carga. Puedes especificar \"left\" o \"right\" como valor.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Especifica la clase CSS para el estado de carga del botón. Puedes proporcionar una cadena con la clase CSS o utilizar un objeto para especificar diferentes clases CSS para diferentes estados.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Especifica si el botón está en el estado de carga. Cuando se establece en true, el botón se muestra como \"cargando\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "El valor de modelo que controla el estado del interruptor del botón. Cuando se establece en true, el botón está habilitado (pressed=true); de lo contrario, el botón está deshabilitado (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Especifica si se debe evitar el comportamiento predeterminado de las funciones de manejo de eventos para el botón.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Permite confiar en la cadena HTML pasada y permite su representación en el botón.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Especifica el contenido HTML seguro para el área del lector de pantalla. Puedes utilizar una cadena, número u objeto para especificar un contenido diferente para diferentes estados.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Especifica si se debe detener la propagación adicional del evento.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Especifica el valor de tabindex para el botón. El tabindex se puede especificar como un número o una cadena.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Especifica la etiqueta HTML a utilizar para renderizar el botón.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Define el texto que se mostrará después del texto del botón.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Especifica si el texto del botón debe marcarse como aria-hidden=\"true\".",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Define el texto que se mostrará antes del texto del botón.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Especifica la clase CSS para aplicar al texto del botón.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Una cadena u objeto que contiene el texto para diferentes dispositivos. Utiliza las claves \"mobile\" y \"desktop\" para especificar el texto correspondiente para cada dispositivo.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Especifica el texto que se utilizará para los lectores de pantalla.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Una cadena o un array de elementos que se concatenarán en un solo título.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "La ubicación del título HTML.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Especifica el tipo de botón. Los valores permitidos son \"button\", \"submit\" y \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "El slot que contiene el contenido que se mostrará después del texto en el botón.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "El slot que contiene el contenido que se mostrará antes del texto en el botón.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "El slot que contiene el contenido HTML que se utilizará como título para el botón.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "El slot por defecto que contiene el contenido para el botón.",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Esta propiedad te permite personalizar la etiqueta HTML que muestra el texto dentro del botón.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Botones transparentes",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Si necesitas un botón que se mezcle con el fondo en lugar de cubrirlo, reemplaza las clases modificadoras predeterminadas con las clases .a_btn_transparent*.",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "Este ejemplo muestra cómo personalizar la etiqueta de texto en el componente \"AButton\" en Vue.js. Por defecto, el texto se muestra en una etiqueta \"span\". Sin embargo, utilizando la propiedad \"text-tag\", la etiqueta de texto puede personalizarse de manera flexible para usar diferentes etiquetas HTML como \"strong\", \"em\" u otras.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Cambiando la etiqueta de texto en el componente \"AButton\"",
  "_A_BUTTON_PROPS_CONFIRM_MESSAGE_DESCRIPTION_": "Establece el mensaje de confirmación mostrado en el componente, solicitando confirmación al usuario. El mensaje predeterminado es \"¿Estás seguro?\".",
  "_A_BUTTON_PROPS_CONFIRM_TIME_DESCRIPTION_": "Define la duración (en segundos) antes de ejecutar la acción después de que el usuario haga clic en \"Sí\". Actúa como un tiempo de cuenta regresiva para la acción de confirmación. El valor predeterminado es de 5 segundos.",
  "_A_BUTTON_PROPS_IN_PROGRESS_MESSAGE_DESCRIPTION_": "Establece el mensaje mostrado cuando una acción está en progreso, específicamente después de que el usuario haya hecho clic en \"Sí\" y antes de que la acción se complete. El mensaje predeterminado es \"Procesando...\"",
  "_A_BUTTON_PROPS_YES_ATTRIBUTES_DESCRIPTION_": "Personaliza los atributos del botón \"Sí\", permitiendo el paso de cualquier atributo o estilo relevante. Por defecto es un objeto vacío.",
  "_A_BUTTON_PROPS_NO_ATTRIBUTES_DESCRIPTION_": "Se utiliza para personalizar los atributos del botón \"No\", similar a \"yesAttributes\". También tiene como valor predeterminado un objeto vacío.",
  "_A_BUTTON_PROPS_CONFIRM_DESCRIPTION_": "Habilita un diálogo de confirmación antes de la acción del botón. Establecer en \"verdadero\" para solicitar la confirmación del usuario. El predeterminado es \"falso\".",
  "_A_BUTTON_GROUP_CONFIRM_HEADER_": "Añadiendo Diálogos de Confirmación para Acciones Críticas",
  "_A_BUTTON_GROUP_CONFIRM_DESCRIPTION_": "Mejora la experiencia del usuario integrando solicitudes de confirmación para acciones importantes. Esta característica asegura que los usuarios tomen decisiones deliberadas, reduciendo clics accidentales con mensajes y tiempos personalizables."
}
