{
  "_A_BUTTON_COMPONENT_NAME_": "Bouton",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Émis lors du clic sur le bouton.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>CECI EST MON <strong>INFOBULLE HTML !!!!</strong></div><div>Deuxième ligne</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>CECI EST MON <strong>INFOBULLE HTML !!!!</strong></div><div>Deuxième ligne</div><div>Nombre : {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Le composant AButton vous permet d'afficher le bouton comme désactivé et de définir les propriétés d'accessibilité correspondantes. Vous pouvez utiliser la propriété \"aria-disabled\" pour indiquer l'état désactivé. Cela vous permet d'utiliser des événements tels que le focus ou le survol lorsque le bouton n'est pas cliquable.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Bouton désactivé avec aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Il existe de nombreuses classes CSS que vous pouvez utiliser avec le bouton.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Le composant AButton vous permet d'utiliser diverses propriétés complexes et événements pour personnaliser et contrôler le bouton avec une fonctionnalité avancée. Dans l'exemple suivant, plusieurs propriétés et un événement sont utilisés pour configurer le bouton et contrôler l'état de chargement.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Utilisation de propriétés et d'événements complexes",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Le composant AButton vous permet de désactiver le bouton en utilisant la propriété \"disabled\". Cela désactive visuellement et fonctionnellement le bouton, le rendant non interactif.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Désactiver le bouton",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Regroupe un ensemble de boutons dans une seule ligne.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Regroupement des boutons horizontalement",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Vous pouvez regrouper les boutons selon un format de tableau.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Regroupement des boutons basé sur un tableau",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Au lieu d'appliquer des classes de taille de bouton à chaque bouton d'un groupe, ajoutez simplement .a_btn_group_large ou .a_btn_group_small à chaque .a_btn_group, y compris les boutons imbriqués si vous avez plusieurs niveaux d'imbrication.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Taille du groupe de boutons",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Empile les boutons dans une colonne verticale.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Regroupement des boutons verticalement",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Le composant AButton vous permet d'afficher en toute sécurité du contenu HTML sans lui faire entièrement confiance. En utilisant la propriété \"html\" et la bibliothèque DomPurify, le contenu HTML fourni est nettoyé et affiché en toute sécurité dans le bouton.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Affichage sécurisé de contenu HTML en utilisant DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Le composant AButton vous permet d'afficher des icônes à gauche et à droite du bouton en utilisant les propriétés \":icon-left\" et \":icon-right,\". Vous pouvez définir des icônes différentes pour différents appareils afin d'obtenir un affichage personnalisé.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Utilisation des propriétés d'icône",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Le composant AButton vous permet d'afficher le bouton avec un état de chargement et un indicateur de chargement. Vous pouvez également définir l'alignement de l'indicateur de chargement. Cela peut être utile pour indiquer qu'une opération spécifique est en cours d'exécution en arrière-plan et que l'utilisateur doit attendre sa fin.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Bouton avec état de chargement et alignement de l'indicateur de chargement",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Besoin d'un bouton mais pas des couleurs de fond en gras qu'ils apportent ? Remplacez les classes de modification par défaut par les classes .a_btn_outline* pour supprimer toutes les images et couleurs de fond sur n'importe quel bouton.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Boutons avec contours",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Le composant AButton vous permet d'utiliser du contenu HTML sécurisé sous forme de chaîne à l'intérieur du bouton. En activant la propriété \"safe-html\" et en transmettant une chaîne HTML, le contenu HTML fourni est considéré comme fiable et inséré directement via l'attribut \"innerHTML\" JavaScript.",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Utilisation de contenu HTML sécurisé sous forme de chaîne à l'intérieur du bouton",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Envie de boutons plus grands ou plus petits ? Ajoutez .a_btn_large ou .a_btn_small pour obtenir des tailles supplémentaires.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Tailles des boutons",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Le composant AButton vous permet d'afficher du contenu supplémentaire après le texte à l'intérieur du bouton en utilisant le slot \"buttonAppend\". Le contenu placé dans le slot sera affiché après le texte à l'intérieur du bouton.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Utilisation du slot \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Le composant AButton vous permet de placer du contenu personnalisé à l'intérieur du bouton en utilisant le slot par défaut \":slots='default'\". Le contenu placé dans le slot sera affiché à l'intérieur du bouton.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Utilisation du slot par défaut",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Le composant AButton vous permet d'afficher du contenu supplémentaire avant le texte à l'intérieur du bouton en utilisant le slot \",buttonPrepend\". Le contenu placé dans le slot sera affiché avant le texte à l'intérieur du bouton.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Utilisation du slot \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Le composant AButton vous permet de définir du contenu HTML personnalisé pour le titre du bouton en utilisant le slot \"buttonTitle\" avec la propriété \":is-title-html,\". Le contenu placé dans le slot sera utilisé comme titre HTML pour le bouton.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Utilisation du slot \"buttonTitle\" pour le titre HTML",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "En définissant la propriété \"stop\" sur une valeur booléenne, vous pouvez contrôler si l'événement doit être propagé ou non. L'exemple montre deux scénarios différents : l'un avec \"stop\" défini sur \"true\" et l'autre sur \"false\".",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Utilisation de la propriété \"stop\" pour arrêter la propagation de l'événement",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Le composant AButton vous permet d'utiliser le bouton comme un interrupteur, avec deux états (actif/inactif). En utilisant les propriétés \":is-switch\" et \":model-switch,\", vous pouvez activer le mode interrupteur du bouton et contrôler l'état. Le bouton est rendu en tant qu'élément \"button\" avec l'attribut \"aria-pressed\" pour indiquer l'état.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Utilisation du mode interrupteur du bouton",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Le composant AButton vous permet d'afficher du texte supplémentaire à l'intérieur du bouton. Cela peut être utile pour ajouter un texte prédéfini avant ou après le texte réel du bouton.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Texte supplémentaire à l'intérieur du bouton",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Le composant AButton vous permet de personnaliser le texte du bouton pour différents appareils. En utilisant la propriété \":text\" comme un objet, vous pouvez définir différents textes pour les appareils mobiles et de bureau.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Texte personnalisable pour différents appareils",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Le composant AButton vous permet de concaténer plusieurs titres dans une propriété. En utilisant la propriété \":title\" comme un tableau, vous pouvez spécifier plusieurs éléments qui seront fusionnés en un seul titre pour le bouton.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Concaténation de titres dans une propriété",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Le composant AButton vous permet d'afficher le titre comme HTML et de contrôler l'emplacement du titre. En utilisant les propriétés \":is-title-html\", \":title\" et \":title-placement,\", vous pouvez utiliser des titres HTML et définir la position du titre.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Affichage de titres HTML avec traduction et paramètres",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "Dans l'exemple ci-dessous, le titre est affiché comme texte traduit avec un paramètre. Le paramètre numérique est transmis via l'attribut extra.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Affichage du titre HTML et position du titre",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Spécifie si le bouton doit être marqué comme désactivé. Lorsque défini sur true, le bouton est affiché comme désactivé et la propriété d'accessibilité \"aria-disabled\" est ajoutée.",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Spécifie l'étiquette ARIA pour le bouton. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir l'étiquette souhaitée.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Spécifie des attributs supplémentaires pour le bouton. Vous pouvez utiliser un objet pour définir les attributs souhaités et leurs valeurs.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Classe CSS",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Spécifie si le bouton doit être désactivé. Lorsque défini sur true, le bouton est désactivé.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Objet supplémentaire pour la traduction",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Spécifie le contenu HTML à afficher à l'intérieur du bouton.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Spécifie le contenu HTML pour la zone de lecteur d'écran du bouton. Vous pouvez utiliser une chaîne, un nombre ou un objet comme valeur pour définir le contenu HTML souhaité.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Spécifie des attributs supplémentaires pour les icônes. Vous pouvez utiliser un objet pour définir les attributs souhaités et leurs valeurs pour les icônes.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Spécifie une classe CSS supplémentaire pour les icônes.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Définit l'icône sur le côté gauche du bouton. Vous pouvez spécifier un nom d'icône en tant que chaîne ou définir différentes icônes pour différents appareils en tant qu'objet.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Définit l'icône sur le côté droit du bouton. Vous pouvez spécifier un nom d'icône en tant que chaîne ou définir différentes icônes pour différents appareils en tant qu'objet.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Spécifie la balise HTML personnalisée pour les icônes.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Spécifie un ID unique pour le bouton. Si aucun ID n'est fourni, un ID unique sera généré automatiquement.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Spécifie si le bouton doit être utilisé en mode interrupteur. Lorsque défini sur true, le bouton est rendu en tant qu'interrupteur de bouton.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Spécifie si le titre doit être interprété comme du HTML. Lorsque défini sur true, le titre est rendu en tant que HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Spécifie l'alignement de l'indicateur de chargement. Vous pouvez spécifier \"left\" ou \"right\" comme valeur.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Spécifie la classe CSS pour l'état de chargement du bouton. Vous pouvez soit fournir une chaîne avec la classe CSS, soit utiliser un objet pour spécifier différentes classes CSS pour différents états.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Spécifie si le bouton est dans l'état de chargement. Lorsque défini sur true, le bouton est affiché comme \"en chargement\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "La valeur du modèle qui contrôle l'état de l'interrupteur du bouton. Lorsque défini sur true, le bouton est activé (pressed=true) ; sinon, le bouton est désactivé (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Spécifie si l'action par défaut des fonctions de gestion des événements pour le bouton doit être empêchée.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Permet de faire confiance à la chaîne HTML fournie et autorise son rendu dans le bouton.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Spécifie le contenu HTML sécurisé pour la zone du lecteur d'écran. Vous pouvez utiliser une chaîne, un nombre ou un objet pour spécifier un contenu différent pour différents états.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Spécifie si la propagation ultérieure de l'événement doit être arrêtée.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Spécifie la valeur de tabindex pour le bouton. Le tabindex peut être spécifié en tant que nombre ou chaîne.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Spécifie la balise HTML à utiliser pour le rendu du bouton.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Définit le texte à afficher après le texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Spécifie si le texte du bouton doit être marqué comme aria-hidden=\"true\".",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Définit le texte à afficher avant le texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Spécifie la classe CSS à appliquer au texte du bouton.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Une chaîne ou un objet contenant le texte pour différents appareils. Utilisez les clés \"mobile\" et \"desktop\" pour spécifier le texte correspondant à chaque appareil.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Spécifie le texte à utiliser pour les lecteurs d'écran.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Une chaîne ou un tableau d'éléments à concaténer en un seul titre.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "L'emplacement du titre HTML.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Spécifie le type de bouton. Les valeurs autorisées sont \"button\", \"submit\" et \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Le slot contenant le contenu à afficher après le texte dans le bouton.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Le slot contenant le contenu à afficher avant le texte dans le bouton.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Le slot contenant le contenu HTML à utiliser comme titre pour le bouton.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Le slot par défaut contenant le contenu pour le bouton."
}
