{
  "_A_BUTTON_COMPONENT_NAME_": "Pulsante",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Emesso quando si fa clic sul pulsante.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE__": "<div>QUESTO È IL MIO <strong>TOOLTIP HTML!!!!</strong></div><div>Seconda riga</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>QUESTO È IL MIO <strong>TOOLTIP HTML!!!!</strong></div><div>Seconda riga</div><div>Numero: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Il componente AButton consente di visualizzare il pulsante come disabilitato e di impostare le relative proprietà di accessibilità. È possibile utilizzare la proprietà \"aria-disabled\" per indicare lo stato disabilitato. Ciò consente di utilizzare eventi come il focus o il passaggio del mouse mentre il pulsante non è cliccabile.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Pulsante disabilitato con aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Ci sono molte classi CSS che è possibile utilizzare con il pulsante.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Il componente AButton consente di utilizzare varie proprietà complesse ed eventi per personalizzare e controllare il pulsante con funzionalità avanzate. Nell'esempio seguente vengono utilizzate molteplici proprietà ed un evento per configurare il pulsante e controllarne lo stato di caricamento.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Utilizzo di proprietà ed eventi complessi",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Il componente AButton consente di disabilitare il pulsante utilizzando la proprietà \"disabled\". Ciò disabilita visivamente e funzionalmente il pulsante, rendendolo non interattivo.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Disabilitazione del pulsante",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Raggruppa un insieme di pulsanti in una singola riga.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Raggruppamento dei pulsanti in orizzontale",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "È possibile raggruppare i pulsanti in un formato a tabella.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Raggruppamento dei pulsanti basato su tabelle",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Invece di applicare le classi di dimensioni dei pulsanti a ogni pulsante all'interno di un gruppo, è sufficiente aggiungere .a_btn_group_large o .a_btn_group_small a ciascun .a_btn_group, inclusi quelli nidificati se si hanno più livelli di nidificazione.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Dimensioni del gruppo di pulsanti",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Impila i pulsanti in una colonna verticale.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Raggruppamento dei pulsanti in verticale",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Il componente AButton consente di visualizzare in modo sicuro il contenuto HTML senza fidarsi completamente di esso. Utilizzando la proprietà \"html\" e la libreria DomPurify, il contenuto HTML fornito viene sanificato e visualizzato in modo sicuro nel pulsante.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Visualizzazione sicura del contenuto HTML utilizzando DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Il componente AButton consente di visualizzare icone sul lato sinistro e destro del pulsante utilizzando le proprietà \":icon-left\" e \":icon-right,\". È possibile definire icone diverse per dispositivi diversi per ottenere una visualizzazione personalizzata.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Utilizzo delle proprietà di icone",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Il componente AButton consente di visualizzare il pulsante con uno stato di caricamento e un indicatore di caricamento. È anche possibile impostare l'allineamento dell'indicatore di caricamento. Ciò può essere utile per indicare che un'operazione specifica è in esecuzione in background e che l'utente deve attendere il completamento.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Pulsante con stato di caricamento e allineamento dell'indicatore di caricamento",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Hai bisogno di un pulsante ma non dei colori di sfondo in grassetto che portano con sé? Sostituisci le classi di modifica predefinite con le classi .a_btn_outline* per rimuovere tutte le immagini e i colori di sfondo su qualsiasi pulsante.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Pulsanti con contorno",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Il componente AButton consente di utilizzare contenuto HTML sicuro come stringa all'interno del pulsante. Abilitando la proprietà \"safe-html\" e passando una stringa HTML, il contenuto HTML fornito viene considerato attendibile e inserito direttamente tramite l'attributo \"innerHTML\" di JavaScript.",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Utilizzo di contenuto HTML sicuro come stringa all'interno del pulsante",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Desideri pulsanti più grandi o più piccoli? Aggiungi .a_btn_large o .a_btn_small per ottenere dimensioni aggiuntive.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Dimensioni dei pulsanti",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Il componente AButton consente di visualizzare contenuti aggiuntivi dopo il testo all'interno del pulsante utilizzando lo slot \"buttonAppend\". I contenuti inseriti nello slot verranno mostrati dopo il testo all'interno del pulsante.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Utilizzo dello slot \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Il componente AButton consente di inserire contenuti personalizzati all'interno del pulsante utilizzando lo slot predefinito \":slots='default'\". I contenuti inseriti nello slot verranno mostrati all'interno del pulsante.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Utilizzo dello slot predefinito",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Il componente AButton consente di visualizzare contenuti aggiuntivi prima del testo all'interno del pulsante utilizzando lo slot \"buttonPrepend\". I contenuti inseriti nello slot verranno mostrati prima del testo all'interno del pulsante.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Utilizzo dello slot \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Il componente AButton consente di definire contenuti HTML personalizzati per il titolo del pulsante utilizzando lo slot \"buttonTitle\" insieme alla proprietà \":is-title-html,\". I contenuti inseriti nello slot verranno utilizzati come titolo HTML per il pulsante.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Utilizzo dello slot \"buttonTitle\" per il titolo HTML",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Impostando la proprietà \"stop\" su un valore booleano è possibile controllare se l'evento deve essere propagato o meno. L'esempio mostra due scenari diversi: uno con \"stop\" impostato su \"true\" e uno impostato su \"false\".",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Utilizzo della proprietà \"stop\" per interrompere la propagazione dell'evento",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Il componente AButton consente di utilizzare il pulsante come interruttore, con due stati (attivo/inattivo). Utilizzando le proprietà \":is-switch\" e \":model-switch,\", è possibile abilitare la modalità interruttore del pulsante e controllarne lo stato. Il pulsante viene renderizzato come un elemento \"button\" con l'attributo \"aria-pressed\" per indicare lo stato.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Utilizzo della modalità interruttore del pulsante",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Il componente AButton consente di visualizzare testo aggiuntivo all'interno del pulsante. Questo può essere utile per aggiungere del testo predefinito prima o dopo il testo effettivo del pulsante.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Testo aggiuntivo all'interno del pulsante",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Il componente AButton consente di personalizzare il testo del pulsante per diversi dispositivi. Utilizzando la proprietà \":text\" come oggetto, è possibile definire testi diversi per dispositivi mobili e desktop.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Testo personalizzabile per diversi dispositivi",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Il componente AButton consente di concatenare più titoli in una singola proprietà. Utilizzando la proprietà \":title\" come array, è possibile specificare più elementi che verranno uniti in un unico titolo per il pulsante.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Concatenazione di titoli in una proprietà",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Il componente AButton consente di visualizzare il titolo come HTML e controllarne la posizione. Utilizzando le proprietà \":is-title-html\", \":title,\" e \":title-placement,\", è possibile utilizzare titoli HTML e impostarne il posizionamento.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Visualizzazione di titoli HTML con traduzione e parametri",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "Nell'esempio seguente, il titolo viene visualizzato come testo tradotto con un parametro numerico. Il parametro viene passato tramite l'attributo extra.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Visualizzazione del titolo HTML e posizionamento del titolo",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Specifica se il pulsante deve essere contrassegnato come disabilitato. Quando impostato su true, il pulsante viene visualizzato come disabilitato e viene aggiunta la proprietà di accessibilità \"aria-disabled\".",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Specifica l'etichetta ARIA per il pulsante. È possibile utilizzare una stringa, un numero o un oggetto come valore per impostare l'etichetta desiderata.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Specifica attributi aggiuntivi per il pulsante. È possibile utilizzare un oggetto per impostare gli attributi desiderati e i relativi valori.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "Classe CSS",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Specifica se il pulsante deve essere disabilitato. Quando impostato su true, il pulsante è disabilitato.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Oggetto aggiuntivo per la traduzione",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Specifica il contenuto HTML da visualizzare all'interno del pulsante.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Specifica il contenuto HTML per l'area del lettore dello schermo del pulsante. È possibile utilizzare una stringa, un numero o un oggetto come valore per impostare il contenuto HTML desiderato.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Specifica attributi aggiuntivi per le icone. È possibile utilizzare un oggetto per impostare gli attributi desiderati e i relativi valori per le icone.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Specifica una classe CSS aggiuntiva per le icone.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Definisce l'icona sul lato sinistro del pulsante. È possibile specificare un nome dell'icona come stringa o definire icone diverse per dispositivi diversi come oggetto.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Definisce l'icona sul lato destro del pulsante. È possibile specificare un nome dell'icona come stringa o definire icone diverse per dispositivi diversi come oggetto.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Specifica il tag HTML personalizzato per le icone.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Specifica un ID univoco per il pulsante. Se non viene fornito alcun ID, verrà generato automaticamente un ID univoco.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Specifica se il pulsante deve essere utilizzato in modalità interruttore. Quando impostato su true, il pulsante viene reso come un interruttore di pulsante.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Specifica se il titolo deve essere interpretato come HTML. Quando impostato su true, il titolo viene reso come HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Specifica l'allineamento dell'indicatore di caricamento. È possibile specificare \"left\" o \"right\" come valore.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Specifica la classe CSS per lo stato di caricamento del pulsante. È possibile fornire una stringa con la classe CSS o utilizzare un oggetto per specificare diverse classi CSS per diversi stati.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Specifica se il pulsante è nello stato di caricamento. Quando impostato su true, il pulsante viene visualizzato come \"in caricamento\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "Il valore del modello che controlla lo stato dell'interruttore del pulsante. Quando impostato su true, il pulsante è abilitato (pressed=true); altrimenti, il pulsante è disabilitato (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Specifica se impedire il comportamento predefinito delle funzioni di gestione degli eventi per il pulsante.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Abilita la fiducia nella stringa HTML fornita e consente il suo rendering nel pulsante.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Specifica il contenuto HTML sicuro per l'area del lettore dello schermo. È possibile utilizzare una stringa, un numero o un oggetto per specificare contenuti diversi per stati diversi.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Specifica se interrompere la propagazione ulteriore dell'evento.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Specifica il valore di tabindex per il pulsante. Il tabindex può essere specificato come numero o stringa.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Specifica il tag HTML da utilizzare per il rendering del pulsante.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Definisce il testo da visualizzare dopo il testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Specifica se il testo del pulsante deve essere contrassegnato come aria-hidden=\"true\".",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Definisce il testo da visualizzare prima del testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Specifica la classe CSS da applicare al testo del pulsante.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Una stringa o un oggetto che contiene il testo per dispositivi diversi. Utilizzare le chiavi \"mobile\" e \"desktop\" per specificare il testo corrispondente a ciascun dispositivo.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Specifica il testo da utilizzare per i lettori dello schermo.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Una stringa o un array di elementi da concatenare in un unico titolo.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Il posizionamento del titolo HTML.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Specifica il tipo di pulsante. I valori consentiti sono \",button\", \"submit\" e \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Lo slot che contiene il contenuto da visualizzare dopo il testo nel pulsante.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Lo slot che contiene il contenuto da visualizzare prima del testo nel pulsante.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Lo slot che contiene il contenuto HTML da utilizzare come titolo per il pulsante.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Lo slot predefinito che contiene il contenuto per il pulsante.",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Questa proprietà ti permette di personalizzare il tag HTML che visualizza il testo all'interno del pulsante.",
  "_A_BUTTON_GROUP_TRANSPARENT_HEADER_": "Pulsanti trasparenti",
  "_A_BUTTON_GROUP_TRANSPARENT_DESCRIPTION_": "Se hai bisogno di un pulsante che si fonda con lo sfondo invece di coprirlo, sostituisci le classi modificatrici predefinite con le classi .a_btn_transparent*.",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "Questo esempio mostra come personalizzare il tag del testo nel componente \"AButton\" in Vue.js. Per impostazione predefinita, il testo viene visualizzato in un tag \"span\". Tuttavia, utilizzando la proprietà \"text-tag\", il tag del testo può essere personalizzato in modo flessibile per utilizzare diversi tag HTML come \"strong\", \"em\" o altri.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Modifica del tag del testo nel componente \"AButton\"",
  "_A_BUTTON_PROPS_CONFIRM_MESSAGE_DESCRIPTION_": "Imposta il messaggio di conferma visualizzato nel componente, richiedendo la conferma dell'utente. Il messaggio predefinito è \"Sei sicuro?\".",
  "_A_BUTTON_PROPS_CONFIRM_TIME_DESCRIPTION_": "Definisce la durata (in secondi) prima che l'azione venga eseguita dopo che l'utente clicca su \"Sì\". Funziona come un tempo di conteggio alla rovescia per l'azione di conferma. Il valore predefinito è di 5 secondi.",
  "_A_BUTTON_PROPS_IN_PROGRESS_MESSAGE_DESCRIPTION_": "Imposta il messaggio visualizzato quando un'azione è in corso, specificatamente dopo che l'utente ha cliccato su \"Sì\" e prima che l'azione sia completata. Il messaggio predefinito è \"Elaborazione in corso...\"",
  "_A_BUTTON_PROPS_YES_ATTRIBUTES_DESCRIPTION_": "Personalizza gli attributi del pulsante \"Sì\", consentendo il passaggio di qualsiasi attributo o stile rilevante. Il valore predefinito è un oggetto vuoto.",
  "_A_BUTTON_PROPS_NO_ATTRIBUTES_DESCRIPTION_": "Utilizzato per personalizzare gli attributi del pulsante \"No\", simile a \"yesAttributes\". Anche questo valore predefinito è un oggetto vuoto.",
  "_A_BUTTON_PROPS_CONFIRM_DESCRIPTION_": "Abilita una finestra di dialogo di conferma prima dell'azione del pulsante. Impostare su \"vero\" per richiedere la conferma dell'utente. Il valore predefinito è \"falso\".",
  "_A_BUTTON_GROUP_CONFIRM_HEADER_": "Aggiunta di finestre di dialogo di conferma per azioni critiche",
  "_A_BUTTON_GROUP_CONFIRM_DESCRIPTION_": "Migliora l'esperienza utente integrando richieste di conferma per azioni importanti. Questa funzionalità assicura che gli utenti facciano scelte deliberate, riducendo clic accidentali con messaggi e tempistiche personalizzabili."
}
