{
  "_A_BUTTON_COMPONENT_NAME_": "Кнопка",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Срабатывает при клике на кнопку.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>ЭТО МОЙ <strong>HTML-ВОЛШЕБНАЯ ПОДСКАЗКА!!!!</strong></div><div>Вторая строка</div>",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_{{number}}_": "<div>ЭТО МОЙ <strong>HTML-ВОЛШЕБНАЯ ПОДСКАЗКА!!!!</strong></div><div>Вторая строка</div><div>Номер: {{ number }}</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "Компонент AButton позволяет отображать кнопку в неактивном состоянии и устанавливать соответствующие атрибуты доступности. Для этого можно использовать свойство \"aria-disabled\" для указания неактивного состояния. Это позволяет использовать события, такие как фокус или наведение, при этом кнопка остаётся неактивной для нажатия.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Неактивная кнопка с использованием aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "Существует множество классов CSS, которые можно использовать с кнопкой.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "Компонент AButton позволяет использовать различные сложные свойства и события для настройки и управления кнопкой с расширенными функциями. В следующем примере используются несколько свойств и событий для настройки кнопки и управления её состоянием загрузки.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Использование сложных свойств и событий",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "Компонент AButton позволяет отключить кнопку с помощью свойства \"disabled\". Это делает кнопку недоступной для взаимодействия как внешне, так и функционально.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Отключение кнопки",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Группируйте ряд кнопок в одну строку.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Горизонтальная группировка кнопок",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "Вы можете группировать кнопки в таблице.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Табличная группировка кнопок",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Вместо применения классов размеров кнопок к каждой кнопке в группе, просто добавьте .a_btn_group_large или .a_btn_group_small к каждой .a_btn_group, включая каждую вложенную группу, если у вас есть несколько уровней.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Размер группы кнопок",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Разместите кнопки в вертикальном столбце.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Вертикальная группировка кнопок",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "Компонент AButton позволяет безопасно отображать HTML-содержимое, не доверяя ему полностью. С использованием свойства \"html\" и библиотеки DomPurify переданное HTML-содержимое очищается и безопасно отображается в кнопке.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Безопасное отображение HTML-содержимого с помощью DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "Компонент AButton позволяет отображать иконки слева и справа от кнопки с помощью свойств \":icon-left\" и \":icon-right\". Вы можете задать разные иконки для разных устройств, чтобы добиться настраиваемого вида.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Использование свойств иконок",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "Компонент AButton позволяет отображать кнопку в состоянии загрузки с индикатором загрузки. Вы также можете задать выравнивание индикатора загрузки. Это может быть полезно для отображения фонового процесса, требующего ожидания завершения пользователем.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Кнопка в состоянии загрузки и выравнивание индикатора загрузки",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Нужна кнопка, но без ярких фоновых цветов? Замените стандартные классы модификаторов на классы .a_btn_outline_*, чтобы удалить все фоновые изображения и цвета на любой кнопке.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Кнопки-контур",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "Компонент AButton позволяет использовать безопасное HTML-содержимое в виде строки внутри кнопки. При включении свойства \"safe-html\" и передаче строки HTML-содержимого, переданный HTML-контент будет обработан с доверием и вставлен непосредственно через JavaScript-атрибут \"innerHTML\".",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Использование безопасного HTML-содержимого в виде строки внутри кнопки",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Хотите большие или маленькие кнопки? Добавьте .a_btn_large или .a_btn_small для дополнительных размеров.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Размеры кнопок",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "Компонент AButton позволяет отображать дополнительное содержимое после текста кнопки с помощью слота \"buttonAppend\". Содержимое, помещенное в слот, будет отображаться после текста кнопки.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Использование слота \"buttonAppend\"",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "Компонент AButton позволяет размещать пользовательский контент внутри кнопки с помощью стандартного слота \":slots='default'\". Содержимое, помещенное в слот, будет отображаться внутри кнопки.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Использование стандартного слота",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "Компонент AButton позволяет отображать дополнительное содержимое перед текстом кнопки с помощью слота \"buttonPrepend\". Содержимое, помещенное в слот, будет отображаться перед текстом кнопки.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Использование слота \"buttonPrepend\"",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "Компонент AButton позволяет определить пользовательский HTML-контент для заголовка кнопки с помощью слота \"buttonTitle\" в сочетании с атрибутом \":is-title-html\". Содержимое, помещенное в слот, будет использоваться как HTML-заголовок для кнопки.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Использование слота \"buttonTitle\" для HTML-заголовка",
  "_A_BUTTON_GROUP_STOP_DESCRIPTION_": "Установка props «stop» на логическое значение может использоваться для управления тем, должно ли событие распространяться или нет. В примере показаны два разных сценария: один со значением «stop», установленным на «true», и другой, установленным на «false».",
  "_A_BUTTON_GROUP_STOP_HEADER_": "Использование props «stop» для остановки распространения события",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "Компонент AButton позволяет использовать кнопку в качестве переключателя с двумя состояниями (включено/выключено). С помощью атрибутов \":is-switch\" и \":model-switch\" вы можете включить режим переключателя и управлять состоянием кнопки. Кнопка рендерится как элемент \"button\" с атрибутом \"aria-pressed\", указывающим состояние.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Использование режима кнопки-переключателя",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "Компонент AButton позволяет отображать дополнительный текст внутри кнопки. Это может быть полезно для добавления предопределенного текста перед или после основного текста кнопки.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Дополнительный текст внутри кнопки",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "Компонент AButton позволяет настроить текст кнопки для разных устройств. С помощью атрибута \":text\" в виде объекта вы можете задать разный текст для мобильных и настольных устройств.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Настройка текста для разных устройств",
  "_A_BUTTON_GROUP_TEXT_TAG_DESCRIPTION_": "В этом примере показано, как настроить тег для текста  в компоненте «AButton» в Vue.js. По умолчанию текст отображается в теге span. Однако, используя реквизит text-tag, тег для текста можно гибко настроить для использования различных HTML-тегов, таких как «strong», «em» или других.",
  "_A_BUTTON_GROUP_TEXT_TAG_HEADER_": "Изменение тега-текста  в компоненте \"AButton\"",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "Компонент AButton позволяет объединить несколько заголовков в одном атрибуте. С помощью атрибута \":title\" в виде массива вы можете указать несколько элементов, которые будут объединены в единый заголовок для кнопки.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Объединение заголовков в одном атрибуте",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "Компонент AButton позволяет отображать заголовок в виде HTML и управлять его размещением. С помощью атрибутов \":is-title-html\", \":title\" и \":title-placement\" вы можете использовать HTML-заголовок и задать его расположение.",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_DESCRIPTION_": "Отображение HTML-заголовка с переводом и параметрами",
  "_A_BUTTON_GROUP_TITLE_HTML_EXTRA_HEADER_": "В приведенном ниже примере заголовок отображается как переведенный текст с параметром. Параметр number передается через extra атрибут.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Отображение HTML-заголовка и его размещение",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Определяет, должна ли кнопка быть неактивной. Если значение установлено как true, кнопка будет отображаться как неактивная, и будет добавлено свойство доступности \"aria-disabled\".",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Определяет ARIA-метку для кнопки. Вы можете использовать строку, число или объект в качестве значения для задания желаемой метки.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Определяет дополнительные атрибуты для кнопки. Вы можете использовать объект для задания необходимых атрибутов и их значений.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "CSS-класс",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Определяет, должна ли кнопка быть отключена. Если значение установлено как true, кнопка будет отключена.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Дополнительный объект для перевода",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "HTML-контент, который должен быть отображен внутри кнопки.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Определяет HTML-контент для чтения экраном кнопки. Вы можете использовать строку, число или объект в качестве значения для задания желаемого HTML-контента.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Определяет дополнительные атрибуты для иконок. Вы можете использовать объект для задания необходимых атрибутов и их значений для иконок.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Определяет дополнительный CSS-класс для иконок.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Определяет иконку слева от кнопки. Вы можете указать имя иконки в виде строки или определить разные иконки для разных устройств в виде объекта.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Определяет иконку справа от кнопки. Вы можете указать имя иконки в виде строки или определить разные иконки для разных устройств в виде объекта.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Определяет пользовательский HTML-тег для иконок.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Определяет уникальный идентификатор для кнопки. Если идентификатор не указан, будет автоматически сгенерирован уникальный идентификатор.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Определяет, должна ли кнопка использоваться в режиме переключателя. Если значение установлено как true, кнопка будет отображаться как кнопка-переключатель.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Определяет, должен ли заголовок интерпретироваться как HTML. Если значение установлено как true, заголовок будет отображаться как HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Определяет выравнивание индикатора загрузки. Вы можете указать значение \"left\" или \"right\".",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Определяет CSS-класс для состояния загрузки кнопки. Вы можете указать строку с CSS-классом или использовать объект для указания разных CSS-классов для разных состояний.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Определяет, находится ли кнопка в состоянии загрузки. Если значение установлено как true, кнопка будет отображаться как \"loading\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "Значение модели, которое управляет состоянием переключателя кнопки. Если значение установлено как true, кнопка будет включена (pressed=true), в противном случае кнопка будет отключена (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Определяет, должно ли быть предотвращено стандартное поведение обработчиков событий для кнопки.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Включает доверие к переданной HTML-строке и позволяет ее отображать внутри кнопки.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Определяет безопасный HTML-контент для области считывания экрана. Вы можете указать строку, число или объект для задания разного контента для разных состояний.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Определяет, должно ли быть остановлено дальнейшее распространение события.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Определяет значение индекса перехода для кнопки. Индекс перехода может быть задан как число или строка.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Определяет HTML-тег, который будет использоваться для отображения кнопки.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Определяет текст, который должен быть отображен после текста кнопки.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Определяет, должен ли текст кнопки быть помечен как aria-hidden=\"true\".",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Определяет текст, который должен быть отображен перед текстом кнопки.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Определяет CSS-класс, который будет применен к тексту кнопки.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "Строка или объект, содержащий текст для разных устройств. Используйте ключи \"mobile\" и \"desktop\", чтобы указать соответствующий текст для каждого устройства.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Определяет текст, который будет использоваться для считывания экраном.",
  "_A_BUTTON_PROPS_TEXT_TAG_DESCRIPTION_": "Этот параметр позволяет настраивать тег HTML, в котором отображается текст внутри кнопки.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "Строка или массив элементов, которые будут объединены в один заголовок.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "Позиционирование HTML-заголовка.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Определяет тип кнопки. Допустимые значения: \"button\", \"submit\" и \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "Слот, который содержит контент, который должен быть отображен после текста кнопки.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "Слот, который содержит контент, который должен быть отображен перед текстом кнопки.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "Слот, который содержит HTML-контент, который будет использоваться в качестве заголовка для кнопки.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "Стандартный слот, который содержит контент для кнопки.",
  "_A_BUTTON_PROPS_CONFIRM_MESSAGE_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_PROPS_CONFIRM_TIME_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_PROPS_IN_PROGRESS_MESSAGE_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_PROPS_YES_ATTRIBUTES_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_PROPS_NO_ATTRIBUTES_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_PROPS_CONFIRM_DESCRIPTION_": "[Aloha]",
  "_A_BUTTON_GROUP_CONFIRM_HEADER_": "[Aloha]",
  "_A_BUTTON_GROUP_CONFIRM_DESCRIPTION_": "[Aloha]"
}
