{
  "_A_BUTTON_COMPONENT_NAME_": "Button",
  "_A_BUTTON_EVENTS_CLICK_DESCRIPTION_": "Emitted when the button is clicked.",
  "_A_BUTTON_EXAMPLE_BIG_TITLE_": "<div>THIS IS MY <strong>HTML TOOLTIP!!!!</strong></div><div>Second line</div>",
  "_A_BUTTON_EXAMPLE_HTML_": "<span onclick='alert(\"Aloha\")'>Aloha</button>",
  "_A_BUTTON_GROUP_ARIA_DISABLED_DESCRIPTION_": "The AButton component allows you to display the button as disabled and set the corresponding accessibility properties. You can use the \"aria-disabled\" prop to indicate the disabled state. This allows you to use events like focus or hover while the button is not clickable.",
  "_A_BUTTON_GROUP_ARIA_DISABLED_HEADER_": "Disabled button with aria-disabled",
  "_A_BUTTON_GROUP_BASIC_DESCRIPTION_": "There are many CSS classes that you can use with the button.",
  "_A_BUTTON_GROUP_COMPLEX_DESCRIPTION_": "The AButton component allows you to use various complex props and events to customize and control the button with advanced functionality. In the following example, multiple props and an event are used to configure the button and control the loading state.",
  "_A_BUTTON_GROUP_COMPLEX_HEADER_": "Using complex props and events",
  "_A_BUTTON_GROUP_DISABLED_DESCRIPTION_": "The AButton component allows you to disable the button by using the \"disabled\" prop. This visually and functionally disables the button, making it non-interactive.",
  "_A_BUTTON_GROUP_DISABLED_HEADER_": "Disabling the button",
  "_A_BUTTON_GROUP_GROUP_DESCRIPTION_": "Group a set of buttons in a single row.",
  "_A_BUTTON_GROUP_GROUP_HEADER_": "Grouping buttons horizontally",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_DESCRIPTION_": "You can group buttons in a table format.",
  "_A_BUTTON_GROUP_GROUP_HORIZONTAL_VERTICAL_HEADER_": "Table-based grouping of buttons",
  "_A_BUTTON_GROUP_GROUP_SIZES_DESCRIPTION_": "Instead of applying button size classes to each button within a group, simply add .a_btn_group_large or .a_btn_group_small to each .a_btn_group, including any nested ones if you have multiple levels of nesting.",
  "_A_BUTTON_GROUP_GROUP_SIZES_HEADER_": "Button group size",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_DESCRIPTION_": "Stack buttons in a vertical column.",
  "_A_BUTTON_GROUP_GROUP_VERTICAL_HEADER_": "Grouping buttons vertically",
  "_A_BUTTON_GROUP_HTML_DESCRIPTION_": "The AButton component allows you to safely display HTML content without fully trusting it. By using the \"html\" prop and the DomPurify library, the provided HTML content is sanitized and securely rendered in the button.",
  "_A_BUTTON_GROUP_HTML_HEADER_": "Safely displaying HTML content using DomPurify",
  "_A_BUTTON_GROUP_ICONS_DESCRIPTION_": "The AButton component allows you to display icons on the left and right side of the button by using the \":icon-left\" and \":icon-right\" props. You can define different icons for different devices to achieve a customizable display.",
  "_A_BUTTON_GROUP_ICONS_HEADER_": "Using icon props",
  "_A_BUTTON_GROUP_LOADING_DESCRIPTION_": "The AButton component allows you to display the button with a loading state and a loading indicator. You can also set the alignment of the loading indicator. This can be useful to indicate that a specific operation is running in the background and the user needs to wait for completion.",
  "_A_BUTTON_GROUP_LOADING_HEADER_": "Button with loading state and loading indicator alignment",
  "_A_BUTTON_GROUP_OUTLINE_DESCRIPTION_": "Need a button but not the bold background colors they bring? Replace the default modifier classes with the .a_btn_outline_* classes to remove all background images and colors on any button.",
  "_A_BUTTON_GROUP_OUTLINE_HEADER_": "Outline Buttons",
  "_A_BUTTON_GROUP_SAFE_HTML_DESCRIPTION_": "The AButton component allows you to use safe HTML content as a string inside the button. By enabling the \"safe-html\" prop and passing an HTML string, the provided HTML content is treated as trusted and directly inserted via the JavaScript \"innerHTML\" attribute.",
  "_A_BUTTON_GROUP_SAFE_HTML_HEADER_": "Using Safe HTML Content as a String inside the Button",
  "_A_BUTTON_GROUP_SIZES_DESCRIPTION_": "Feeling like having larger or smaller buttons? Add .a_btn_large or .a_btn_small for additional sizes.",
  "_A_BUTTON_GROUP_SIZES_HEADER_": "Button Sizes",
  "_A_BUTTON_GROUP_SLOT_APPEND_DESCRIPTION_": "The AButton component allows you to display additional content after the text inside the button by using the \"buttonAppend\" slot. The content placed in the slot will be shown after the text inside the button.",
  "_A_BUTTON_GROUP_SLOT_APPEND_HEADER_": "Using the \"buttonAppend\" Slot",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_DESCRIPTION_": "The AButton component allows you to place custom content inside the button by using the default slot \":slots='default'\". The content placed in the slot will be shown inside the button.",
  "_A_BUTTON_GROUP_SLOT_DEFAULT_HEADER_": "Using the Default Slot",
  "_A_BUTTON_GROUP_SLOT_PREPEND_DESCRIPTION_": "The AButton component allows you to display additional content before the text inside the button by using the \"buttonPrepend\" slot. The content placed in the slot will be shown before the text inside the button.",
  "_A_BUTTON_GROUP_SLOT_PREPEND_HEADER_": "Using the \"buttonPrepend\" Slot",
  "_A_BUTTON_GROUP_SLOT_TITLE_DESCRIPTION_": "The AButton component allows you to define custom HTML content for the button's title by using the \"buttonTitle\" slot along with the \":is-title-html\" prop. The content placed in the slot will be used as an HTML title for the button.",
  "_A_BUTTON_GROUP_SLOT_TITLE_HEADER_": "Using the \"buttonTitle\" Slot for HTML Title",
  "_A_BUTTON_GROUP_SWITCH_DESCRIPTION_": "The AButton component allows you to use the button as a button switch, with two states (active/inactive). By using the \":is-switch\" and \":model-switch\" props, you can enable the button switch and control the state. The button is rendered as a \"button\" element with the \"aria-pressed\" attribute to indicate the state.",
  "_A_BUTTON_GROUP_SWITCH_HEADER_": "Using Button Switch Mode",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_DESCRIPTION_": "The AButton component allows you to display additional text inside the button. This can be useful for adding predefined text before or after the actual button text.",
  "_A_BUTTON_GROUP_TEXT_AFTER_BEFORE_HEADER_": "Additional Text Inside the Button",
  "_A_BUTTON_GROUP_TEXT_OBJECT_DESCRIPTION_": "The AButton component allows you to customize the button's text for different devices. By using the \":text\" prop as an object, you can define different text for mobile and desktop devices.",
  "_A_BUTTON_GROUP_TEXT_OBJECT_HEADER_": "Customizable Text for Different Devices",
  "_A_BUTTON_GROUP_TITLE_ARRAY_DESCRIPTION_": "The AButton component allows you to concatenate multiple titles in a prop. By using the \":title\" prop as an array, you can specify multiple elements that will be merged into a single title for the button.",
  "_A_BUTTON_GROUP_TITLE_ARRAY_HEADER_": "Concatenating Titles in a Prop",
  "_A_BUTTON_GROUP_TITLE_HTML_DESCRIPTION_": "The AButton component allows you to display the title as HTML and control the title placement. By using the \":is-title-html\", \":title\", and \":title-placement\" props, you can use HTML titles and set the positioning of the title.",
  "_A_BUTTON_GROUP_TITLE_HTML_HEADER_": "Displaying HTML Title and Title Placement",
  "_A_BUTTON_PROPS_ARIA_DISABLED_DESCRIPTION_": "Specifies whether the button should be marked as disabled. When set to true, the button is displayed as disabled, and the \"aria-disabled\" accessibility property is added.",
  "_A_BUTTON_PROPS_ARIA_LABEL_DESCRIPTION_": "Specifies the ARIA label for the button. You can use a string, number, or object as the value to set the desired label.",
  "_A_BUTTON_PROPS_ATTRIBUTES_DESCRIPTION_": "Specifies additional attributes for the button. You can use an object to set the desired attributes and their values.",
  "_A_BUTTON_PROPS_CLASS_DESCRIPTION_": "CSS class",
  "_A_BUTTON_PROPS_DISABLED_DESCRIPTION_": "Specifies whether the button should be disabled. When set to true, the button is disabled.",
  "_A_BUTTON_PROPS_EXTRA_DESCRIPTION_": "Extra object for translation",
  "_A_BUTTON_PROPS_HTML_DESCRIPTION_": "Specifies the HTML content to be displayed inside the button.",
  "_A_BUTTON_PROPS_HTML_SCREEN_READER_DESCRIPTION_": "Specifies the HTML for the screen reader content of the button. You can use a string, number, or object as the value to set the desired HTML content.",
  "_A_BUTTON_PROPS_ICON_ATTRIBUTES_DESCRIPTION_": "Specifies additional attributes for the icons. You can use an object to set the desired attributes and their values for the icons.",
  "_A_BUTTON_PROPS_ICON_CLASS_DESCRIPTION_": "Specifies an additional CSS class for the icons.",
  "_A_BUTTON_PROPS_ICON_LEFT_DESCRIPTION_": "Defines the icon on the left side of the button. You can either specify an icon name as a string or define different icons for different devices as an object.",
  "_A_BUTTON_PROPS_ICON_RIGHT_DESCRIPTION_": "Defines the icon on the right side of the button. You can either specify an icon name as a string or define different icons for different devices as an object.",
  "_A_BUTTON_PROPS_ICON_TAG_DESCRIPTION_": "Specifies the custom HTML tag for the icons.",
  "_A_BUTTON_PROPS_ID_DESCRIPTION_": "Specifies a unique ID for the button. If no ID is provided, a unique ID will be automatically generated.",
  "_A_BUTTON_PROPS_IS_SWITCH_DESCRIPTION_": "Specifies whether the button should be used in switch mode. When set to true, the button is rendered as a button switch.",
  "_A_BUTTON_PROPS_IS_TITLE_HTML_DESCRIPTION_": "Specifies whether the title should be interpreted as HTML. When set to true, the title is rendered as HTML.",
  "_A_BUTTON_PROPS_LOADING_ALIGN_DESCRIPTION_": "Specifies the alignment of the loading indicator. You can either specify \"left\" or \"right\" as the value.",
  "_A_BUTTON_PROPS_LOADING_CLASS_DESCRIPTION_": "Specifies the CSS class for the loading state of the button. You can either provide a string with the CSS class or use an object to specify different CSS classes for different states.",
  "_A_BUTTON_PROPS_LOADING_DESCRIPTION_": "Specifies whether the button is in the loading state. When set to true, the button is displayed as \"loading\".",
  "_A_BUTTON_PROPS_MODEL_SWITCH_DESCRIPTION_": "The model value that controls the state of the button switch. When set to true, the button is enabled (pressed=true); otherwise, the button is disabled (pressed=false).",
  "_A_BUTTON_PROPS_PREVENT_DESCRIPTION_": "Specifies whether to prevent the default behavior of event handling functions for the button.",
  "_A_BUTTON_PROPS_SAFE_HTML_DESCRIPTION_": "Enables trust in the passed HTML string and allows its rendering in the button.",
  "_A_BUTTON_PROPS_SAFE_HTML_SCREEN_READER_DESCRIPTION_": "Specifies the safe HTML content for the screen reader area. You can either use a string, number, or object to specify different content for different states.",
  "_A_BUTTON_PROPS_STOP_DESCRIPTION_": "Specifies whether to stop the further propagation of the event.",
  "_A_BUTTON_PROPS_TABINDEX_DESCRIPTION_": "Specifies the tabindex value for the button. The tabindex can be specified as a number or a string.",
  "_A_BUTTON_PROPS_TAG_DESCRIPTION_": "Specifies the HTML tag to use for rendering the button.",
  "_A_BUTTON_PROPS_TEXT_AFTER_DESCRIPTION_": "Defines the text to be displayed after the button text.",
  "_A_BUTTON_PROPS_TEXT_ARIA_HIDDEN_DESCRIPTION_": "Specifies whether the button text should be marked as aria-hidden=\"true\".",
  "_A_BUTTON_PROPS_TEXT_BEFORE_DESCRIPTION_": "Defines the text to be displayed before the button text.",
  "_A_BUTTON_PROPS_TEXT_CLASS_DESCRIPTION_": "Specifies the CSS class to apply to the button text.",
  "_A_BUTTON_PROPS_TEXT_DESCRIPTION_": "A string or object that contains the text for different devices. Use the keys \"mobile\" and \"desktop\" to specify the corresponding text for each device.",
  "_A_BUTTON_PROPS_TEXT_SCREEN_READER_DESCRIPTION_": "Specifies the text to be used for screen readers.",
  "_A_BUTTON_PROPS_TITLE_DESCRIPTION_": "A string or an array of elements to be concatenated into a single title.",
  "_A_BUTTON_PROPS_TITLE_PLACEMENT_DESCRIPTION_": "The placement of the HTML title.",
  "_A_BUTTON_PROPS_TYPE_DESCRIPTION_": "Specifies the type of the button. Allowed values are \"button\", \"submit\", and \"reset\".",
  "_A_BUTTON_SLOT_BUTTON_APPEND_DESCRIPTION_": "The slot that contains the content to be displayed after the text in the button.",
  "_A_BUTTON_SLOT_BUTTON_PREPEND_DESCRIPTION_": "The slot that contains the content to be displayed before the text in the button.",
  "_A_BUTTON_SLOT_BUTTON_TITLE_DESCRIPTION_": "The slot that contains the HTML content to be used as the title for the button.",
  "_A_BUTTON_SLOT_DEFAULT_DESCRIPTION_": "The default slot that contains the content for the button."
}