{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Ermöglicht die interaktive Auswahl eines Datumsbereichs durch die Bereitstellung zweier Datumsfelder zur Definition von 'Von' und 'Bis' Werten.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Ein interner Bezeichner, der zur Erstellung spezifischer IDs für Elemente innerhalb der Komponente verwendet wird.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Eine alternative ID, die den Standard-'id'-Wert überschreibt, falls spezifische HTML-Interaktionen erforderlich sind.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_WIDTH_": "Legt die Breite der Datepicker-Komponente fest, akzeptiert als Zeichenkette oder Zahl, und beeinflusst die visuelle Darstellung.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Dient zur Speicherung und Verwaltung der ausgewählten Datumsintervallwerte innerhalb der Komponente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Steuert, ob Benutzerinteraktionen mit dem Datepicker-Bereich möglich sind oder nicht.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Enthält konfigurierbare Parameter und Attribute, die das Verhalten und Aussehen des Datepickers anpassen.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Bietet eine Möglichkeit, die ID-Attribute der Komponentenelemente für den Fall zu individualisieren, dass mehrere Instanzen auf derselben Seite existieren.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Flag zur Steuerung von visuellen Fehlerzuständen oder zur Aktivierung spezifischer Logik bei Fehlerzuständen innerhalb der Komponente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informiert das Elternelement über Änderungen der Eingabewerte und übermittelt die aktuellen Werte des Datepicker-Bereichs.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Benachrichtigt das Elternelement, wenn eine endgültige Datumsauswahl getroffen wurde, und sendet die neuen Daten zur weiteren Verwendung oder Verarbeitung.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informiert das Elternelement, wenn der Datepicker fokussiert wird, was für die Aktivierung spezieller UI-States oder die Ausführung bestimmter Logiken nützlich sein kann.",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_HEADER_": "Erweiterte Anpassung",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_DESCRIPTION_": "Anpassung der visuellen Darstellung und Steuerung der Zugänglichkeit für eine vielseitige Benutzererfahrung.",
  "_A_DATEPICKER_RANGE_BASIC_HEADER_": "Einfache Datumsauswahl",
  "_A_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Auswahl von Daten mit Standardwerten durch die 'model' und 'input' Props.",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_HEADER_": "Detaillierte Konfiguration",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_DESCRIPTION_": "Tiefgreifende Integration mit erweiterten Einstellungen für eine optimale Fehlerbehandlung und Benutzerinteraktion.",
  "_A_DATEPICKER_RANGE_EVENTS_HEADER_": "Event-Handling",
  "_A_DATEPICKER_RANGE_EVENTS_DESCRIPTION_": "Managt Benutzerereignisse wie Fokus und Eingabeänderungen.",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_HEADER_": "ID und Fehlersteuerung",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Kontrolliert die Fehleranzeige und vergibt IDs mittels 'idPrefix'."
}
