{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Ermöglicht die interaktive Auswahl eines Datumsbereichs durch die Bereitstellung zweier Datumsfelder zur Definition von 'Von' und 'Bis' Werten.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Dient zur Speicherung und Verwaltung der ausgewählten Datumsintervallwerte innerhalb der Komponente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_SELECTED_": "Handhabt zusätzliche Aktionen oder Seiteneffekte, die nach der Auswahl eines Datums ausgelöst werden sollen.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Steuert, ob Benutzerinteraktionen mit dem Datepicker-Bereich möglich sind oder nicht.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Enthält konfigurierbare Parameter und Attribute, die das Verhalten und Aussehen des Datepickers anpassen.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Bietet eine Möglichkeit, die ID-Attribute der Komponentenelemente für den Fall zu individualisieren, dass mehrere Instanzen auf derselben Seite existieren.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Flag zur Steuerung von visuellen Fehlerzuständen oder zur Aktivierung spezifischer Logik bei Fehlerzuständen innerhalb der Komponente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informiert das Elternelement über Änderungen der Eingabewerte und übermittelt die aktuellen Werte des Datepicker-Bereichs.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Benachrichtigt das Elternelement, wenn eine endgültige Datumsauswahl getroffen wurde, und sendet die neuen Daten zur weiteren Verwendung oder Verarbeitung.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informiert das Elternelement, wenn der Datepicker fokussiert wird, was für die Aktivierung spezieller UI-States oder die Ausführung bestimmter Logiken nützlich sein kann.",
  "_A_DATEPICKER_RANGE_MODEL_SELECTED_DISABLED_HEADER_": "Model- und Statusmanagement",
  "_A_DATEPICKER_RANGE_MODEL_SELECTED_DISABLED_DESCRIPTION_": "Integriert die 'model' und 'selected' Eigenschaften und steuert den deaktivierten Status.",
  "_A_DATEPICKER_RANGE_OPTIONS_CLASS_NAME_HEADER_": "Anpassbares Styling",
  "_A_DATEPICKER_RANGE_OPTIONS_CLASS_NAME_DESCRIPTION_": "Nutzt die 'className' Eigenschaft für individuelle Styles.",
  "_A_DATEPICKER_RANGE_OPTIONS_DATA_ERRORS_HEADER_": "Erweiterte Daten- und Fehlerkontrolle",
  "_A_DATEPICKER_RANGE_OPTIONS_DATA_ERRORS_DESCRIPTION_": "Verarbeitet Daten und Fehler unter Einbeziehung von zusätzlichen statischen Informationen.",
  "_A_DATEPICKER_RANGE_OPTIONS_EVENTS_HEADER_": "Event-Handling",
  "_A_DATEPICKER_RANGE_OPTIONS_EVENTS_DESCRIPTION_": "Managt Benutzerereignisse wie Fokus und Eingabeänderungen.",
  "_A_DATEPICKER_RANGE_OPTIONS_ID_PREFIX_IS_ERROR_HEADER_": "ID und Fehlersteuerung",
  "_A_DATEPICKER_RANGE_OPTIONS_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Kontrolliert die Fehleranzeige und vergibt IDs mittels 'idPrefix'."
}
