{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Allows interactive selection of a date range by providing two date fields to define 'From' and 'To' values.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "An internal identifier used to create specific IDs for elements within the component.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "An alternative ID that overrides the default 'id' value in case specific HTML interactions are required.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_WIDTH_": "Sets the width of the date picker component, accepts as a string or number, and influences the visual representation.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Used to store and manage the selected date interval values within the component.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Controls whether user interactions with the date picker area are possible or not.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Contains configurable parameters and attributes that customize the behavior and appearance of the date picker.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Provides a way to customize the ID attributes of component elements in case multiple instances exist on the same page.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Flag to control visual error states or activate specific logic in error states within the component.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informs the parent element of changes in input values and transmits the current values of the date picker area.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Notifies the parent element when a final date selection has been made and sends the new data for further use or processing.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informs the parent element when the date picker is focused, which can be useful for activating special UI states or executing specific logic.",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_HEADER_": "Advanced Customization",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_DESCRIPTION_": "Customization of visual representation and control of accessibility for a versatile user experience.",
  "_A_DATEPICKER_RANGE_BASIC_HEADER_": "Basic Date Selection",
  "_A_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Selection of dates with default values through the 'model' and 'input' props.",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_HEADER_": "Detailed Configuration",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_DESCRIPTION_": "Deep integration with advanced settings for optimal error handling and user interaction.",
  "_A_DATEPICKER_RANGE_EVENTS_HEADER_": "Event Handling",
  "_A_DATEPICKER_RANGE_EVENTS_DESCRIPTION_": "Manages user events such as focus and input changes.",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_HEADER_": "ID and Error Control",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Controls error display and assigns IDs using 'idPrefix'."
}
