{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permite la selección interactiva de un rango de fechas proporcionando dos campos de fecha para definir los valores 'Desde' y 'Hasta'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Sirve para almacenar y gestionar los valores del intervalo de fechas seleccionado dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_SELECTED_": "Maneja acciones adicionales o efectos secundarios que se deben activar al seleccionar una fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Controla si las interacciones del usuario con el rango del selector de fechas son posibles o no.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Contiene parámetros y atributos configurables para modificar el comportamiento y la apariencia del selector de fechas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Proporciona un medio para personalizar los atributos ID de los elementos del componente en caso de que existan múltiples instancias en la misma página.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Indicador para controlar estados de error visuales o habilitar lógica específica durante estados de error dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informa al elemento padre sobre los cambios en los valores de entrada y transmite los valores actuales del rango del selector de fechas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Notifica al elemento padre cuando se ha realizado una selección de fecha final y envía los nuevos datos para su uso o procesamiento adicional.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informa al elemento padre cuando el selector de fechas está enfocado, lo que puede ser útil para activar estados de UI especiales o ejecutar ciertas lógicas.",
  "_A_DATEPICKER_RANGE_MODEL_SELECTED_DISABLED_HEADER_": "Gestión de Modelo y Estado",
  "_A_DATEPICKER_RANGE_MODEL_SELECTED_DISABLED_DESCRIPTION_": "Integra las propiedades 'model' y 'selected' y gestiona el estado desactivado.",
  "_A_DATEPICKER_RANGE_OPTIONS_CLASS_NAME_HEADER_": "Estilo Personalizable",
  "_A_DATEPICKER_RANGE_OPTIONS_CLASS_NAME_DESCRIPTION_": "Utiliza la propiedad 'className' para estilos personalizados.",
  "_A_DATEPICKER_RANGE_OPTIONS_DATA_ERRORS_HEADER_": "Control Avanzado de Datos y Errores",
  "_A_DATEPICKER_RANGE_OPTIONS_DATA_ERRORS_DESCRIPTION_": "Procesa datos y errores, incorporando información estática adicional.",
  "_A_DATEPICKER_RANGE_OPTIONS_EVENTS_HEADER_": "Manejo de Eventos",
  "_A_DATEPICKER_RANGE_OPTIONS_EVENTS_DESCRIPTION_": "Gestiona eventos de usuario como foco y cambios de entrada.",
  "_A_DATEPICKER_RANGE_OPTIONS_ID_PREFIX_IS_ERROR_HEADER_": "Control de ID y Errores",
  "_A_DATEPICKER_RANGE_OPTIONS_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Controla la visualización de errores y asigna ID usando 'idPrefix'."
}
