{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permet la sélection interactive d'une plage de dates en fournissant deux champs de date pour définir les valeurs 'De' et 'À'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Un identifiant interne utilisé pour créer des identifiants spécifiques aux éléments à l'intérieur du composant.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Un identifiant alternatif qui remplace la valeur 'id' par défaut en cas d'interactions HTML spécifiques requises.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_WIDTH_": "Définit la largeur du composant de sélection de date, accepte une chaîne de caractères ou un nombre, et influe sur la représentation visuelle.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Utilisé pour stocker et gérer les valeurs de l'intervalle de dates sélectionné à l'intérieur du composant.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Contrôle si les interactions de l'utilisateur avec la zone de sélection de date sont possibles ou non.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Contient des paramètres configurables et des attributs qui personnalisent le comportement et l'apparence du sélecteur de dates.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Fournit un moyen de personnaliser les attributs d'identification des éléments du composant en cas de multiples instances sur la même page.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Drapeau pour contrôler les états d'erreur visuels ou activer une logique spécifique en cas d'erreurs à l'intérieur du composant.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informe l'élément parent des modifications apportées aux valeurs d'entrée et transmet les valeurs actuelles de la zone de sélection de dates.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Notifie l'élément parent lorsqu'une sélection de date finale a été effectuée et envoie les nouvelles données pour une utilisation ou un traitement ultérieur.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informe l'élément parent lorsque le sélecteur de dates est en focus, ce qui peut être utile pour activer des états d'interface utilisateur spéciaux ou exécuter une logique spécifique.",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_HEADER_": "Personnalisation avancée",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_DESCRIPTION_": "Personnalisation de la représentation visuelle et contrôle de l'accessibilité pour une expérience utilisateur polyvalente.",
  "_A_DATEPICKER_RANGE_BASIC_HEADER_": "Sélection de dates de base",
  "_A_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Sélection de dates avec des valeurs par défaut via les propriétés 'model' et 'input'.",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_HEADER_": "Configuration détaillée",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_DESCRIPTION_": "Intégration approfondie avec des paramètres avancés pour une gestion optimale des erreurs et de l'interaction utilisateur.",
  "_A_DATEPICKER_RANGE_EVENTS_HEADER_": "Gestion des événements",
  "_A_DATEPICKER_RANGE_EVENTS_DESCRIPTION_": "Gère les événements utilisateur tels que la mise au point et les modifications de saisie.",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_HEADER_": "Identification et contrôle des erreurs",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Contrôle de l'affichage des erreurs et attribution d'identifiants à l'aide de 'idPrefix'."
}
