{
  "_A_DISCLOSURE_COMPONENT_DESCRIPTION_": "Il componente consente agli utenti di visualizzare o nascondere i contenuti di testo facendo clic su un pulsante. Il pulsante passa da \"Mostra di più\" a \"Mostra di meno\", a seconda che il contenuto di testo completo sia già visibile o meno.",
  "_A_DISCLOSURE_COMPONENT_NAME_": "Mostra/nascondi contenuto",
  "_A_DISCLOSURE_EXPOSES_BUTTON_REF_DESCRIPTION_": "Un oggetto Ref che punta all'elemento DOM del pulsante \"Mostra di più/Mostra di meno\" nel componente. Questo ti consente di manipolare direttamente l'elemento del pulsante o accedere agli eventi come i clic.",
  "_A_DISCLOSURE_EXPOSES_CONTAINER_REF_DESCRIPTION_": "Un oggetto Ref che punta all'elemento DOM del contenitore del componente. Questo può essere utile per controllare l'elemento del contenitore o accedere alle sue proprietà.",
  "_A_DISCLOSURE_EXPOSES_IS_OPEN_DESCRIPTION_": "Un valore booleano che indica se il contenuto di testo esteso è attualmente visualizzato (true) o meno (false). Puoi utilizzare questo valore per monitorare lo stato del componente e reagire di conseguenza.",
  "_A_DISCLOSURE_EXPOSES_TOGGLE_BUTTON_DESCRIPTION_": "Una funzione che può essere chiamata per cambiare lo stato del componente e quindi mostrare o nascondere il contenuto di testo esteso.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_DESCRIPTION_": "In questo esempio viene spiegato come influenzare l'aspetto del pulsante \"Mostra di più/Mostra di meno\" nel componente personalizzando le classi CSS. Usa la proprietà <strong>btn-class</strong> per impostare le classi CSS per il pulsante stesso e la proprietà <strong>btn-parent-class</strong> per specificare la classe CSS per l'elemento padre del pulsante. Queste personalizzazioni ti consentono di dare stile all'aspetto e alla posizione del pulsante secondo le tue preferenze.",
  "_A_DISCLOSURE_GROUP_BTN_CLASS_HEADER_": "Personalizzazione delle classi CSS per il pulsante \"Mostra di più/Mostra di meno\" e il suo elemento padre",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_DESCRIPTION_": "In questo esempio viene spiegato come utilizzare le icone nel componente per migliorare il pulsante \"Mostra di più/Mostra di meno\" e trasmettere informazioni sullo stato del pulsante. Puoi posizionare le icone sia sul lato sinistro che su quello destro del pulsante. Usa le proprietà per configurare le icone per il contenuto di testo più corto e più lungo.",
  "_A_DISCLOSURE_GROUP_BTN_ICONS_HEADER_": "Icone del pulsante",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_DESCRIPTION_": "In questo esempio viene mostrato come personalizzare i testi predefiniti per il pulsante \"Mostra di più/Mostra di meno\" nel componente.",
  "_A_DISCLOSURE_GROUP_BTN_TEXTS_HEADER_": "Personalizzazione dei testi predefiniti per il pulsante \"Mostra di più/Mostra di meno\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_DESCRIPTION_": "In questo esempio viene mostrato come personalizzare individualmente i testi del titolo per il pulsante \"Mostra di più/Mostra di meno\" nel componente. Questo ti consente di fornire titoli amichevoli e significativi per il pulsante e dare agli utenti un'idea chiara di cosa accade quando fanno clic su di esso.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HEADER_": "Personalizzazione dei testi del titolo per il pulsante \"Mostra di più/Mostra di meno\"",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_DESCRIPTION_": "In questo esempio viene spiegato come utilizzare titoli HTML formattati per il pulsante \"Mostra di più/Mostra di meno\" nel componente. Utilizzando la proprietà <strong>is-btn-title-html</strong>, puoi specificare che i titoli del pulsante forniti vengano interpretati e mostrati come HTML.",
  "_A_DISCLOSURE_GROUP_BTN_TITLE_HTML_HEADER_": "Titoli HTML formattati per il pulsante \"Mostra di più/Mostra di meno\"",
  "_A_DISCLOSURE_GROUP_DISABLED_DESCRIPTION_": "In questo esempio imparerai come disabilitare il pulsante \"Mostra di più/Mostra di meno\" nel componente, impedendo agli utenti di cambiare il contenuto di testo, anche se il pulsante è visibile.",
  "_A_DISCLOSURE_GROUP_DISABLED_HEADER_": "Disabilitare il pulsante \"Mostra di più/Mostra di meno\"",
  "_A_DISCLOSURE_GROUP_EVENTS_DESCRIPTION_": "In questo esempio viene mostrato come rispondere al clic sul pulsante \"Mostra di più/Mostra di meno\" nel componente ascoltando l'evento <strong>toggle</strong>. Questo ti consente di eseguire funzioni personalizzate quando il pulsante viene premuto e di monitorare lo stato attuale del componente.",
  "_A_DISCLOSURE_GROUP_EVENTS_HEADER_": "Risposta al clic sul pulsante \"Mostra di più/Mostra di meno\" utilizzando gli Emits",
  "_A_DISCLOSURE_GROUP_EXPOSES_HEADER_": "Esposizione",
  "_A_DISCLOSURE_GROUP_HTML_DESCRIPTION_": "In questo esempio imparerai come visualizzare contenuti HTML in modo sicuro nel componente utilizzando le proprietà <strong>html-less</strong> e <strong>html-more</strong>. Queste proprietà ti consentono di utilizzare testo formattato in HTML mentre implementi misure di sicurezza per prevenire codice dannoso. Usa il metodo DOMPurify.sanitize() per pulire il contenuto e assicurarti che non ci siano codici dannosi nell'output HTML visualizzato.",
  "_A_DISCLOSURE_GROUP_HTML_HEADER_": "Visualizzazione sicura di contenuti HTML",
  "_A_DISCLOSURE_GROUP_NOT_LESS_DESCRIPTION_": "In questo esempio imparerai come controllare la visibilità del pulsante \"Mostra di più/Mostra di meno\" nel componente utilizzando la proprietà <strong>show-less</strong> per determinare se il pulsante deve essere mostrato o no.",
  "_A_DISCLOSURE_GROUP_NOT_LESS_HEADER_": "Controllo della visibilità del pulsante \"Mostra di più/Mostra di meno\"",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_DESCRIPTION_": "In questo esempio viene spiegato come controllare la visualizzazione predefinita del contenuto di testo esteso nel componente. Utilizzando la proprietà <strong>is-open-default</strong>, puoi specificare se il contenuto di testo esteso <strong>(text-more)</strong> deve essere mostrato per impostazione predefinita quando la pagina viene caricata inizialmente.",
  "_A_DISCLOSURE_GROUP_OPEN_DEFAULT_HEADER_": "Visualizzazione predefinita del contenuto di testo esteso",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_DESCRIPTION_": "In questo esempio viene spiegato come visualizzare contenuti HTML attendibili in modo sicuro nel componente. Utilizza le proprietà safe-html-less e safe-html-more. Queste proprietà consentono la visualizzazione diretta di testo formattato in HTML quando sei sicuro che il codice HTML fornito sia attendibile e non contenga elementi dannosi. A differenza delle proprietà precedenti (html-less e html-more), in questo caso il contenuto HTML viene visualizzato senza utilizzare DOMPurify.sanitize().",
  "_A_DISCLOSURE_GROUP_SAFE_HTML_HEADER_": "Visualizzazione di contenuti HTML attendibili",
  "_A_DISCLOSURE_GROUP_SLOTS_DESCRIPTION_": "In questo esempio viene mostrato come utilizzare gli slot per personalizzare individualmente le diverse parti del componente. Usa tre slot: <strong>button</strong>, <strong>less</strong> e <strong>more</strong> per personalizzare il pulsante e le sezioni di testo sottostanti.",
  "_A_DISCLOSURE_GROUP_SLOTS_HEADER_": "Utilizzo degli slot per personalizzazioni personalizzate",
  "_A_DISCLOSURE_PROPS_BTN_CLASS_DESCRIPTION_": "Le classi CSS per il pulsante \"Mostra di più/Mostra di meno\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_LESS_DESCRIPTION_": "L'icona visualizzata a sinistra del pulsante \"Mostra meno\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_LEFT_MORE_DESCRIPTION_": "L'icona visualizzata a sinistra del pulsante \"Mostra di più\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_LESS_DESCRIPTION_": "L'icona visualizzata a destra del pulsante \"Mostra meno\".",
  "_A_DISCLOSURE_PROPS_BTN_ICON_RIGHT_MORE_DESCRIPTION_": "L'icona visualizzata a destra del pulsante \"Mostra di più\".",
  "_A_DISCLOSURE_PROPS_BTN_ID_DESCRIPTION_": "ID per il pulsante \"Mostra di più/Mostra di meno\".",
  "_A_DISCLOSURE_PROPS_BTN_PARENT_CLASS_DESCRIPTION_": "La classe CSS per l'elemento padre del pulsante.",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_LESS_DESCRIPTION_": "Il testo per il pulsante \"Mostra meno\".",
  "_A_DISCLOSURE_PROPS_BTN_TEXT_MORE_DESCRIPTION_": "Il testo per il pulsante \"Mostra di più\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_LESS_DESCRIPTION_": "Il testo del titolo per il pulsante \"Mostra meno\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_MORE_DESCRIPTION_": "Il testo del titolo per il pulsante \"Mostra di più\".",
  "_A_DISCLOSURE_PROPS_BTN_TITLE_PLACEMENT_DESCRIPTION_": "La posizione del titolo HTML.",
  "_A_DISCLOSURE_PROPS_DISABLED_DESCRIPTION_": "Un valore booleano che indica se il pulsante \"Mostra di più/Mostra di meno\" deve essere disabilitato.",
  "_A_DISCLOSURE_PROPS_HTML_LESS_DESCRIPTION_": "Una stringa che contiene il contenuto di testo HTML più corto che verrà visualizzato quando l'utente fa clic su \"Mostra meno\". Questo contenuto è reso sicuro utilizzando DOMPurify.sanitize() per prevenire codice dannoso.",
  "_A_DISCLOSURE_PROPS_HTML_MORE_DESCRIPTION_": "Una stringa che contiene il contenuto di testo HTML più lungo che verrà visualizzato quando l'utente fa clic su \"Mostra di più\". Questo contenuto è reso sicuro utilizzando DOMPurify.sanitize() per prevenire codice dannoso.",
  "_A_DISCLOSURE_PROPS_ID_DESCRIPTION_": "ID per il componente.",
  "_A_DISCLOSURE_PROPS_IS_BTN_TITLE_HTML_DESCRIPTION_": "Un valore booleano che indica se i titoli dei pulsanti forniti devono essere interpretati e visualizzati come HTML.",
  "_A_DISCLOSURE_PROPS_IS_OPEN_DEFAULT_DESCRIPTION_": "Un valore booleano che indica se il contenuto di testo esteso <strong>(text-more)</strong> deve essere visualizzato per impostazione predefinita.",
  "_A_DISCLOSURE_PROPS_PROPS_BTN_ATTRIBUTES_DESCRIPTION_": "Props o attributi HTML per il pulsante \"Mostra di più/Mostra di meno\" <strong>(AButton)</strong>",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_LESS_DESCRIPTION_": "Una stringa che contiene il contenuto di testo HTML più corto che verrà visualizzato quando l'utente fa clic su \"Mostra meno\". Nota che questo contenuto viene visualizzato direttamente e dovrebbe essere utilizzato solo quando sei sicuro che il codice HTML sia sicuro e non rappresenti rischi per la sicurezza.",
  "_A_DISCLOSURE_PROPS_SAFE_HTML_MORE_DESCRIPTION_": "Una stringa che contiene il contenuto di testo HTML più lungo che verrà visualizzato quando l'utente fa clic su \"Mostra di più\". Nota che questo contenuto viene visualizzato direttamente e dovrebbe essere utilizzato solo quando sei sicuro che il codice HTML sia sicuro e non rappresenti rischi per la sicurezza.",
  "_A_DISCLOSURE_PROPS_SHOW_LESS_DESCRIPTION_": "Un valore booleano che indica se il pulsante \"Mostra di più/Mostra di meno\" deve essere visualizzato.",
  "_A_DISCLOSURE_PROPS_TEXT_LESS_DESCRIPTION_": "Il contenuto di testo più corto che verrà visualizzato quando l'utente fa clic su \"Mostra meno\".",
  "_A_DISCLOSURE_PROPS_TEXT_MORE_DESCRIPTION_": "Il contenuto di testo più lungo che verrà visualizzato quando l'utente fa clic su \"Mostra di più\".",
  "_A_DISCLOSURE_SLOT_BUTTON_DESCRIPTION_": "Qui puoi personalizzare il contenuto del pulsante \"Mostra di più/Mostra di meno\". Hai accesso ai valori <strong>isButtonVisible</strong> e <strong>isOpen</strong>, che forniscono informazioni sulla visibilità del pulsante e sullo stato attuale.",
  "_A_DISCLOSURE_SLOT_LESS_DESCRIPTION_": "Questo slot consente di personalizzare il contenuto di testo più corto che verrà visualizzato quando l'utente fa clic su \"Mostra meno\". Hai accesso ai valori <strong>isButtonVisible</strong> e <strong>isOpen</strong>, che forniscono informazioni sulla visibilità del pulsante e sullo stato attuale.",
  "_A_DISCLOSURE_SLOT_MORE_DESCRIPTION_": "Questo slot consente di personalizzare il contenuto di testo più lungo che verrà visualizzato quando l'utente fa clic su \"Mostra di più\". Hai accesso ai valori <strong>isButtonVisible</strong> e <strong>isOpen</strong>, che forniscono informazioni sulla visibilità del pulsante e sullo stato attuale.",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_IS_OPEN_": "Cambia lo stato del componente (isOpen)",
  "_A_DISCLOSURE_TEXT_TOGGLE_WITH_TOGGLE_BUTTON_": "Cambia lo stato del componente (pulsante)",
  "_A_DISCLOSURE_TOGGLE_DESCRIPTION_": "Questo evento viene scatenato quando l'utente fa clic sul pulsante \"Mostra di più/Mostra di meno\". Restituisce un oggetto che contiene informazioni sullo stato attuale del componente, inclusa <strong>isOpen</strong>."
}
