{
  "_A_SPINNER_COMPONENT_DESCRIPTION_": "Il componente <strong lang=\"en\">ASpinner</strong> viene utilizzato per visualizzare un indicatore di caricamento. Supporta attributi <strong lang=\"en\">aria-label</strong> personalizzabili per migliorare l'accessibilità e consente di visualizzare in sicurezza contenuti <strong lang=\"en\">HTML</strong>, oltre a personalizzare il tag utilizzato per il rendering.",
  "_A_SPINNER_COMPONENT_NAME_": "Indicatore di caricamento",
  "_A_SPINNER_GROUP_ARIA_LABEL_DESCRIPTION_": "Questo esempio mostra come utilizzare <strong lang=\"en\">aria-label</strong> con parametri aggiuntivi da <strong lang=\"en\">extra</strong> nel componente <strong lang=\"en\">ASpinner</strong>. L'esempio aggiunge dinamicamente un numero dall'oggetto <strong lang=\"en\">extra</strong> nel testo di <strong lang=\"en\">aria-label</strong> per fornire una descrizione più precisa per gli utenti con esigenze speciali. In questo caso, il testo di <strong lang=\"en\">aria-label</strong> cambierà in 'Caricamento 1', dove <strong>{{ number }}</strong> viene preso dall'oggetto passato.",
  "_A_SPINNER_GROUP_ARIA_LABEL_HEADER_": "<strong lang=\"en\">Aria-label</strong> con parametro <strong lang=\"en\">extra</strong>",
  "_A_SPINNER_GROUP_COLORS_DESCRIPTION_": "Questo esempio mostra come utilizzare vari colori per il componente <strong lang=\"en\">ASpinner</strong>. Puoi applicare diverse classi <strong lang=\"en\">CSS</strong>, come <strong lang=\"en\">a_color_black</strong>, <strong lang=\"en\">a_color_danger</strong> o <strong lang=\"en\">a_color_primary</strong>, per cambiare il colore dello spinner. Sono disponibili colori standard come <strong lang=\"en\">primary</strong>, <strong lang=\"en\">success</strong> e <strong lang=\"en\">warning</strong>, oltre a varie sfumature di grigio e colori del testo.",
  "_A_SPINNER_GROUP_COLORS_HEADER_": "Colori",
  "_A_SPINNER_GROUP_SIZES_DESCRIPTION_": "Questo esempio mostra come utilizzare diverse dimensioni per il componente <strong lang=\"en\">ASpinner</strong>. Il componente supporta tre dimensioni: <strong lang=\"en\">small</strong>, <strong lang=\"en\">medium</strong> (predefinito) e <strong lang=\"en\">large</strong>. La dimensione viene impostata utilizzando la classe <strong lang=\"en\">CSS</strong> appropriata, come <strong lang=\"en\">a_spinner_small</strong> per uno spinner piccolo e <strong lang=\"en\">a_spinner_large</strong> per uno grande. La dimensione media viene visualizzata di default.",
  "_A_SPINNER_GROUP_SIZES_HEADER_": "Dimensioni",
  "_A_SPINNER_PROPS_ARIA_LABEL_DESCRIPTION_": "L'attributo <strong lang=\"en\">aria-label</strong> per migliorare l'accessibilità. È possibile specificare un testo diverso per i dispositivi mobili e desktop o passare una stringa per tutti i dispositivi.",
  "_A_SPINNER_PROPS_SAFE_HTML_DESCRIPTION_": "Contenuto <strong lang=\"en\">HTML</strong> sicuro che verrà visualizzato all'interno dell'indicatore di caricamento. Utilizzato per personalizzare il contenuto interno dello spinner.",
  "_A_SPINNER_PROPS_TAG_DESCRIPTION_": "Il tag <strong lang=\"en\">HTML</strong> utilizzato per il rendering dell'indicatore di caricamento. Di default è <strong lang=\"en\">span</strong>, ma può essere cambiato in qualsiasi altro tag appropriato.",
  "_PAGE_SPINNER_ARIA_LABEL_{{number}}_": "Caricamento {{ number }}"
}