{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permite la selección interactiva de un rango de fechas proporcionando dos campos de fecha para definir los valores 'Desde' y 'Hasta'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Un identificador interno utilizado para crear identificadores específicos para elementos dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Un identificador alternativo que reemplaza el valor 'id' por defecto en caso de necesitar interacciones HTML específicas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_WIDTH_": "Establece el ancho del componente de selección de fecha, acepta una cadena o número y afecta la representación visual.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Se utiliza para almacenar y gestionar los valores del intervalo de fechas seleccionado dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Controla si las interacciones del usuario con la zona de selección de fecha están habilitadas o deshabilitadas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Contiene parámetros y atributos configurables que personalizan el comportamiento y la apariencia del selector de fechas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Proporciona una forma de personalizar los atributos de identificación de elementos del componente en caso de que existan múltiples instancias en la misma página.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Bandera para controlar los estados de error visuales o activar lógica específica en casos de error dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informa al elemento padre sobre los cambios en los valores de entrada y transmite los valores actuales de la zona de selección de fechas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Notifica al elemento padre cuando se ha realizado una selección de fecha final y envía los nuevos datos para su uso o procesamiento adicional.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informa al elemento padre cuando el selector de fechas está enfocado, lo que puede ser útil para activar estados de IU especiales o ejecutar lógica específica.",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_HEADER_": "Personalización avanzada",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_DESCRIPTION_": "Personalización de la representación visual y control de la accesibilidad para una experiencia de usuario versátil.",
  "_A_DATEPICKER_RANGE_BASIC_HEADER_": "Selección de fechas básica",
  "_A_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Selección de fechas con valores predeterminados a través de las propiedades 'model' e 'input'.",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_HEADER_": "Configuración detallada",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_DESCRIPTION_": "Integración profunda con configuraciones avanzadas para un manejo óptimo de errores e interacción del usuario.",
  "_A_DATEPICKER_RANGE_EVENTS_HEADER_": "Manejo de eventos",
  "_A_DATEPICKER_RANGE_EVENTS_DESCRIPTION_": "Administra eventos de usuario como el enfoque y los cambios en la entrada.",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_HEADER_": "Identificación y control de errores",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Controla la visualización de errores y asigna identificadores mediante 'idPrefix'."
}
