{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permite la selección interactiva de un rango de fechas proporcionando dos campos de fecha para definir los valores 'Desde' y 'Hasta'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Un identificador interno utilizado para crear identificadores específicos para elementos dentro del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Un ID alternativo que anula el valor predeterminado de 'id' en caso de que se requieran interacciones HTML específicas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Proporciona una forma de personalizar los atributos de ID de los elementos del componente en caso de que existan múltiples instancias en la misma página.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_APPEND_TO_BODY_": "Determina si el desplegable del selector de fecha se adjunta directamente al cuerpo HTML.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_CHANGE_": "Una función que se llama cada vez que se cambia la selección de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_CLEARABLE_": "Permite borrar la selección de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Evita cualquier interacción con el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_FROM_": "Deshabilita la interacción con la fecha de inicio.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_UNTIL_": "Deshabilita la interacción con la fecha de fin.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ERRORS_": "Muestra mensajes de error si hay problemas con la selección de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ERRORS_ALL_": "Recopila todos los mensajes de error relacionados con el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_EXTRA_": "Extra para texto de ayuda.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FIRST_DAY_OF_WEEK_": "Establece qué día se considera como el comienzo de la semana.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FORMAT_": "Determina el formato de la fecha mostrada.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FORMAT_SAVE_": "Determina el formato de la fecha cuando se guarda.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HELP_TEXT_": "Proporciona texto útil o guía para usar el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ICON_DAY_": "Permite el uso de un ícono especial para ciertos días.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_": "Permite establecer atributos adicionales para la entrada del selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_FROM_": "Permite atributos adicionales para la entrada de fecha de inicio.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_UNTIL_": "Permite atributos adicionales para la entrada de fecha de fin.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_CLASS_": "Aplica clases CSS a la entrada del selector de fecha para darle estilo.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_NAME_": "Establece el atributo de nombre de la entrada del selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_WIDTH_": "Determina el ancho del campo de entrada del selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_HIDE_": "Determina si el selector de fecha es visible o no.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_RENDER_": "Determina si se debe renderizar el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_KEY_FROM_": "Establece el nombre de clave para la fecha de inicio en el modelo de datos.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_KEY_UNTIL_": "Establece el nombre de clave para la fecha de fin en el modelo de datos.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_": "Define el texto de etiqueta para el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_CLASS_": "Aplica clases CSS a la etiqueta para darle estilo.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_FROM_": "Etiqueta para el selector de fecha 'Desde'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_UNTIL_": "Etiqueta para el selector de fecha 'Hasta'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LANG_": "Establece el idioma utilizado para el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_UNDEFINED_": "Contiene un marcador de posición si el modelo de datos no existe.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_VALUE_": "El rango de fechas seleccionado actualmente en el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Permite opciones de configuración adicionales para el selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEHOLDER_FROM_": "Texto de marcador de posición para el selector de fecha 'Desde' cuando no se ha seleccionado ninguna fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEHOLDER_UNTIL_": "Texto de marcador de posición para el selector de fecha 'Hasta' cuando no se ha seleccionado ninguna fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEMENT_": "Controla la posición en la que se mostrará el desplegable del selector de fecha en relación con el campo de entrada.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_POPUP_STYLE_": "Estilos personalizados para el desplegable del selector de fecha.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_READONLY_": "Evita que la fecha se cambie pero permite la interacción.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_REQUIRED_": "Determina si la selección de fecha es obligatoria antes de enviar un formulario.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_SHORTSCUTS_": "Establece rangos de fecha predefinidos para una selección rápida.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_TYPE_": "Especifica el tipo de selector de fecha, como fecha única o rango de fechas.",
  "_PAGE_DATEPICKER_RANGE_BASIC_HEADER_": "Uso básico del Selector de Fecha para Rangos",
  "_PAGE_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Un componente simple de selector de fecha que permite al usuario seleccionar un rango de fechas con una etiqueta clara.",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_HEADER_": "Personalización del Primer Día de la Semana",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_DESCRIPTION_": "Utilización de la propiedad 'firstDayOfWeek' para establecer el inicio de la semana en jueves (4) en el componente de selector de fecha para rangos.",
  "_PAGE_DATEPICKER_RANGE_DISABLED_VARIANTS_HEADER_": "Diversos Estados Deshabilitados para el Selector de Fecha de Rango",
  "_PAGE_DATEPICKER_RANGE_DISABLED_VARIANTS_DESCRIPTION_": "Uso de las propiedades 'disabled', 'disabledFrom' y 'disabledUntil', cada una de las cuales afecta la disponibilidad de selecciones en el componente de selector de fecha de rango.",
  "_PAGE_DATEPICKER_RANGE_FORMAT_CUSTOMIZATION_HEADER_": "Formatos de Fecha Personalizados en el Selector de Fecha de Rango",
  "_PAGE_DATEPICKER_RANGE_FORMAT_CUSTOMIZATION_DESCRIPTION_": "Uso de las propiedades 'format' y 'formatSave' para formatos de visualización y almacenamiento personalizados en el componente de selector de fecha de rango.",
  "_PAGE_DATEPICKER_RANGE_HELP_TEXT_HEADER_": "Texto de Ayuda en el Selector de Fecha de Rango",
  "_PAGE_DATEPICKER_RANGE_HELP_TEXT_DESCRIPTION_": "Incorporación de la propiedad 'helpText' para proporcionar contexto adicional o instrucciones para el componente de selector de fecha de rango.",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_EXAMPLE_": "Primer Día como Jueves"
}
