{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permet la sélection interactive d'une plage de dates en fournissant deux champs de date pour définir les valeurs 'De' et 'À'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Un identifiant interne utilisé pour créer des identifiants spécifiques aux éléments dans le composant.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Un ID alternatif qui remplace la valeur par défaut de 'id' en cas d'interactions HTML spécifiques requises.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Fournit un moyen de personnaliser les attributs d'ID des éléments du composant en cas de présence de plusieurs instances sur la même page.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_APPEND_TO_BODY_": "Détermine si le sélecteur de date se rattache directement au corps HTML.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_CHANGE_": "Une fonction appelée chaque fois que la sélection de date est modifiée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_CLEARABLE_": "Permet de effacer la sélection de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Empêche toute interaction avec le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_FROM_": "Désactive l'interaction avec la date de début.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_UNTIL_": "Désactive l'interaction avec la date de fin.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ERRORS_": "Affiche des messages d'erreur s'il y a des problèmes avec la sélection de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ERRORS_ALL_": "Collecte tous les messages d'erreur liés au sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_EXTRA_": "Supplémentaire pour le texte d'aide.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FIRST_DAY_OF_WEEK_": "Définit quel jour est considéré comme le début de la semaine.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FORMAT_": "Détermine le format de la date affichée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_FORMAT_SAVE_": "Détermine le format de la date lorsqu'elle est enregistrée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HELP_TEXT_": "Fournit un texte utile ou des conseils pour utiliser le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ICON_DAY_": "Permet l'utilisation d'une icône spéciale pour certains jours.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_": "Permet de définir des attributs supplémentaires pour l'entrée du sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_FROM_": "Permet des attributs supplémentaires pour l'entrée de la date de début.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_ATTRIBUTES_UNTIL_": "Permet des attributs supplémentaires pour l'entrée de la date de fin.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_CLASS_": "Applique des classes CSS à l'entrée du sélecteur de date pour la mise en forme.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_NAME_": "Définit l'attribut de nom du champ d'entrée du sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_INPUT_WIDTH_": "Détermine la largeur du champ d'entrée du sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_HIDE_": "Détermine si le sélecteur de date est visible ou non.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_RENDER_": "Détermine si le sélecteur de date doit être rendu.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_KEY_FROM_": "Définit le nom de la clé pour la date de début dans le modèle de données.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_KEY_UNTIL_": "Définit le nom de la clé pour la date de fin dans le modèle de données.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_": "Définit le texte de l'étiquette pour le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_CLASS_": "Applique des classes CSS à l'étiquette pour la mise en forme.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_FROM_": "Étiquette pour le sélecteur de date 'De'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LABEL_UNTIL_": "Étiquette pour le sélecteur de date 'À'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_LANG_": "Définit la langue utilisée pour le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_UNDEFINED_": "Contient un espace réservé si le modèle de données n'existe pas.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_VALUE_": "La plage de dates actuellement sélectionnée dans le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Permet des options de configuration supplémentaires pour le sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEHOLDER_FROM_": "Texte de l'espace réservé pour le sélecteur de date 'De' lorsque aucune date n'est sélectionnée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEHOLDER_UNTIL_": "Texte de l'espace réservé pour le sélecteur de date 'À' lorsque aucune date n'est sélectionnée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_PLACEMENT_": "Contrôle l'emplacement où le sélecteur de date apparaîtra par rapport au champ d'entrée.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_POPUP_STYLE_": "Styles personnalisés pour le menu déroulant du sélecteur de date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_READONLY_": "Empêche la modification de la date mais permet toujours l'interaction.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_REQUIRED_": "Détermine si la sélection de date est obligatoire avant de soumettre un formulaire.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_SHORTSCUTS_": "Définit des plages de dates prédéfinies pour une sélection rapide.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_TYPE_": "Spécifie le type de sélecteur de date, comme date unique ou plage de dates.",
  "_PAGE_DATEPICKER_RANGE_BASIC_HEADER_": "Utilisation basique du Sélecteur de Date pour les Plages",
  "_PAGE_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Un composant simple de sélecteur de date permettant à l'utilisateur de choisir une plage de dates avec une étiquette claire.",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_HEADER_": "Personnalisation du Premier Jour de la Semaine",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_DESCRIPTION_": "Utilisation de la propriété 'firstDayOfWeek' pour définir le début de la semaine le jeudi (4) dans le composant de sélecteur de date pour les plages.",
  "_PAGE_DATEPICKER_RANGE_DISABLED_VARIANTS_HEADER_": "Divers États Désactivés pour le Sélecteur de Date de Plage",
  "_PAGE_DATEPICKER_RANGE_DISABLED_VARIANTS_DESCRIPTION_": "Utilisation des propriétés 'disabled', 'disabledFrom' et 'disabledUntil', chacune affectant la disponibilité des sélections dans le composant de sélecteur de date de plage.",
  "_PAGE_DATEPICKER_RANGE_FORMAT_CUSTOMIZATION_HEADER_": "Formats de Date Personnalisés dans le Sélecteur de Date de Plage",
  "_PAGE_DATEPICKER_RANGE_FORMAT_CUSTOMIZATION_DESCRIPTION_": "Utilisation des propriétés 'format' et 'formatSave' pour des formats d'affichage et d'enregistrement personnalisés dans le composant de sélecteur de date de plage.",
  "_PAGE_DATEPICKER_RANGE_HELP_TEXT_HEADER_": "Texte d'Aide dans le Sélecteur de Date de Plage",
  "_PAGE_DATEPICKER_RANGE_HELP_TEXT_DESCRIPTION_": "Incorporation de la propriété 'helpText' pour fournir un contexte supplémentaire ou des instructions pour le composant de sélecteur de date de plage.",
  "_PAGE_DATEPICKER_RANGE_CUSTOM_FIRST_DAY_EXAMPLE_": "Premier Jour comme Jeudi"
}
