{
  "_A_DATEPICKER_RANGE_DESCRIPTION_": "Permette la selezione interattiva di un intervallo di date fornendo due campi data per definire i valori 'Da' e 'A'.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_": "Un identificatore interno utilizzato per creare identificatori specifici per gli elementi all'interno del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_HTML_ID_": "Un identificatore alternativo che sostituisce il valore 'id' predefinito nel caso siano necessarie interazioni HTML specifiche.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_WIDTH_": "Imposta la larghezza del componente di selezione data, accetta una stringa o un numero e influenza la rappresentazione visiva.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_MODEL_": "Viene utilizzato per memorizzare e gestire i valori dell'intervallo di date selezionato all'interno del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_DISABLED_": "Controlla se le interazioni dell'utente con l'area di selezione delle date sono abilitate o disabilitate.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_OPTIONS_": "Contiene parametri e attributi configurabili che personalizzano il comportamento e l'aspetto del selettore di date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_ID_PREFIX_": "Fornisce un modo per personalizzare gli attributi di identificazione degli elementi del componente nel caso in cui siano presenti più istanze sulla stessa pagina.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_PROP_IS_ERROR_": "Flag per controllare gli stati di errore visivi o attivare logiche specifiche in caso di errori all'interno del componente.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_INPUT_": "Informa l'elemento padre delle modifiche ai valori di input e trasmette i valori attuali dell'area di selezione delle date.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_CHANGE_": "Notifica all'elemento padre quando è stata effettuata una selezione data finale e invia i nuovi dati per ulteriori utilizzi o elaborazioni.",
  "_A_DATEPICKER_RANGE_DESCRIPTION_EMIT_FOCUS_": "Informa l'elemento padre quando il selettore di date è focalizzato, il che può essere utile per attivare stati dell'interfaccia utente speciali o eseguire logiche specifiche.",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_HEADER_": "Personalizzazione avanzata",
  "_A_DATEPICKER_RANGE_ID_WIDTH_DISABLED_DESCRIPTION_": "Personalizzazione della rappresentazione visiva e controllo dell'accessibilità per un'esperienza utente versatile.",
  "_A_DATEPICKER_RANGE_BASIC_HEADER_": "Selezione date di base",
  "_A_DATEPICKER_RANGE_BASIC_DESCRIPTION_": "Selezione date con valori predefiniti attraverso le proprietà 'model' e 'input'.",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_HEADER_": "Configurazione dettagliata",
  "_A_DATEPICKER_RANGE_OPTIONS_ERRORS_HTML_ID_DESCRIPTION_": "Integrazione approfondita con impostazioni avanzate per una gestione ottimale degli errori e dell'interazione dell'utente.",
  "_A_DATEPICKER_RANGE_EVENTS_HEADER_": "Gestione eventi",
  "_A_DATEPICKER_RANGE_EVENTS_DESCRIPTION_": "Gestisce eventi dell'utente come il focus e le modifiche all'input.",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_HEADER_": "Identificazione e controllo degli errori",
  "_A_DATEPICKER_RANGE_MODEL_ID_PREFIX_IS_ERROR_DESCRIPTION_": "Controlla la visualizzazione degli errori e assegna identificatori mediante 'idPrefix'."
}
